[
  {
    "text": "Important note: If you didn't rescue Eadgar during the Troll Stronghold quest, you will need to do so. He can be found in the prison in the Stronghold. Pickpocket Berry the sleeping guard to get the key to his cell. Once you've rescued him, he will be in the Trollheim cave on the hill. (Even if you have freed Eadgar, he will still be in the prison cell. If you can't pickpocket the Cell key 2 from Berry, you have previously freed Eadgar. Alternatively, you can check your quest log, and it will say \"I've rescued Godric and Mad Eadgar.\" if you have.)",
    "template": "blockquote"
  },
  {
    "text": "Consider doing the first section of the Troll Romance quest while in the area (the three trolls are just to the north-west of the kitchen).",
    "template": "blockquote"
  },
  {
    "text": "This effect rolls its chance of activation regardless of whether or not it passes an accuracy roll.",
    "template": "blockquote"
  },
  {
    "text": "I've never really been one for looking backwards. I prefer to look ahead.",
    "author": "The Player",
    "template": "blockquote"
  },
  {
    "text": "Marigolds produce small orange flowers, with feather-like leaves. These flowers produce a pungent scent that deters many common insect pests. However, due to producing a toxic chemical in the roots, marigolds should not be planted too close to certain crops. Along with repelling insects, marigolds will also repel small herbivores due to their dislike of the smell.",
    "quotesource": "Gielinor's flora - flowers",
    "template": "blockquote"
  },
  {
    "text": "the godfather\nattacked us\nwe have\nfled to safety\nif you are loyal to\nher majesty find\nus by using\ncoordinates\nair dlr djq ajs",
    "template": "blockquote"
  },
  {
    "text": "Native to the forests of Isafdar, these berries are uniquely adaptable as they generally prefer to act as a parasite on trees. However, with correct nutrients, they can still be grown independently by experienced farmers. They are primarily used in the creation of defensive potions. However, they do also have cultural significance around Wintumber. This is because they are used as a decoration under which lovers are expected to kiss.",
    "quotesource": "Gielinor's flora - bushes",
    "template": "blockquote"
  },
  {
    "text": "A woody vine with a large pink flower. Grown for its large tuberous root system, limpwurt is a useful ingredient in potions. Although not popularly consumed, it has an earthy pungent aroma and a very bitter flavour. It is most definitely an acquired taste. One group that appears to have acquired this taste are hobgoblins for they are often seen chewing on limpwurt roots.",
    "quotesource": "Gielinor's flora - flowers",
    "template": "blockquote"
  },
  {
    "text": "You can protect 5 skills in total: 2 combat skills an 1m (respectively) to prevent your Hitpoints falling below that level again.",
    "template": "blockquote"
  },
  {
    "text": "You can protect up to 10 items by placing them in your safe deposit box. Items in your safe deposit box will not be lost to a player who kills you, unlike those found in your bank. Remember that you can only place 10 single items into your safe deposit box, not 10 stacks.",
    "template": "blockquote"
  },
  {
    "text": "Belladona [sic], sometimes known as cave nightshade, is a flowering plant that is closely related to tomatoes and potatoes. However, unlike them, every part of this plant is poisonous, with it reaching its peak deadliness just after flowering. The flowers are thankfully easily identifiable due to being bell-shaped, dull purple and faintly scented. Symptoms of belladonna poisoning include sensitivity to light, blurred vision, loss of balance, staggering, headaches, rash, confusion, hallucinations, delirium, and convulsions. Its only real use is in the production of poison.",
    "quotesource": "Gielinor's flora - flowers",
    "template": "blockquote"
  },
  {
    "text": "Jangerberries are sour and bitter tasting berries that originally come from the Feldip Hills. Their taste means that they are not overly popular to the citizens of Gielinor. However, what they lack in culinary expectations they make up for in their usefulness to warriors. This is because these berries can be used in various potions to improve one's prowess in battle.",
    "quotesource": "Gielinor's flora - bushes",
    "template": "blockquote"
  },
  {
    "text": "'''03 degrees 00 minutes north/south\n02 degrees 00 minutes east/west'''",
    "template": "blockquote"
  },
  {
    "text": "A popular summer fruit normally eaten fresh in slices or made into a juice. While often the focus is on the red flesh, the outer rind is also edible, making an unusual tasting pickle. Watermelon plants consist of a scrambling vine with stems that are fascinatingly pentagon shaped. The fruit itself is a special kind of berry with a hard rind, and is mostly made up of water. The largest ever recorded watermelon was grown by a man named Christopher in Edgeville. It was said to be the weight of a fully-grown troll.",
    "quotesource": "Gielinor's flora - allotments",
    "template": "blockquote"
  },
  {
    "text": "Nasturtiums have bright orange flowers, and rounded, shield-shaped leaves. Producing a pungent odor, the name nasturtium literally translates to nose-twist. All parts of nasturtium are edible, including the flower which makes for an excellent addition to salads due to its slight peppery taste.",
    "quotesource": "Gielinor's flora - flowers",
    "template": "blockquote"
  },
  {
    "text": "Dwellberries are native to Kandarin and are mainly found within McGrubor's Wood. Long thought to have curative properties, the people of Kandarin often hang the dried berries above their windows to prevent illness. In times of particularly virulent plagues, the berries are steamed to produce an oil. This oil is then sniffed through handkerchiefs by the richer or savvier citizens of Kandarin in order to prevent sickness.",
    "quotesource": "Gielinor's flora - bushes",
    "template": "blockquote"
  },
  {
    "text": "Snape grass has a subtle fruity flavour and is often used in teas. When crushed, the leaves emit a fruity smell which can be used to repel some insects, but interestingly has been known to attract bees. Some gardeners claim that planting snape grass will reduce the amount of pests and increase the number of pollinators. However, this has never been officially confirmed. Growing in dense clumps, the blade-like leaves change colour from green to red during changing autumn temperatures.",
    "quotesource": "Gielinor's flora - allotments",
    "template": "blockquote"
  },
  {
    "text": "This species is widely cultivated due to its unique taste. Once mature, the berries have an incredibly tart flavour. In order to be palatable, the berries must be cooked which causes them to lose much of their tartness and become sweeter. As such, the most common dish prepared is redberry pie, a delightful sweet treat with a unique tart hint. Legend has it that this pie was especially popular among the Imcando dwarves. Another use for redberries is in the creation of a potent red dye. Redberries are native to the Kingdom of Misthalin. However, due to their popularity, they can be found across the world.",
    "quotesource": "Gielinor's flora - bushes",
    "template": "blockquote"
  },
  {
    "text": "A favourite amongst people of all ages, strawberries can be eaten fresh or made into jams and pies. It may come as a surprise to many that the strawberry is in fact not a berry. Each outer seed is more like a traditional berry, containing the actual seed inside the hard shell. Interestingly, the variety grown in most allotments around Gielinor was originally produced by a Misthalin breeder. Because of this, it is still known today as the Lumbridge Favourite.",
    "quotesource": "Gielinor's flora - allotments",
    "template": "blockquote"
  },
  {
    "text": "Cadava is an old word which translates to corpse. The reason for this name is clear, as all parts of the bush are poisonous. The berries are by far the most toxic and if ingested they can cause stomach pain, vomiting, reduced heart rate, blurred vision and drowsiness. Thankfully, they are easily identifiable by their bright pink berries, so few accidents occur. These bushes are mainly found near Varrock and are not commonly found elsewhere due to the danger they pose. However, the berries do still have some limited uses as skilled apothecaries can use them to create cadava potions. These potions are used as powerful sleeping aids by those suffering from extreme insomnia.",
    "quotesource": "Gielinor's flora - bushes",
    "template": "blockquote"
  },
  {
    "text": "As the name suggests, this plant is incredibly poisonous. Every part of it contains toxins that from a mere touch can cause an itchy, irritating, and sometimes painful rash that lasts for many days. The toxins that cause this rash are in abundance in the berries themselves, Because of this, they make an unquestionably gruesome weapon poison that is often used by less than honorable sellswords. Causing swelling, vomiting and fever, victims have described the experience as feeling like your blood is boiling within you.",
    "quotesource": "Gielinor's flora - bushes",
    "template": "blockquote"
  },
  {
    "text": "Onions are served in a variety of dishes and when cut they produce a pungent odour which irritates the eyes. As the onion plant matures, it stores nutrients at the base of the leaves. This creates a swelling and forms a bulb. The layers of the onion bulb are known as scales. In the autumn, the outer scales of the bulb become dry and brittle, forming the onions skin. If not harvested, the green leaves will die over winter and new leaves will appear in the spring. Interestingly, onions are toxic to dogs and cats.",
    "quotesource": "Gielinor's flora - allotments",
    "template": "blockquote"
  },
  {
    "text": "While often mistaken for a vegetable, a tomato is in fact a fruit. An old adage says that a smart man knows a tomato is a fruit while a wise man knows not to put it into a fruit salad. Tomatoes develop after fertilisation and internally contain the seeds for the next generation. Tomato plants are vines and as such generally need support to remain upright. Tomatoes are naturally covered with fine hairs which would become roots if the plant were to collapse. This allows the plant to survive if the vine is damaged enough to sever its connection to its original root.",
    "quotesource": "Gielinor's flora - allotments",
    "template": "blockquote"
  },
  {
    "text": "Sweetcorn can be boiled, steamed, or grilled whole and predominately acts as a popular side dish. The sweetcorn is in fact made up of many small fruit known as kernels, which are attached to the hard woody central cob. Together the cob and kernels make up an ear of corn. Interestingly, if you were to count the rows of kernels, you'd find that there is always an even number. The ear is covered by leaves called the husk. This acts as protection for the developing fruit. The husk can be removed by hand which is known as shucking.",
    "quotesource": "Gielinor's flora - allotments",
    "template": "blockquote"
  },
  {
    "text": "Potatoes are prepared in many ways and are a main staple of every citizens diet. Potatoes are also used to brew vodka. The part of the plant we consume is known as a tuber and is used by the plant as a place to store nutrients. This allows the potato to effectively “die” in the winter, then provide energy for regrowth during the next growing season. Before this occurs, potato plants produce flowers which once pollinated produce small green fruits. These fruits, that resemble green tomatoes, contain the seeds of the plant. The resemblance to tomatoes is no coincidence as potatoes are directly related to them. However, the fruit cannot be eaten as like nightshade, another relation, it contains deadly toxins.",
    "quotesource": "Gielinor's flora - allotments",
    "template": "blockquote"
  },
  {
    "text": "Woad produces an eye-catching display of golden flowers and has blade shaped, bluish leaves. Interestingly, woad is from the same family as the cabbage. Since ancient times, woad has been an important source of blue dye. However, it requires a great amount of skill to produce this dye. According to an expert on dyes from Draynor, the process requires lengthy fermentation of the leaves. However, if persistent, the dye produced is a splendid colour.",
    "quotesource": "Gielinor's flora - flowers",
    "template": "blockquote"
  },
  {
    "text": "At first, Dorgesh-Kaan was ruled over by generals, just as the tribe had been when it was on the surface. Each general succeeded the last by defeating him in combat. The generals were advised by a council of elders, but the Dorgeshuun were no longer an army, and many of the people felt that the council should have authority.",
    "template": "blockquote"
  },
  {
    "text": "The people voted to become a republic, but General Bonehelm refused to give up power, and so the Dorgeshuun Civil War began. The republican faction was the larger, but the military faction contained most of the trained warriors and controlled the magical equipment that the tribe had brought from the surface.",
    "template": "blockquote"
  },
  {
    "text": "General Bonehelm was driven from the city, but dug his own base out the caves nearby. General Bonehelm's army attacked the city using archers mounted on giant frogs. There was a bloody battle, and General Bonehelm was driven back again into his base. But General Bonehelm's mining had weakened the stone around his base, and the retreating army's footsteps caused the roof to collapse, crushing his army. That was the last time one Dorgeshuun has raised arms against another.",
    "template": "blockquote"
  },
  {
    "text": "Asgarnian hops were first bred as a hobby by a Guthixian druid of Taverley whose name has unfortunately been lost. These hops are used to brew Asgarnian ale, one of the most popular ales in Gielinor. Asgarnian ale is known for having a malt-focused, caramelly sweet taste.",
    "quotesource": "Gielinor's flora - hops",
    "template": "blockquote"
  },
  {
    "text": "A cereal grain and a member of the grass family, barley is a key ingredient in beer and whisky. According to historians, barley beer is likely one of the first alcoholic drinks ever developed by the early settlers of Gielinor. In order for barley to be edible, the fibrous outer hull must be removed. Before brewing, the process of malting is started where the grain is placed and soaked in hot water and allowed to grow slightly. This is halted by drying under heat. Once the barley malt is made, the brewing of ale can begin. This is done using a brewing vat filled with water and barley malt as a base. Most ale is fermented with ale yeast and flavoured with hops.",
    "quotesource": "Gielinor's flora - hops",
    "template": "blockquote"
  },
  {
    "text": "A variety that had been passed down for generations by the Wildblood family of Canifis. This hop has become somewhat of a rare specialty and is used in the brewing of slayer's respite. Due to its rarity, finding a vendor of this particular ale presents quite the challenge. Slayer's respite has an unusual sharp sour character with hints of lemon and tart apple.",
    "quotesource": "Gielinor's flora - hops",
    "template": "blockquote"
  },
  {
    "text": "Hammerstone hops were first cultivated by Agnarr Hammerstone in order to brew a better tasting dwarven stout. His innovation gave us the flavour that we know and love today. Dwarven stout has a roasted wheat taste combined with a sweet creamy almost chocolate-like touch. The ale is very popular amongst dwarves, who often use it to prepare for a long hard day in the mines.",
    "quotesource": "Gielinor's flora - hops",
    "template": "blockquote"
  },
  {
    "text": "A tall leafy floral stem that bears several fragrant white flowers. These sweet-smelling beauties take pride of place in any garden. Although magnificent, white lilies have a dark side. While reasonably harmless to humans, if ingested by a cat, the results are often fatal. The white lily symbolises chastity and virtue and as such, it has become a potent symbol among Saradomin worshipers. Some even believe that Sardomin [sic] himself created the lily to improve the crops of his most cherished followers.",
    "quotesource": "Gielinor's flora - flowers",
    "template": "blockquote"
  },
  {
    "text": "The inception of this variety is hazy at best. It said that it was first grown by a resident of Seers Village while on a visit to the island of Crandor. It is wildly used to brew dragon bitter, an ale known for having a prominent bitterness with a mild earthy and bready flavour.",
    "quotesource": "Gielinor's flora - hops",
    "template": "blockquote"
  },
  {
    "text": "It should come as no surprise that the Yanillian hop is the result of tinkering by members of the Wizards' Guild. This variety is an amalgamation of traditional breeding and the magical experiments of a wizard called Soraya. Despite the popularity of the ale, Soraya has remained relatively obscure in today's literature. The resultant brew made from this hop has been known since its inception as the wizard's mind bomb. Granting the user increased magical ability, this ale is not known for its taste which has been compared to warm tap water with a lot of fizz.",
    "quotesource": "Gielinor's flora - hops",
    "template": "blockquote"
  },
  {
    "text": "While not a hop, jute is often grown alongside them due to its similarities. The word jute actually applies to the fiber produced from the plant, with the leaves being known as mallow. Mallow is used in some cultures for culinary purposes while the jute fibers from the stem and outer skin are used in the creation of a strong thread. Jute fibers are uniquely long, soft and shiny and are extracted through a process known as retting. The thread produced by these fibers is used in the creation of twine, rope, sacks and nets. Interestingly, the people of Hosidius, famous for thinking of ingenious ways to use every part of a plant, are known to create a stew from the plant. This dish is known as Molo.",
    "quotesource": "Gielinor's flora - hops",
    "template": "blockquote"
  },
  {
    "text": "A woody evergreen with needle-like leaves. The name rosemary derives from old Sardominist [sic] texts where it is known as Rosmarinus. This roughly translates to sea-dew, likely due to the fact that rosemary thrives by the sea. Rosemary requires very little water it can withstand droughts for very lengthy periods. The leaves are often used to flavour foods, particularly meats. Rosemary sprigs are regularly used as a symbol of remembrance and are often thrown into the graves of fallen warriors.",
    "quotesource": "Gielinor's flora - flowers",
    "template": "blockquote"
  },
  {
    "text": "Cabbage can be prepared and eaten in many different ways, the most common ways being steaming or stewing. Cabbage produces densely leaved heads and grows in sunny, well drained fields. Cabbages are known to cause an increase in flatulence which is believed to be due to some of the unique chemicals within them.",
    "quotesource": "Gielinor's flora - allotments",
    "template": "blockquote"
  },
  {
    "text": "Main article: Fight Caves Wave Rotation Guide",
    "template": "blockquote"
  },
  {
    "text": "Player who first solved the event:\n\nSpider1357\n\nPlayers who contributed to earlier steps:\n\nwendyes\n\ndddvlot\n\nSpider1357\n\nDetael\n\nK1SSIN\n\nJuoppokeke\n\nXaigg\n\n1FrostySOB\n\nGODSLIFE\n\nWinterpropht\n\nrururupert\n\nMistereman22\n\nIly Btw\n\nBelt\n\nAgent Yolo\n\nKexsa\n\nFleur de Lis\n\nlowli fe\n\nMusaUkko",
    "author": "Noticeboard (Crack the Clue III)",
    "template": "blockquote"
  },
  {
    "text": "Old School RuneScape is many things: a nostalgic trip to a world of adventure, a hardcore grind for the most dedicated of players – and for many, it's an escape to a place of safety, enjoyment, and comfort. We want everyone to feel safe and represented here in Gielinor, and as a team, we're united in our commitment to making Old School RuneScape more diverse and inclusive for our community.",
    "author": "The Old School Team",
    "title": "June 2022 Gielinor Gazette",
    "template": "blockquote"
  },
  {
    "text": "Discover new and existing creatures around the world and tame them into friendly companions! Earn their trust and take care of them, and in return they'll aid you on your adventures.",
    "author": "Official tagline from the initial proposal.",
    "template": "blockquote"
  },
  {
    "text": "Study the magical power of nature through Shamanism and unlock the ability to perform rituals. Gather components, perform rituals, and infuse objects with the magic of the Spirit Realm. Create powerful items like Tikis, Totems and Poultices, and augment your own equipment with powerful new effects.",
    "author": "Official tagline from the initial proposal.",
    "template": "blockquote"
  },
  {
    "text": "Whether you’re an explorer setting foot on unexplored territory, a fisherman hoping for a monster catch, a pirate looking to sink every ship in sight, or even a courier looking to move goods from A to B, Sailing has something to offer everyone. So, acquire a vessel, set forth, and travel Gielinor like you’ve never travelled before!",
    "author": "Official tagline from the initial proposal.",
    "template": "blockquote"
  },
  {
    "text": "This statue depicts the legendary hero Xerna, sometimes known as the Mother of Wisdom.",
    "template": "blockquote"
  },
  {
    "text": "It is said that the cloak on display here was crafted during the first Teok Xiki, more commonly known as the Gathering.\n \nThe Gathering is the process used by both the Church of Ralos and the Sect of Ranul to select a new Teokan after the death of the previous one. This cloak was likely presented as a gift to the newly selected Teokan of Ranul.",
    "template": "blockquote"
  },
  {
    "text": "This statue depicts the legendary hero Atlazora, sometimes known as the Jaguar of Night's Shadow.",
    "template": "blockquote"
  },
  {
    "text": "This statue depicts the legendary hero Dizana, sometimes known as the Heroine of the Hunt.",
    "template": "blockquote"
  },
  {
    "text": "This statue depicts the legendary hero Marhuitz, the first king of Fortis. He was sometimes known as the Old Wolf.",
    "template": "blockquote"
  },
  {
    "text": "This statue depicts the legendary hero Quoatlos, sometimes known as the Feathered Serpent.",
    "template": "blockquote"
  },
  {
    "text": "This statue depicts the legendary hero Taur, sometimes known as the Young Bull.",
    "template": "blockquote"
  },
  {
    "text": "The quiver on display here is a replica of the one originally created by the hero Dizana. The hardiness of the quiver, along with Dizana's fame, led to many of these replicas being created. Some of them still exist today and are often used by fighters in the Fortis Colosseum.\n \nThe status of the original quiver is heavily debated. Many claim that it has long been lost, while others believe it exists among the replicas being used within the Colosseum.",
    "template": "blockquote"
  },
  {
    "text": "The crown on display here is the original Crown of Ralos. When King Marhuitz was crowned the first king of Fortis, it was this crown that was placed upon his head.\n \nSince its creation, the crown has been worn by every ruler of the Tullus dynasty. However, after the execution of Emperor Imafore and the passing of the throne to the Arkan dynasty, King Mezpah had a new crown created.",
    "template": "blockquote"
  },
  {
    "text": "Be aware that the diadem normally displayed here was recently stolen. The Grand Museum is willing to pay a high price for information that leads to its return.",
    "template": "blockquote"
  },
  {
    "text": "Be aware that the diadem normally displayed here was recently stolen. However, thanks to a helpful adventurer, the diadem has been recovered and will soon be back on display.",
    "template": "blockquote"
  },
  {
    "text": "The diadem on display here dates back to the earliest days of Varlamore. It was made for the hero Xerna and it is believed she wore it when she wed her long-time companion, Quoatlos. While the diadem was safely displayed here for many years, it was recently stolen by an unknown party. However, thanks to a helpful adventurer, the diadem was quickly recovered.",
    "template": "blockquote"
  },
  {
    "text": "The column on display here is one of two built at the end of the War of Betrayal. This column depicts various key events in Kourend's history, most notably the Age of Strife.\n \nThe Age of Strife was considered the darkest era in Kourend's history, but it was also during this period that refugees fleeing Kourend first braved the Custodia Mountains. It was these refugees who would go on to found the first settlements of Varlamore, including Fortis.",
    "template": "blockquote"
  },
  {
    "text": "The icon on display here is believed to be the oldest icon of Ralos in existance. The icon predates the founding of Fortis by hundreds of years and acts as a reminder of just how long Ralos has been worshipped.\n \nWhile the origin of the icon has long been debated, most historians now agree that it came to Varlamore alongside early settlers from Kourend.",
    "template": "blockquote"
  },
  {
    "text": "The Kualti were founded by King Mezpah after his ascension to the throne. These six elite warrior are chosen from the Knights of Varlamore and act as the royal guard for the ruler of the kingdom.\n \nUpon their selection, each Kualti is granted a weapon of their choice alongside a Kualti dagger, with them keeping these weapons until death. After the passing of a Kualti, their dagger is displayed here in the Grand Museum.",
    "template": "blockquote"
  },
  {
    "text": "The armour normally displayed here is currently being cleaned. \nThe Knights of Varlamore were founded by King Mezpah after his ascension to the throne. These knights are selected by either the kingdom's ruler or their heir, with any citizen of Varlamore having the ability to become one. \nKnights of Varlamore can serve in a variety of duties across the kingdom and are granted a set of prestigious armour like that shown here.",
    "template": "blockquote"
  },
  {
    "text": "The model normally displayed here is currently being cleaned. \n100 years after the founding of Fortis, it was decreed that a second settlement be built to address issues caused by the fast growing population. At the time, the islands of Tempest Bay were not considered a strong contender due to the unstable ground and the presence of a band of hill giants. However, the unlikely defeat of the giants ultimately led to the construnction [sic] of Tempestus. The model here shows the city as it exists today.",
    "template": "blockquote"
  },
  {
    "text": "This statue depicts King Maximus, the creator of the Fortis Colosseum. \nIn the early days of the kingdom, criminals were sacrified to Ralos in a temple atop the Fortis Cliffs. However, King Maximus ordered the destruction of this temple, insisting there was no place for human sacrifice in Varlamore. \nIn place of the temple, King Maximus had the Fortis Colosseum built, with it remaining there to this day.",
    "template": "blockquote"
  },
  {
    "text": "The Royal Accord of Twill is an ancient document detailing the transfer of power from Kourend's Council of Elders to the Five Houses. \nFollowing the War of Betrayal, King Kharedst III of Kourend arranged for the original document to be displayed here in the Grand Museum. However, a naval disaster resulted in the loss of the accord. As such, the document shown here is a replica.",
    "template": "blockquote"
  },
  {
    "text": "The column on display here is one of two built at the end of the War of Betrayal. This column depicts the event that ignited the war between Kourend and Varlamore: Imafore's killing of the Kourend royal family. \nThe war went on to last six years and ended at the Battle of the Proudspire when Varlamorian freedom fighters led by Imafore's own cousin captured him. Imafore was executed soon after, with his cousin, Mezpah Arkan, taking the throne.",
    "template": "blockquote"
  },
  {
    "text": "On display here are various pieces of an Old One statue. The Old Ones were a race that inhabited Varlamore hundreds of years before the first human settlers arrived here, with them being strong worshippers of Ralos and Ranul. \nThis statue is believed to depict a spirit called a nagua. It is said that the Old Ones summoned these spirits for various reasons via a magical art called naguanil.",
    "template": "blockquote"
  },
  {
    "text": "The armour on display here was once worn by the Cloud Titan that inhabited the islands of Tempest Bay. \nDespite the Cloud Titan being defeated around 900 years ago, the armour was not found until roughly 700 years later when it was donated to the museum by a traveller. \nThe traveller claimed to have slain the Cloud Titan himself, with the giant having survived its original defeat. However, experts consider this unlikely.",
    "template": "blockquote"
  },
  {
    "text": "On display here is a fang from the Colossal Wyrm. The wyrm is believed to have originated from deep within the Hailstorm Mountains, but for unknown reasons, it travelled to the Avium Savannah around 200 years ago. The wyrm terrorised the region for many moons before warriors from across the kingdom finally banded together to defeat it.",
    "template": "blockquote"
  },
  {
    "text": "\nThis area contains very dangerous creatures!\nDo not pass unless properly prepared!",
    "template": "blockquote"
  },
  {
    "text": "You inspect the signpost more closely. You see nothing wrong with it initially, but after some time you notice teeth marks in the wood... it looks like several people have tried eating the post.",
    "template": "blockquote"
  },
  {
    "text": "The signpost has a note pinned onto it. The note says: \n'Braindead Butler Wanted \nGravedigging skills essential - Hunchback advantageous \nSee Dr Fenkenstrain at the castle NE of Canifis'",
    "template": "blockquote"
  },
  {
    "text": "The signpost has a note pinned onto it. The note says: \n'AAARRGGGHHHHH!!!!!'",
    "template": "blockquote"
  },
  {
    "text": "~ All yous creatures leaves dem dead-uns boxes alone...else yous \ngonna get bashed and shoved down da under-earth wiv da zogries, \nyous gonna get da sickies by da zogries and end up a",
    "template": "blockquote"
  },
  {
    "text": "You see a selection of books, but one slot is empty with a note in it's \nplace, it says,'On loan to the wizards' guild...to be returned.",
    "template": "blockquote"
  },
  {
    "text": "There is more writing on the sign. It reads: 'This earth mound has been magically prepared. Please keep off. Farming strictly prohibited. You have been warned!'",
    "template": "blockquote"
  }
]