[
  {
    "text": "Belladona [sic], sometimes known as cave nightshade, is a flowering plant that is closely related to tomatoes and potatoes. However, unlike them, every part of this plant is poisonous, with it reaching its peak deadliness just after flowering. The flowers are thankfully easily identifiable due to being bell-shaped, dull purple and faintly scented. Symptoms of belladonna poisoning include sensitivity to light, blurred vision, loss of balance, staggering, headaches, rash, confusion, hallucinations, delirium, and convulsions. Its only real use is in the production of poison.",
    "quotesource": "Gielinor's flora - flowers",
    "template": "blockquote"
  },
  {
    "text": "Cadava is an old word which translates to corpse. The reason for this name is clear, as all parts of the bush are poisonous. The berries are by far the most toxic and if ingested they can cause stomach pain, vomiting, reduced heart rate, blurred vision and drowsiness. Thankfully, they are easily identifiable by their bright pink berries, so few accidents occur. These bushes are mainly found near Varrock and are not commonly found elsewhere due to the danger they pose. However, the berries do still have some limited uses as skilled apothecaries can use them to create cadava potions. These potions are used as powerful sleeping aids by those suffering from extreme insomnia.",
    "quotesource": "Gielinor's flora - bushes",
    "template": "blockquote"
  },
  {
    "text": "Main article: Fight Caves Wave Rotation Guide",
    "template": "blockquote"
  },
  {
    "text": "Player who first solved the event:\n\nSpider1357\n\nPlayers who contributed to earlier steps:\n\nwendyes\n\ndddvlot\n\nSpider1357\n\nDetael\n\nK1SSIN\n\nJuoppokeke\n\nXaigg\n\n1FrostySOB\n\nGODSLIFE\n\nWinterpropht\n\nrururupert\n\nMistereman22\n\nIly Btw\n\nBelt\n\nAgent Yolo\n\nKexsa\n\nFleur de Lis\n\nlowli fe\n\nMusaUkko",
    "author": "Noticeboard (Crack the Clue III)",
    "template": "blockquote"
  },
  {
    "text": "Old School RuneScape is many things: a nostalgic trip to a world of adventure, a hardcore grind for the most dedicated of players – and for many, it’s an escape to a place of safety, enjoyment, and comfort. We want everyone to feel safe and represented here in Gielinor, and as a team, we’re united in our commitment to making Old School RuneScape more diverse and inclusive for our community.",
    "author": "The Old School Team",
    "title": "June 2022 Gielinor Gazette",
    "template": "blockquote"
  },
  {
    "text": "At first, Dorgesh-Kaan was ruled over by generals, just as the tribe had been when it was on the surface. Each general succeeded the last by defeating him in combat. The generals were advised by a council of elders, but the Dorgeshuun were no longer an army, and many of the people felt that the council should have authority.",
    "template": "blockquote"
  },
  {
    "text": "The people voted to become a republic, but General Bonehelm refused to give up power, and so the Dorgeshuun Civil War began. The republican faction was the larger, but the military faction contained most of the trained warriors and controlled the magical equipment that the tribe had brought from the surface.",
    "template": "blockquote"
  },
  {
    "text": "General Bonehelm was driven from the city, but dug his own base out the caves nearby. General Bonehelm's army attacked the city using archers mounted on giant frogs. There was a bloody battle, and General Bonehelm was driven back again into his base. But General Bonehelm's mining had weakened the stone around his base, and the retreating army's footsteps caused the roof to collapse, crushing his army. That was the last time one Dorgeshuun has raised arms against another.",
    "template": "blockquote"
  },
  {
    "text": "Dwellberries are native to Kandarin and are mainly found within McGrubor's Wood. Long thought to have curative properties, the people of Kandarin often hang the dried berries above their windows to prevent illness. In times of particularly virulent plagues, the berries are steamed to produce an oil. This oil is then sniffed through handkerchiefs by the richer or savvier citizens of Kandarin in order to prevent sickness.",
    "quotesource": "Gielinor's flora - bushes",
    "template": "blockquote"
  },
  {
    "text": "Important note: If you didn't rescue Eadgar during the Troll Stronghold quest, you will need to do so. He can be found in the prison in the Stronghold. Pickpocket Berry the sleeping guard to get the key to his cell. Once you've rescued him, he will be in the Trollheim cave on the hill. (Even if you have freed Eadgar, he will still be in the prison cell. If you can't pickpocket the Cell key 2 from Berry, you have previously freed Eadgar. Alternatively, you can check your quest log, and it will say \"I've rescued Godric and Mad Eadgar.\" if you have.)",
    "template": "blockquote"
  },
  {
    "text": "Consider doing the first section of the Troll Romance quest while in the area (the three trolls are just to the north-west of the kitchen).",
    "template": "blockquote"
  },
  {
    "text": "Jangerberries are sour and bitter tasting berries that originally come from the Feldip Hills. Their taste means that they are not overly popular to the citizens of Gielinor. However, what they lack in culinary expectations they make up for in their usefulness to warriors. This is because these berries can be used in various potions to improve one's prowess in battle.",
    "quotesource": "Gielinor's flora - bushes",
    "template": "blockquote"
  },
  {
    "text": "A woody vine with a large pink flower. Grown for its large tuberous root system, limpwurt is a useful ingredient in potions. Although not popularly consumed, it has an earthy pungent aroma and a very bitter flavour. It is most definitely an acquired taste. One group that appears to have acquired this taste are hobgoblins for they are often seen chewing on limpwurt roots.",
    "quotesource": "Gielinor's flora - flowers",
    "template": "blockquote"
  },
  {
    "text": "Marigolds produce small orange flowers, with feather-like leaves. These flowers produce a pungent scent that deters many common insect pests. However, due to producing a toxic chemical in the roots, marigolds should not be planted too close to certain crops. Along with repelling insects, marigolds will also repel small herbivores due to their dislike of the smell.",
    "quotesource": "Gielinor's flora - flowers",
    "template": "blockquote"
  },
  {
    "text": "Nasturtiums have bright orange flowers, and rounded, shield-shaped leaves. Producing a pungent odor, the name nasturtium literally translates to nose-twist. All parts of nasturtium are edible, including the flower which makes for an excellent addition to salads due to its slight peppery taste.",
    "quotesource": "Gielinor's flora - flowers",
    "template": "blockquote"
  },
  {
    "text": "The godfather  attacked us   we have   fled to safety  if you are loyal to   her majesty find   us by using   coordinates   air dlr djq ajs",
    "template": "blockquote"
  },
  {
    "text": "I've never really been one for looking backwards. I prefer to look ahead.",
    "author": "The Player's thoughts shared with Lady Hefin before the second battle of the Underground Pass",
    "title": "Transcript:Song of the Elves",
    "template": "blockquote"
  },
  {
    "text": "As the name suggests, this plant is incredibly poisonous. Every part of it contains toxins that from a mere touch can cause an itchy, irritating, and sometimes painful rash that lasts for many days. The toxins that cause this rash are in abundance in the berries themselves, Because of this, they make an unquestionably gruesome weapon poison that is often used by less than honorable sellswords. Causing swelling, vomiting and fever, victims have described the experience as feeling like your blood is boiling within you.",
    "quotesource": "Gielinor's flora - bushes",
    "template": "blockquote"
  },
  {
    "text": "This species is widely cultivated due to its unique taste. Once mature, the berries have an incredibly tart flavour. In order to be palatable, the berries must be cooked which causes them to lose much of their tartness and become sweeter. As such, the most common dish prepared is redberry pie, a delightful sweet treat with a unique tart hint. Legend has it that this pie was especially popular among the Imcando dwarves. Another use for redberries is in the creation of a potent red dye. Redberries are native to the Kingdom of Misthalin. However, due to their popularity, they can be found across the world.",
    "quotesource": "Gielinor's flora - bushes",
    "template": "blockquote"
  },
  {
    "text": "A woody evergreen with needle-like leaves. The name rosemary derives from old Sardominist [sic] texts where it is known as Rosmarinus. This roughly translates to sea-dew, likely due to the fact that rosemary thrives by the sea. Rosemary requires very little water it can withstand droughts for very lengthy periods. The leaves are often used to flavour foods, particularly meats. Rosemary sprigs are regularly used as a symbol of remembrance and are often thrown into the graves of fallen warriors.",
    "quotesource": "Gielinor's flora - flowers",
    "template": "blockquote"
  },
  {
    "text": "This effect rolls its chance of activation regardless of whether or not it passes an accuracy roll.",
    "template": "blockquote"
  },
  {
    "text": "Whether you’re an explorer setting foot on unexplored territory, a fisherman hoping for a monster catch, a pirate looking to sink every ship in sight, or even a courier looking to move goods from A to B, Sailing has something to offer everyone. So, acquire a vessel, set forth, and travel Gielinor like you’ve never travelled before!",
    "author": "Official tagline from the initial proposal.",
    "template": "blockquote"
  },
  {
    "text": "You can protect 5 skills in total: 2 combat skills an 1m (respectively) to prevent your Hitpoints falling below that level again.",
    "template": "blockquote"
  },
  {
    "text": "You can protect up to 10 items by placing them in your safe deposit box. Items in your safe deposit box will not be lost to a player who kills you, unlike those found in your bank. Remember that you can only place 10 single items into your safe deposit box, not 10 stacks.",
    "template": "blockquote"
  },
  {
    "text": "Study the magical power of nature through Shamanism and unlock the ability to perform rituals. Gather components, perform rituals, and infuse objects with the magic of the Spirit Realm. Create powerful items like Tikis, Totems and Poultices, and augment your own equipment with powerful new effects.",
    "author": "Official tagline from the initial proposal.",
    "template": "blockquote"
  },
  {
    "text": "Discover new and existing creatures around the world and tame them into friendly companions! Earn their trust and take care of them, and in return they'll aid you on your adventures.",
    "author": "Official tagline from the initial proposal.",
    "template": "blockquote"
  },
  {
    "text": "A tall leafy floral stem that bears several fragrant white flowers. These sweet-smelling beauties take pride of place in any garden. Although magnificent, white lilies have a dark side. While reasonably harmless to humans, if ingested by a cat, the results are often fatal. The white lily symbolises chastity and virtue and as such, it has become a potent symbol among Saradomin worshipers. Some even believe that Sardomin [sic] himself created the lily to improve the crops of his most cherished followers.",
    "quotesource": "Gielinor's flora - flowers",
    "template": "blockquote"
  },
  {
    "text": "Native to the forests of Isafdar, these berries are uniquely adaptable as they generally prefer to act as a parasite on trees. However, with correct nutrients, they can still be grown independently by experienced farmers. They are primarily used in the creation of defensive potions. However, they do also have cultural significance around Wintumber. This is because they are used as a decoration under which lovers are expected to kiss.",
    "quotesource": "Gielinor's flora - bushes",
    "template": "blockquote"
  },
  {
    "text": "Woad produces an eye-catching display of golden flowers and has blade shaped, bluish leaves. Interestingly, woad is from the same family as the cabbage. Since ancient times, woad has been an important source of blue dye. However, it requires a great amount of skill to produce this dye. According to an expert on dyes from Draynor, the process requires lengthy fermentation of the leaves. However, if persistent, the dye produced is a splendid colour.",
    "quotesource": "Gielinor's flora - flowers",
    "template": "blockquote"
  }
]