[
  {
    "list": [
      "Before the player has given the thick dye to Gregg or learned about the intent to paint Ned's door, the player can ask Ned one step too early for his permission to paint the door."
    ],
    "template": "bug"
  },
  {
    "list": [
      "After the player has given the thick dye to Gregg, Ned will thank the player for painting his door with extra colours and exclaims the door to be missing something, before the door is actually painted."
    ],
    "template": "bug"
  },
  {
    "list": [
      "Before the player has learned Gregg didn't do the decorations when he got back to Draynor and Ned did this, the player praises Ned for his excellent work on the decorations."
    ],
    "template": "bug"
  },
  {
    "list": [
      "If the player talks to the Cook immediately after painting Ned's door, the Cook will state that he gave rotten eggs to Gregg, but this is before Gregg ever made it to the kitchen."
    ],
    "template": "bug"
  },
  {
    "list": [
      "If the player takes Gregg's teleport from the lumberyard to Draynor, Thessalia will change her dialogue to tell the player Gregg is at Draynor, as intended. However, if the player skips taking Gregg's teleport and travels to Draynor manually, Thessalia will believe Gregg to be at the lumberyard, even if Gregg has left the lumberyard."
    ],
    "template": "bug"
  },
  {
    "list": [
      "In the cinematic action scene south of the Edgeville Monastery where the player and Iffie both desire to climb the trees to scare Oziach, if the player attempts to climb the evergreen trees on Iffie's side or too far down the path, Oziach cannot spot the player anymore. Leaving the instance or climbing the next correct tree resolves this."
    ],
    "template": "bug"
  },
  {
    "list": [
      "Once Iffie has returned to Thessalia's Fine Clothes. store, if Iffie attempted to give the player their rewards but the player didn't have enough free inventory space, and the player then chooses to say they're not ready for the rewards, Iffie's dialogue abruptly continues to her being busy knitting: \n* Iffie: Hello [player name]! Are you ready for your rewards now?\n** Yes!\n*** \n*** \n** Not yet.\n*** Player: Not yet.\n*** Iffie: Come back when you are, I have something for you!\n*** [sic]\n* Iffie: Sorry, dearie, if I stop to chat I'll lose count.\n*"
    ],
    "template": "bug"
  },
  {
    "list": [
      "There is a bug that may prevent Ultimate Ironmen death pile from appearing should they die in this instance. It is strongly recommended to bring extra supplies or a one-click teleport to prevent this. Bug can also happen to regular players, who may then reclaim items from death"
    ],
    "template": "bug"
  },
  {
    "list": [
      "Rada's blessing and spirit flakes are reported by Jagex Moderators not to provide an extra big bass. However, players have reported this to occur, likely due to a bug."
    ],
    "template": "bug"
  },
  {
    "list": [
      "Rada's blessing and spirit flakes are reported by Jagex Moderators not to provide an extra big shark. However, players have reported this to occur, likely due to a bug."
    ],
    "template": "bug"
  },
  {
    "list": [
      "Rada's blessing and spirit flakes are reported by Jagex Moderators not to provide an extra big swordfish. However, players have reported this to occur, likely due to a bug."
    ],
    "template": "bug"
  },
  {
    "list": [
      "If a player adds \"the stuff\" to a brewing vat, then proceeds to enter the waiting area for the Trouble Brewing minigame while the vat is fermenting, or to log in or out of the game while in the vicinity of the minigame area, the fermentation process will continue as if no \"stuff\" has been added, essentially reducing the chance of a mature vat back to 5%. Hence, it is highly advisable to avoid the immediate area surrounding the Trouble Brewing minigame – that is to say both the lobby and the minigame arena itself – while brewing a vat of ale containing \"the stuff\"."
    ],
    "template": "bug"
  },
  {
    "list": [
      "Captain Cleive's name is misspelt as Captain Clieve when upgrading slayer helmets and when attempting to attack lizardmen in the caves while not on a lizardman Slayer task."
    ],
    "template": "bug"
  },
  {
    "list": [
      "Rather than reverting to the base rate of 1/10, the drop rate of the thread of Elidinis is set to 1/50 after one has been received for the first time."
    ],
    "template": "bug"
  },
  {
    "list": [
      "If you teleport out of the dungeon before the conversation with Osman, you will simply need to talk to the High Priest to finish the quest. Upon travelling back to the dungeon through the maze, Osman will not be there. You will need to talk to Osman in Al Kharid to receive your Keris for free instead."
    ],
    "template": "bug"
  },
  {
    "list": [
      "There is currently a glitch right before the Sigmund fight that can cause the player to lose their pet if they have one out when trying to leave the area. Players are thus advised not to bring a pet during this quest."
    ],
    "template": "bug"
  },
  {
    "list": [
      "There is currently a glitch right before the Sigmund fight that can cause the player to lose their pet if they have one out when trying to leave the area. Players are thus advised not to bring a pet during this quest."
    ],
    "template": "bug"
  },
  {
    "list": [
      "An instance of accidental variable reuse can sometimes cause the player's Fremennik name to be replaced with an empty string, a character, or even a piece of dialogue from elsewhere in the game."
    ],
    "template": "bug"
  },
  {
    "list": [
      "Rada's blessing and spirit flakes are reported by Jagex Moderators not to provide an extra golden tench. However, players have reported this to occur, likely due to a bug."
    ],
    "template": "bug"
  },
  {
    "list": [
      "Notably, impling defenders' aggression decreases as server time increases, and only resets on an update. Their aggression is believed to tail off rather quickly, perhaps as soon as five minutes after the server has come back online. In practice, each imp defender seems to rescue only one captured impling per server restart before turning docile; the reduced aggression is likely to impact the cooldown period after a successful liberation."
    ],
    "template": "bug"
  },
  {
    "list": [
      "The repellent's usefulness is severely limited by a bug affecting the imp defender's aggression, which steeply decreases as server time increases. In practice, imp defenders seem to become docile after freeing one captured impling every game update, effectively eliminating the need for players to carry imp repellent."
    ],
    "template": "bug"
  },
  {
    "list": [
      "The threat posed by imp defenders is significantly curtailed by a bug affecting their aggression, which steeply decreases as server time increases. In practice, imp defenders seem to become docile after freeing one captured impling every game update, effectively eliminating the need for players to carry around imp repellent, or worry about their Thieving level."
    ],
    "template": "bug"
  },
  {
    "list": [
      "If a player teleports while on the \"depositing to your bank\" part of talking to Advisor Ghrim, after teleporting, the \"subject distribution\" interface will appear, and players are able to change distribution from their teleport point."
    ],
    "template": "bug"
  },
  {
    "list": [
      "Mobile players may not be able to click on or move the mirror during this part of the quest. Logging out and back in or unequipping the a weapon slot may temporarily solve it."
    ],
    "template": "bug"
  },
  {
    "list": [
      "If a player adds \"the stuff\" to a brewing vat, then proceeds to enter the waiting area for the Trouble Brewing minigame while the vat is fermenting, or to log in or out of the game while in the vicinity of the minigame area, the fermentation process will continue as if no \"stuff\" has been added, essentially resetting to the regular unadulterated brewing odds. Hence, it is highly advisable to avoid the immediate area surrounding the Trouble Brewing arena while using this money making method."
    ],
    "template": "bug"
  },
  {
    "list": [
      "If a player adds \"the stuff\" to a brewing vat, then proceeds to enter the waiting area for the Trouble Brewing minigame while the vat is fermenting, or to log in or out of the game while in the vicinity of the minigame area, the fermentation process will continue as if no \"stuff\" has been added, essentially resetting to the regular unadulterated brewing odds. Hence, it is highly advisable to avoid the immediate area surrounding the Trouble Brewing arena while using this money making method."
    ],
    "template": "bug"
  },
  {
    "list": [
      "If the player talks to Steve from this point on, until the quest is finished, he will have Nieve's chat head instead."
    ],
    "template": "bug"
  },
  {
    "list": [
      "If the growth-time reward would put the cat into the next stage of growth, the cat's growth may sometimes not advance, and instead show a negative time remaining."
    ],
    "template": "bug"
  },
  {
    "list": [
      "Freeing King Awowogei in the Recipe for Disaster sub-quest may sometimes glitch, resulting in Aris telling the player to ask King Awowogei about his favourite food before serving a stuffed snake to Awowogei in the dining hall, even if Awowogei at Marim tells the player they're not interested in talking and the three monkeys in the north-west corner of the temple acknowledge the stuffed snake in the player's inventory to be ready to serve. If the player serves the stuffed snake successfully and receives the sub-quest experience reward with a green quest completion in the Quest List, the Leagues unlocks interface may still indicate freeing Awowogei is incomplete and cost Sage's Renown. (This issue may have been patched on 26 January 2022.)"
    ],
    "template": "bug"
  },
  {
    "list": [
      "The League task Complete the Prifddinas Agility Course in 1:10 stops tracking time and may be completed without time limitations if the player logs out during the Prifddinas Agility Course."
    ],
    "template": "bug"
  },
  {
    "list": [
      "The in-game chatbox message incorrectly states that Tiadeche teaches you how to cook karambwan; this is not true. Tinsay is the one that teaches you how."
    ],
    "template": "bug"
  },
  {
    "list": [
      "Due to a bug, it is currently impossible to encounter the campsite event."
    ],
    "template": "bug"
  },
  {
    "list": [
      "As of 24 April 2023, this quest's quest log entry still refers to GPDT employees as R.P.D.T. men and the depot as R.P.D.T. incorrectly after the 11 October 2018 update."
    ],
    "template": "bug"
  },
  {
    "list": [
      "An opening quest dialogue with Kangai Mau has a grammatical error. It states \"Lord Handlemort is an Ardougnese explorer which means he think he have the right to come to my tribal home, steal our stuff and put in his private museum.\""
    ],
    "template": "bug"
  },
  {
    "list": [
      "When the chest or clam position resets, the arrow sometimes points to a wrong one for a brief moment."
    ],
    "template": "bug"
  }
]