[
  {
    "text": "Ablenkian's escape",
    "author": "Ablenkian",
    "quote": "At the battle of Carrallanger I rescued Corveth from the flames that threatened to consume her.",
    "template": "citetext"
  },
  {
    "text": "Ablenkian's escape",
    "author": "Ablenkian",
    "quote": "If only Hekala were here. If only I had been able to save her. [...] But she is gone. Murdered by Corveth and her treachery.",
    "template": "citetext"
  },
  {
    "text": "Ablenkian's escape",
    "author": "Ablenkian",
    "quote": "Ripper demons. [...] They will tear me apart when they find me.",
    "template": "citetext"
  },
  {
    "text": "Ablenkian's escape",
    "author": "Ablenkian",
    "quote": "So now I am alone. Now I flee into the deep forests of Forinthry.",
    "template": "citetext"
  },
  {
    "text": "Abyssal book",
    "quote": "Despite having finally gained access to the strange dimension known as the Abyss (also referred to as Abyssal Space or the Abyssal Plane), we have found the area to still be something of an enigma.",
    "template": "citetext"
  },
  {
    "text": "Abyssal book",
    "quote": "...the Abyss is somewhat of a tesseract or hypercube with a direct relation to our dimension.",
    "template": "citetext"
  },
  {
    "text": "Gooey note",
    "quote": "He referred to the Abyss as an empty void, calling the horrors around us invaders. According to him, even the ground we stand on is not of this realm, and that everything we see is a recent addition to what was once an empty nothingness.",
    "template": "citetext"
  },
  {
    "text": "Gooey note",
    "quote": "He claimed the confrontation with the beast had brought about a realisation. He knew why the Abyss had changed. Why it looked the way it did. There's a reason why this place feels alive, and that's because it is. We thought we were facing horrors of darkness in this place, but the truth is far worse: We're inside one!",
    "template": "citetext"
  },
  {
    "text": "Abyssal book",
    "quote": "The Abyss seems to be a strange dimension that sits between all other planes. In some ways, the Abyss acts as a 'glue' that holds all planes together, yet keeps them separate, if you will.",
    "template": "citetext"
  },
  {
    "text": "Abyssal book",
    "quote": "...the Abyss exists at the 'fringe' of reality, meaning that it does not conform to the same guidelines of space and time observed on Gielinor, or indeed on other planes.",
    "template": "citetext"
  },
  {
    "text": "Overseer's book",
    "quote": "Although time does not pass in the Abyss at the same rate that it passes elsewhere, I have been imprisoned for an unimaginably long time, since the days when the gods fought for dominion of the mortal realm.",
    "template": "citetext"
  },
  {
    "text": "Abyssal book",
    "quote": "...our gaining access to the Abyss was somewhat of a fluke, and a not easily repeatable fluke at that. Due to the Abyss not being a plane in the traditional sense, we have also had to resort to unusual measures to gain permanent access.",
    "template": "citetext"
  },
  {
    "text": "Abyssal book",
    "quote": "...it was only recently that we finally discovered a way to enter this strange realm. The discovery came by complete chance, when a routine teleportation experiment seemingly went wrong.",
    "template": "citetext"
  },
  {
    "text": "Abyssal book",
    "quote": "We then had them [initiates] repeatedly teleport to various locations, seeking to replicate the original error that caused the first entry into the Abyss. Once one of our initiates had managed to 'fail' his teleport and appear in the Abyss he was then charged with remaining there and holding a portal spell open so that more senior members of the Z.M.I. could gain entry.",
    "template": "citetext"
  },
  {
    "text": "The great divide",
    "quote": "(...) in the year 1930, we lost all contact with our people back in Tirannwn. We found that the route over the mountains was impassable and our incantations were unable to penetrate the gates that had been built there. (...) Soon it was decided to send five members of the Cadarn clan through the Well of Voyage, to recover any information that could tell us what was happening.",
    "template": "citetext"
  },
  {
    "text": "The great divide",
    "quote": "After a few weeks, Adwr returned, the only one of the five scouts that made it back. A council was called to listen to his news. He told us of the chaos he had seen; elves killing elves in the streets of Prifddinas and the seizing of the Tower of Voices by clan Iorwerth.",
    "template": "citetext"
  },
  {
    "text": "Gollwyn's final statement",
    "quote": "I still remember Adwr's wild eyes, holding back tears as he told us of the horrors he'd witnessed on his mission to Prifddinas. He'd narrowly escaped with his life, something which could not be said about his companions. He sobbed as he recounted the betrayal, the killings, the sacking of the city, the takeover of the Tower of Voices... All of which was on Lord Iorwerth's command.",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "quote": "Xeric is currently sweeping through our great kingdom, decimating all authority within.",
    "template": "citetext"
  },
  {
    "text": "Timeline",
    "quote": "Xeric: 37th - 47th.",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "quote": "Lord Hosidius and Lord Lovakengj are missing and presumed lost in battle to Xeric.",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "quote": "You must evacuate Great Kourend. Xeric's forces will continue to advance; you must abandon your homes and head for Port Piscarilius in the hopes of finding transport elsewhere.",
    "name": "ref1",
    "template": "citetext"
  },
  {
    "text": "Imafore's betrayal",
    "quote": "The Kingdom of Varlamore was formed in a very similar way to Kourend, by those fleeing the Age of Strife.",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "quote": "Summary: A cabin boy records how he saw a lizard-human-like creature while sailing near Mount Quidamortem: I don't believe what I've just seen. I can't believe it. They looked like lizards... but they were acting like humans!",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "quote": "Source: Sailor's Journal. Author: Cabin Boy Horacio. Date: 2,949 - 38.",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "quote": "Sergeant Yan Mattin is found guilty by plea of gross insubordination. Sgt Mattin refused to follow orders pertaining to the acquisition and delivery of civilians to the chambers of His Lordship, Xeric, on the day of 3,470 - 37.",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "quote": "It happened three days ago during the most recent gathering by the lizard creatures... we were ploughing the fields as we heard them approaching. I was able to get back inside and hide but Morta\n was too far away... they snatched her before I could do anything.",
    "template": "citetext"
  },
  {
    "text": "Nistirio's manifesto",
    "quote": "Our lord Xeric has made full use of my gifts; I dare say that my power was instrumental in his ascent to greatness, and he rightly rewarded me by appointing me as his High Priest.",
    "template": "citetext"
  },
  {
    "text": "Killing of a king",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "template": "citetext"
  },
  {
    "text": "Vanguard Judgement",
    "quote": "The most prominent commanders of Lord Xeric's army were known as the Vanguard, three elite officers who rose quickly through the ranks.",
    "notes": "Though not explicitly stated, the three vanguards can nonetheless be presumed to be human: on the one hand due to their betrayal during Byrne's Revolt, which the lizardmen are not thought capable of, and secondly due to their known skill with regards to the interrogation of presumed internal enemies, which likewise can be assumed to require a higher faculty of speech than lizardmen tend to be capable of.",
    "template": "citetext"
  },
  {
    "text": "Vanguard Judgement",
    "quote": "Whenever traitors muttered against our Lord, his troops would ravage their homes in the dead of night, arresting anyone suspected of disloyalty or rebellion. Under questioning by the commanders, who were empowered to use any interrogation techniques they deemed necessary in Lord Xeric's service, the traitors would inevitably reveal more suspects for the troops to arrest.",
    "template": "citetext"
  },
  {
    "text": "Ricktor's diary (7)",
    "quote": "I continue to grasp the basics of the language I am seeing but the message still alludes me. One word keeps appearing in all of the text I read, sacrifice.",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "quote": "Source: Court Marshall [sic] Report. Author: Office of Armed Forces. Date: 1,479 – 38. Summary: An official court marshall [sic] report detailing how a soldier refused orders to gather civilians and deliver them to Xeric.",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "quote": "Sgt Mattin refused to follow orders pertaining to the acquisition and delivery of civilians to the chambers of His Lordship, Xeric, on the day of 3,470 – 37.",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "quote": "Sgt Mattin pleads guilty to the charge of Gross Insubordination for which the sentence is execution by twisted archer.",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "quote": "Source: HAX Group Letter. Author: Unknown. Date: 2,007 – 43. Summary: A Letter to the members of a resistance group at the height of Xeric's reign.",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "quote": "Our recent attempt to storm the Tower of Magic and defeat Xeric resulted in the loss of all two hundred members involved.",
    "template": "citetext"
  },
  {
    "text": "Het's capture",
    "quote": "Like many of his fellow cultists, Akkha's life prior to the cult was as a soldier dedicated to Het.",
    "template": "citetext"
  },
  {
    "text": "Het's capture",
    "quote": "The Children of Rebirth was a cult of former warriors dedicated to the Devourer's original form, Amascut - the goddess of rebirth.",
    "template": "citetext"
  },
  {
    "text": "Het's capture",
    "quote": "They were firm in their belief that they must achieve a perfect death, so that Amascut would allow them to be reborn in perfected form.",
    "template": "citetext"
  },
  {
    "text": "Het's capture",
    "quote": "When the day of their supposed rebirth came, they performed a ritual to Amascut and poisoned themselves in her name.",
    "template": "citetext"
  },
  {
    "text": "Het's capture",
    "quote": "With Amascut long gone, the ritual instead called out to the Devourer and she arrived to find Akkha as the sole survivor among the many dead. His poison had failed, but he was on the verge of death. The Devourer took Akkha and sealed him in a sarcophagus, trapping him between life and death.",
    "template": "citetext"
  },
  {
    "text": "Het's capture",
    "quote": "She then performed a ritual of her own, calling out to Het. While Het almost certainly realised it was a trap, he was unable to ignore the call. Like many of his fellow cultists, Akkha's life prior to the cult was as a soldier dedicated to Het, and so the god felt he had a duty to help his former acolyte.",
    "template": "citetext"
  },
  {
    "text": "Het's capture",
    "quote": "Het arrived expecting to face the Devourer, but was faced with a manifestation of Akkha himself. Fueled by vengeance against the god who had abandoned him, this manifestation gave the Devourer the distraction she needed to capture Het.",
    "template": "citetext"
  },
  {
    "text": "The wardens",
    "quote": "In war, great weapons can turn the tide against even the strongest foes, and legend has long spoken of Tumeken using a powerful staff to build two such weapons.",
    "template": "citetext"
  },
  {
    "text": "The wardens",
    "quote": "In truth, referring to Tumeken's creations as 'weapons' does them no justice. They are in fact two ancient automatons, built to embody Tumeken and Elidinis themselves and seemingly imbued with their divine essence.",
    "template": "citetext"
  },
  {
    "text": "Scabaras' capture",
    "quote": "Fearing for the end of her race, Kephri longed for children to pass on her knowledge. The Devourer learnt of her desires and a pact was soon made. In return for her help, the Devourer would revive her race, making Kephri children even smarter than herself.",
    "template": "citetext"
  },
  {
    "text": "Scabaras' capture",
    "quote": "By warping another race of scarabs, the Devourer granted Kephri her children as promised, but they had no more intelligence than a common locust. However, the Devourer had promised children even smarter than Kephri herself, and that was a vow she intended to keep. She bound Kephri and destroyed her mind, leaving nothing more than a husk. As Kephri's consciousness faded away, she called for Scabaras, who answered her call and was quickly captured.",
    "template": "citetext"
  },
  {
    "text": "Apmeken's capture",
    "quote": "In life, Ba-Ba's troop dominated a large area of the Kharidian Desert, thriving under her watchful eye. Yet nothing lasts forever, and age was quickly catching up to Ba-Ba.",
    "template": "citetext"
  },
  {
    "text": "Apmeken's capture",
    "quote": "Although a natural part of life, Ba-Ba could not accept her mortality. This fear was not born out of selfishness - her concern was for her troop. Upon her death, Ba-Ba's daughter would have become matriarch, but she was lazy and arrogant. Ba-Ba did not consider her a worthy successor and longed to continue ruling herself.",
    "template": "citetext"
  },
  {
    "text": "Apmeken's capture",
    "quote": "Learning of Ba-Ba's desires, the Devourer promised her a way to rule her troop forever. Believing there to be no other option, Ba-Ba agreed. Ever the deceiver, the Devourer's true plan soon became clear. With a single spell, she killed Ba-Ba and her entire troop, only to reanimate them all together. With her new army, the Devourer had no difficulties in capturing Apmeken.",
    "template": "citetext"
  },
  {
    "text": "Het's capture",
    "quote": "It is said that long ago, the Devourer was cursed never to gain followers. If this curse ever existed is hard to say, but if it did, its effectiveness seems to have diminished over the years. While few in number, there are those who truly pledge themselves to the Devourer and all her destructive ways.",
    "template": "citetext"
  },
  {
    "text": "Het's capture",
    "quote": "The Children of Rebirth was a cult of former warriors dedicated to the Devourer's original form, Amascut - the goddess of rebirth. They were firm in their belief that they must achieve a perfect death, so that Amascut would allow them to be reborn in perfected form. When the day of their supposed rebirth came, they performed a ritual to Amascut and poisoned themselves in her name.",
    "template": "citetext"
  },
  {
    "text": "Het's capture",
    "quote": "With Amascut long gone, the ritual instead called out to the Devourer and she arrived to find Akkha as the sole survivor among the many dead. His poison had failed, but he was on the verge of death. The Devourer took Akkha and sealed him in a sarcophagus, trapping him between life and death. She then performed a ritual of her own, calling out to Het. While Het almost certainly realised it was a trap, he was unable to ignore the call. Like many of his fellow cultists, Akkha's life prior to the cult was as a soldier dedicated to Het, and so the god felt he had a duty to help his former acolyte.",
    "template": "citetext"
  },
  {
    "text": "Het's capture",
    "quote": "Het arrived expecting to face the Devourer, but was faced with a manifestation of Akkha himself. Fueled by vengeance against the god who had abandoned him, this manifestation gave the Devourer the distraction she needed to capture Het.",
    "template": "citetext"
  },
  {
    "text": "Crondis' capture",
    "quote": "Unable to compete with his rivals in the traditional way, Zebak instead used his ingenuity to lure them into elaborate traps. To begin with, he simply took their food and left them to starve, but over time, his hunger grew. Before long, he started to feast on his victims too. In the end, the once weak crocodile had grown to become the strongest. You'd be forgiven for thinking he might have stopped there, but Zebak's hunger knew no end. As he continued to feast, his food supply ran short.",
    "template": "citetext"
  },
  {
    "text": "Crondis' capture",
    "quote": "In return for his service, the Devourer promised Zebak that he would never go hungry again. Blinded by avarice, he willingly agreed. Together, Zebak and the Devourer lured Crondis to her imprisonment. However, rather than granting the endless supply of food he craved, the Devourer cursed him.",
    "template": "citetext"
  },
  {
    "text": "Crondis' capture",
    "quote": "To a being like Zebak, the curse was a fate worse than death, for it caused every bite of food to turn to dust in his mouth. He longed for death, but the Devourer's curse prevented this as well, binding him to the world of the living.",
    "template": "citetext"
  },
  {
    "text": "Akila's journal",
    "quote": "After we gave her a way in, the true horror of her plans became clear. I had never set eyes on the four lesser deities, but I knew them when I saw them. She had them all. She took them into the tomb, along with a selection of ghastly beasts.",
    "template": "citetext"
  },
  {
    "text": "Book of folklore",
    "quote": "In some arcane way their lifeforce was linked to the life of the world itself; it is written that, as long as the Elder-dragons continue to live, the world shall not end.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Louisiana Jones.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Ingald Belger.",
    "template": "citetext"
  },
  {
    "text": "Soul journey",
    "author": "Aretha",
    "quote": "The soul does not always succeed in freeing itself from its flesh-temple at the time of death. Many warriors have found, to their horror, that the soul of their foe remains trapped in the corpse.",
    "template": "citetext"
  },
  {
    "text": "Soul journey",
    "author": "Aretha",
    "quote": "Ensouled heads are a sign of a soul in torment; it is therefore our duty to free such souls from their prison with all due speed. The magic of the Dark Altar enables the ensouled head to re-form itself a rudimentary body; this may be slain in order to grant liberty to the soul at last.",
    "template": "citetext"
  },
  {
    "text": "Transportation incantations",
    "author": "Amon Ducot",
    "quote": "Unfortunately our supplies of law runes are extremely limited at this time, making the spell of little use. Indeed, the study of teleportation magicks has always been very limited throughout Kourend's history for this reason, aside from whatever sorcery was practiced by Xeric.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Aris Maye.",
    "template": "citetext"
  },
  {
    "text": "Moonclan manual",
    "quote": "And so was created the Astral Temple (...) By regular concentrated effort of will upon a large dolmen of essence, by a number of people simultaneously, the dolmen was finally convinced that it had become something which it was not.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Asyff Bymajique.",
    "template": "citetext"
  },
  {
    "text": "Atlax's diary",
    "quote": "According to Pharana, the Justiciar of the Lion wants no time wasted. We start work tomorrow.",
    "template": "citetext"
  },
  {
    "text": "Atlax's diary",
    "quote": "Today I found a hidden cache of amulets with eye symbols on them. I reported it to Pharana and she thanked me for the good work, smiling as she did. (...) Interestingly, as she walked away, I heard her mutter something like 'Could it be true? Perhaps the justiciar has some explaining to do.'",
    "template": "citetext"
  },
  {
    "text": "Atlax's diary",
    "quote": "I don't know what she meant, but I wonder if there's more to our work here than we realised.",
    "template": "citetext"
  },
  {
    "text": "Atlax's diary",
    "quote": "I also managed to find time today to imbue this diary with a spell to keep it dry. I just wish the spell would work on my boots as well.",
    "template": "citetext"
  },
  {
    "text": "Atlax's diary",
    "quote": "I went to report my discovery, but as soon as I turned around, I had this funny feeling like I was being followed. The statue had come to life! (...) I've named the creature 'Egg' due to the uncanny shape of its head. I didn't expect a reply when I asked what it was doing here, but to my great surprise, Egg spoke. 'We guard the rift,' it said.",
    "template": "citetext"
  },
  {
    "text": "Atlax's diary",
    "quote": "I followed up with a multitude of questions and quickly discovered Egg to not be the oversharing type. That said, if the questions are specific enough, it usually gives some form of answer.",
    "template": "citetext"
  },
  {
    "text": "Atlax's diary",
    "quote": "Within the centre of its body is some sort of swirling, green core.",
    "template": "citetext"
  },
  {
    "text": "Atlax's diary",
    "quote": "'Many bodies were destroyed in the battle. This body was trapped, our energy bound to the stone.'",
    "template": "citetext"
  },
  {
    "text": "Atlax's diary",
    "quote": "I suspect she won't thank me with a smile this time. I've kept Egg secret for too long. This may be my last entry for a while.",
    "template": "citetext"
  },
  {
    "text": "Astronomy book",
    "quote": "At the start of the 4th age, a learned man by the name of Scorpius, known well for his powers of vision and magic, sought communion with the gods of the world.",
    "template": "citetext"
  },
  {
    "text": "Transcript:A Brief History of RuneScape",
    "quote": "Although actual details are scarce, I believe the passage from the third age to the fourth age is marked by whatever event caused the Gods to no longer conduct their wars and battles upon our soil directly. (...) Also the concept of the calendar began to appear, as farming practices improved and the time of crop planting and harvesting became more important now that these settlements could no longer simply move on to a new location when their resources were exhausted.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Layte Aubury.",
    "template": "citetext"
  },
  {
    "text": "Bloody diary",
    "quote": "In my travels throughout the Shining Kingdom, I have bested many mighty creatures. From the Colossal Wyrm of the Avium Savannah to the Cloud Titan of Tempestus, I am proud to proclaim myself as a master slayer.",
    "template": "citetext"
  },
  {
    "text": "Apmeken's capture",
    "quote": "In life, Ba-Ba's troop dominated a large area of the Kharidian Desert, thriving under her watchful eye.",
    "template": "citetext"
  },
  {
    "text": "Apmeken's capture",
    "quote": "Althought a natural part of life, Ba-Ba could not accept her mortality. This fear was not born out of selfishness - her concern was for her troop.",
    "template": "citetext"
  },
  {
    "text": "Apmeken's capture",
    "quote": "Upon her death, Ba-Ba's daughter would have become matriarch, but she was lazy and arrogant. Ba-Ba did not consider her a worthy successor and longed to continue ruling herself.",
    "template": "citetext"
  },
  {
    "text": "Apmeken's capture",
    "quote": "Learning of Ba-Ba's desires, the Devourer promised her a way to rule her troop forever. Believing there to be no other option, Ba-Ba agreed.",
    "template": "citetext"
  },
  {
    "text": "Apmeken's capture",
    "quote": "Ever the deceiver, the Devourer's true plan soon became clear. With a single spell, she killed Ba-Ba and her entire troop, only to reanimate them all together.",
    "template": "citetext"
  },
  {
    "text": "Apmeken's capture",
    "quote": "With her new army, the Devourer had no difficulties in capturing Apmeken. Now, Ba-Ba rules eternally over her undead horde, ensuring Apmeken remains a prisoner to the Devourer.",
    "template": "citetext"
  },
  {
    "text": "Apmeken's capture",
    "quote": "By the time I first saw the chamber dedicated to Apmeken, it had already been taken over by its new inhabitants. They'd quickly customised the place to their liking and were ready to defend it from any invaders.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Baraek Brigson.",
    "template": "citetext"
  },
  {
    "text": "Old tablet",
    "quote": "By order of the Praefectus Classis, all vessels are to be prepared for battle. With artefact 'Imperium' safely delivered to the east, focus must return to artefact 'Primus'. New intelligence has confirmed its location and it is expected attempts to recover it will be met with heavy resistance from Saradominist forces.",
    "template": "citetext"
  },
  {
    "text": "Slimy tablet",
    "quote": "She [Perseriya] has acquired the means to teleport large numbers of individuals directly into the temple. While the fleet controls the waters above, your soldiers will be tasked with clearing the temple of all resistance.",
    "template": "citetext"
  },
  {
    "text": "Slimy tablet",
    "quote": "Our force has been kept light intentionally to ensure we can surprise the Saradominist forces. However, using the same teleportation method she'll use to give us access to the temple, the Praefectus Classis also has the ability to call in any reinforcements we need.",
    "template": "citetext"
  },
  {
    "text": "Slimy tablet",
    "quote": "The battle is lost and we must withdraw. The attempt to call in reinforcements failed, and the temple has been ripped asunder by a rift of unknown power. The rift is growing rapidly and has already claimed much of the fleet. The Praefectus Classis is lost. Retreat is the only option.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Display case 7"
    ],
    "name": "case",
    "quote": "Using the power of runes, Saradominist humans in Kandarin, led by the Carnillean family, became confident and decided to take on the evil influences resident in the area around what is now known as Ardougne.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Display case 7"
    ],
    "quote": "From there, they expanded their territory until Kandarin was the largest of the human kingdoms.",
    "template": "citetext"
  },
  {
    "text": "Malumac's journal",
    "quote": "It would appear that our cunning at the Battle of Carrallanger has not gone unnoticed. Impressed by our work, Zamorak himself has personally given us our next mission.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#2nd_floor3rd_floor_display_cases",
    "list": [
      "Display case 26"
    ],
    "name": "case",
    "quote": "Year 163, 5th Age - The White Knights declared that the Black knights were no longer to have any political power within Asgarnia. Lord Daquarius of the Kinshra immediately responds by declaring his Black Knights as being at a state of war with Falador. The two sides engaged in a big battle to the north of Falador.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#2nd_floor3rd_floor_display_cases",
    "list": [
      "Display case 26"
    ],
    "quote": "The old king of Asgarnia, King Vallance, falls very ill. The White Knights took advantage of this and began to take control of Falador and Asgarnia for themselves.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#2nd_floor3rd_floor_display_cases",
    "list": [
      "Display case 26"
    ],
    "quote": "however, both sides were fairly evenly matched, and retreated to their fortresses to build up their forces and devise plans to crush the other, once and for all.",
    "template": "citetext"
  },
  {
    "text": "Goblin book",
    "page": "8",
    "quote": "Then all gods leave world, leave their armies behind. ... But now goblins not have enough to eat, and have no commanders to tell them who to fight.",
    "template": "citetext"
  },
  {
    "text": "Goblin book",
    "page": "8",
    "quote": "But tall people build cities with walls, they not want to fight.",
    "template": "citetext"
  },
  {
    "text": "Goblin book",
    "page": "8-9",
    "quote": "But now goblins not have enough to eat, and have no commanders to tell them who to fight. So goblin tribes fight one another. At last all goblin tribes have big battle on plain of mud.",
    "template": "citetext"
  },
  {
    "text": "Goblin book",
    "page": "9",
    "quote": "Battle last many days and many goblins die, battle is glorious! But goblin corpses cover the ground and it look like all die.",
    "template": "citetext"
  },
  {
    "text": "Goblin book",
    "page": "9-10",
    "quote": "Then Hopespear of the Narogoshunn tribe have vision of Big High War God.",
    "template": "citetext"
  },
  {
    "text": "Goblin book",
    "page": "10",
    "quote": "This is the word of Big High War God: Battle is indeed glorious and goblins are soldiers but if there too much battle all goblins die! No more must goblin fight against goblin or tribe against tribe",
    "template": "citetext"
  },
  {
    "text": "Goblin book",
    "page": "10-11",
    "quote": "Goblins must find other enemies to fight, but not fight each other!",
    "template": "citetext"
  },
  {
    "text": "Goblin book",
    "page": "11",
    "quote": "but someday I will send a new Commander to lead you. Under new Commander goblins will conquer all of Gielinor, every race and every god!",
    "template": "citetext"
  },
  {
    "text": "Goblin book",
    "page": "12",
    "quote": "So leaders of tribes stop battle.",
    "template": "citetext"
  },
  {
    "text": "Goblin book",
    "page": "12",
    "quote": "And on plain of mud all tribes build temple to Big High War God and offer sacrifices.",
    "template": "citetext"
  },
  {
    "text": "Varmen's notes",
    "author": "Varmen",
    "loc": "The Golem",
    "quote": "It was allied with Saradomin and enjoyed his protection, as well as that of its own mages and warriors.",
    "template": "citetext"
  },
  {
    "text": "Varmen's notes",
    "author": "Varmen",
    "loc": "The Golem",
    "quote": "[...] its existence tells us that the city's inhabitants were expert magical craftsmen. The huge kilns in some of the buildings indicate that at some point before its destruction the whole city was converted to the manufacture of these golems.",
    "template": "citetext"
  },
  {
    "text": "Varmen's notes",
    "author": "Varmen",
    "loc": "The Golem",
    "quote": "I surmise that the army of golems was created in order to fight the demon, since Uzer's army had been wiped out and Saradomin's forces were increasingly stretched.",
    "template": "citetext"
  },
  {
    "text": "Varmen's notes",
    "author": "Varmen",
    "loc": "The Golem",
    "quote": "I can say with confidence that these are the ruins of Uzer, an advanced human civilization said to have been destroyed towards the end of the Third Age (roughly 2,500 years ago).",
    "template": "citetext"
  },
  {
    "text": "Varmen's notes",
    "author": "Varmen",
    "loc": "The Golem",
    "quote": "We have also examined the carvings on the large building in the centre. There are symbols depicting several of the ancient gods, including Saradomin, Zamorak, and Armadyl [...]",
    "template": "citetext"
  },
  {
    "text": "Varmen's notes",
    "author": "Varmen",
    "loc": "The Golem",
    "quote": "The art of the construction of golems has been lost since the Third Age, and, although they are sometimes discovered lying dormant in the ground, no concerted effort has been made to regain it, thanks largely to the modern Saradominist Church's view of them as unnatural.",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "quote": "Source: Lovakengj Miner's Diary; Author: Unknown; Date: 3,316 - 37.",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "quote": "Five decades of torment and struggle under his rule had come to an end, I started to remember life before, as a child, where we could freely walk the kingdom without fear of being summoned to the King for his leisure experiments.",
    "template": "citetext"
  },
  {
    "text": "Armed Forces Report",
    "template": "citetext"
  },
  {
    "text": "Armed Forces Report",
    "quote": "At the request of His Royal Highness King Hosidius V, I, Lord Rickard Shayzien, have conducted a complete review of the Shayzien forces.",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "quote": "And then, as swiftly as it began, it was over.",
    "template": "citetext"
  },
  {
    "text": "Killing of a king",
    "quote": "But yet he charged / With his fighters / Through they barged / Not leave survivors.",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "quote": "Some say it was King Shayzien reborn, some say it was his evil spirit returned to revenge his death. We'd even heard that, whoever it was, they weren't human!",
    "template": "citetext"
  },
  {
    "text": "Ricktor's diary (7)",
    "quote": "I retired to Madam Turner's on the great concourse for mutton pie and drank to the health of the new King.",
    "template": "citetext"
  },
  {
    "text": "Rada's census",
    "quote": "Lord Rasmus Arceuus (...) 1 municipal hall (...) 13 wood turners",
    "note": "The census established during Rada III's reign may lend some credence to the 'great concourse' being located in Arceuus: Prior to the Ascent of Arceuus, the city housed mainly scribes and artisans, among which a number of wood turners, from which the surname 'Turner' may well be derived, and by extension the establishment known as or operated by 'Madam Turner'. Additionally, in contrast to the other cities of Great Kourend, the census lists Arceuus as possessing both a temple and a municipal hall, either of which public buildings apt to have a concourse attached to it.",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "quote": "We lived on the southern peninsula, quite a walk from the mine, but we enjoyed the peace that comes with being so close to Shayziens' Wall. I had just arrived home when it began... the howling of arrows through the air, deafening roars of soldiers as they were slain... just outside the gates a fierce battle was waging, seemingly out of nowhere.",
    "template": "citetext"
  },
  {
    "text": "Killing of a king",
    "quote": "But yet he charged / With his fighters / Through they barged / Not leave survivors.",
    "notes": "It is interesting to note that the poem often evokes an aspect of 'togetherness' or 'concourse' as a sort of leitmotif: the regicide was carried out \"In all men's hope / To end his life\"; it was but brief \"That all the men / Felt such relief\"; \"The army did mark / That men did cluster\"; \"Together to make / The feelings safe\". This leitmotif could be seen to support the 'concourse as crowd'-interpretation.",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "quote": "And then, as swiftly as it began, it was over. The intense clashes of shields fell silent, just for a moment, before we heard powerful cheers.",
    "template": "citetext"
  },
  {
    "text": "Gollwyn's final statement",
    "author": "Gollwyn",
    "quote": "I do not know how Lord Iorwerth knew of our plans, but his forces were waiting for us. (...) They destroyed almost half of our forces before we called a retreat.",
    "template": "citetext"
  },
  {
    "text": "The great divide",
    "quote": "For almost two millennia, we lived in the eastern realm, then in the year 1930, we lost all contact with our people back in Tirannwn. We found that the route over the mountains was impassable and our incantations were unable to penetrate the gates that had been built there.",
    "template": "citetext"
  },
  {
    "text": "The great divide",
    "quote": "King Baxtorian called an emergency council (...) Soon it was decided to send five members of the Cadarn clan through the Well of Voyage, to recover any information that could tell us what was happening.",
    "template": "citetext"
  },
  {
    "text": "The great divide",
    "quote": "After a few weeks, Adwr returned, the only one of the five scouts that made it back. A council was called to listen to his news. He told us of the chaos he had seen; elves killing elves in the streets of Prifddinas and the seizing of the Tower of Voices by clan Iorwerth.",
    "template": "citetext"
  },
  {
    "text": "Gollwyn's final statement",
    "author": "Gollwyn",
    "quote": "I still remember Adwr's wild eyes, holding back tears as he told us of the horrors he'd witnessed on his mission to Prifddinas. (...) He sobbed as he recounted the betrayal, the killings, the sacking of the city, the takeover of the Tower of Voices... All of which was on Lord Iorwerth's command.",
    "template": "citetext"
  },
  {
    "text": "The great divide",
    "quote": "Hearing [Adwr's news] sparked a debate that continued for days. Many plans were put forward of how we should deal with the problems back home. Ideas ranged from the assassination of Lord Iorwerth to just leaving the western elves to kill each other.",
    "template": "citetext"
  },
  {
    "text": "Gollwyn's final statement",
    "author": "Gollwyn",
    "quote": "While some were content to leave the city to its fate, afraid of what was to come, most of us knew better. Baxtorian reminded us all of Seren's promise to us, and her command to keep the eight clans together. This was enough for the majority to reach a fragile, but unanimous agreement.",
    "template": "citetext"
  },
  {
    "text": "Gollwyn's final statement",
    "author": "Gollwyn",
    "quote": "Within a few days, we gathered whatever forces we had under my banner and made our way to the ancient Underground Pass. (...) The plan was Baxtorian's idea. We thought if we mustered our forces and marched through the pass hastily enough, we would be able to catch Lord Iorwerth unprepared while his forces were divided and end this madness before it ended us.",
    "template": "citetext"
  },
  {
    "text": "Gollwyn's final statement",
    "author": "Gollwyn",
    "quote": "We marched on the gates of Prifddinas on the morning of the eighth day, where everything fell apart. I do not know how Lord Iorwerth knew of our plans, but his forces were waiting for us. Baxtorian tried to reason with him, but he would not listen. They destroyed almost half of our forces before we called a retreat.",
    "template": "citetext"
  },
  {
    "text": "Gollwyn's final statement",
    "author": "Gollwyn",
    "quote": "A further quarter of us were slain by traps within the forest as we fled, left behind in our haste.",
    "template": "citetext"
  },
  {
    "text": "Gollwyn's final statement",
    "author": "Gollwyn",
    "quote": "We reached the Well of Voyage by nightfall, and that was where all hope was truly lost. I was one of the first who made it through, back to the underground from where we had come. A few of us had already begun to scout ahead when [Lord Iorwerth's forces] came again.",
    "template": "citetext"
  },
  {
    "text": "Book on baxtorian",
    "quote": "After years of searching for his love, he finally gave up and returned to the home he had made for Glarial under the Baxtorian Falls. Once he entered, he never returned.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Benny Gutenberg.",
    "template": "citetext"
  },
  {
    "text": "Ablenkian's escape",
    "author": "Ablenkian",
    "loc": "4",
    "quote": "I did not betray our lord like Apropos did",
    "template": "citetext"
  },
  {
    "text": "Weiss fire notes",
    "author": "Odd Mushroom",
    "quote": "With the correct combination of salts, the basalt can be made to transport matter - rocks, logs, even living creatures like goats - from place to place.",
    "template": "citetext"
  },
  {
    "text": "Transvergence theory",
    "quote": "I believe the power of the Dark Altar allows the energy needed to change essence into runes to seep through to this dimension.",
    "template": "citetext"
  },
  {
    "text": "Transdimensional notes",
    "quote": "It is known, of course, that the Dark Altar can connect to other planes of existence. That is how it sustains our runic altars, by linking Kourend to whatever far-off realms contain the true Blood and Soul Altars.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#2nd floor3rd floor display cases",
    "list": [
      "Varrock Museum Timeline exhibit, display number 9"
    ],
    "quote": "5th Age - yr 132. King Arthur and the Knights of the Round Table arrive on Gielinor in year 132 of the 5th Age. (...)",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Display case 24"
    ],
    "quote": "4th Age - Years 700–800",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#2nd_floor3rd_floor_display_cases",
    "list": [
      "Display case 26"
    ],
    "quote": "The old king of Asgarnia, King Vallance, falls very ill. The White Knights took advantage of this and began to take control of Falador and Asgarnia for themselves.",
    "template": "citetext"
  },
  {
    "text": "Byrne's coronation speech",
    "quote": "Our freedom is not without cost. Many died and much has been destroyed.",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "quote": "However, for all that we have gained today, we have suffered many losses in our yesterday.",
    "template": "citetext"
  },
  {
    "text": "Vanguard judgement",
    "quote": "Had the Vanguard performed their duty, perhaps disaster would have been averted, and Lord Xeric would have remained on the throne of Kourend. However, even the legendary Vanguard were frail. As their troops were slaughtered around them by the rage of the proletariat, the Vanguard fled the kingdom to protect their own skins.",
    "name": "ref-a-lef-a-ding-dong",
    "template": "citetext"
  },
  {
    "text": "Vanguard judgement",
    "quote": "The most prominent commanders of Lord Xeric's army were known as the Vanguard, three elite officers who rose quickly through the ranks. Their cunning on the battlefield, their ruthlessness in the interrogation chambers and their loyalty to our Lord were exemplary.",
    "template": "citetext"
  },
  {
    "text": "Vanguard judgement",
    "quote": "Then came the fall. A proletarian uprising caught the army by surprise.",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "quote": "For ten decades we have been oppressed; and in just seven, short days we have driven Xeric and his lizardmen beyond our kingdom.",
    "template": "citetext"
  },
  {
    "text": "Transdimensional notes",
    "quote": "We have faced many dangers since our departure from Kourend, and every single one has been overcome. The privations of the journey to Quidamortem, the ferocious beasts that dwelt here, even the weakness and treachery of our former allies - we have survived them all, and marched on triumphantly.",
    "template": "citetext"
  },
  {
    "text": "Dark journal",
    "quote": "Our lord's followers have dwindled in number, it is true. Few of us who shared his exile from Kourend are still alive to serve him today.",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "quote": "Date: 322 – 47. Summary: A snippet of King Byrne's coronation speech, one week after he sparked a successful revolution against Xeric.",
    "template": "citetext"
  },
  {
    "text": "Byrne's coronation speech",
    "quote": "Many died and much has been destroyed. Yet more needs to be destroyed before we can heal the wounds of this past century. All icons and imagery that betray our freedom must be cast down.",
    "template": "citetext"
  },
  {
    "text": "Tekton's journal",
    "quote": "Tekton built huge buildings, clever buildings with magic in the walls. Tekton made buildings for people to praise Master in, big buildings with pretty decorations so everyone knows how great Master is.",
    "template": "citetext"
  },
  {
    "text": "The truth behind the myth (excerpt)",
    "quote": "It is curious how, despite all her other impressive accomplishments, it is the slaying of [Garak] that is considered to be Camorra's defining heroic feat.",
    "template": "citetext"
  },
  {
    "text": "Tomb (Dragon Slayer II)",
    "quote": "Here lies Camorra Shayzien // Founder of Shayzien House.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Milo Rovin.",
    "template": "citetext"
  },
  {
    "text": "Mount Karuulm diary",
    "author": "Karuulm",
    "quote": "The arrival seems to be a demon of Zamorak, one in possession of an artefact I have never encountered. While the demon arrived alone, he has used this artefact to call upon a variety of creatures to his side.",
    "template": "citetext"
  },
  {
    "text": "Kharedst's memoirs",
    "author": "Rose",
    "quote": "I know of the powerful magic that keeps them bound below.",
    "template": "citetext"
  },
  {
    "text": "Crystal singing for beginners",
    "quote": "Reading the 'Cerddi' tells us that crystal seeds are sentient, although no one has ever been able converse with any crystal consciousness other than that of Seren herself.",
    "template": "citetext"
  },
  {
    "text": "The great divide",
    "quote": "It was at this point that Baxtorian quoted the 'Cerddi', telling all those present that 'only together as the eight clans can we hope to survive in this hostile new world'.",
    "template": "citetext"
  },
  {
    "text": "Crystal singing for beginners",
    "quote": "The idea behind chanting is quite simple: different pitches can change the shape and size of any facet of the seed.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Charlie Lyeman.",
    "template": "citetext"
  },
  {
    "text": "Grand Museum",
    "quote": "100 years after the founding of Fortis, it was decreed that a second settlement be built to address issues caused by the fast growing population.",
    "template": "citetext"
  },
  {
    "text": "Grand Museum",
    "quote": "At the time, the islands of Tempest Bay were not considered a strong contender due to the unstable ground and the presence of a band of hill giants.",
    "template": "citetext"
  },
  {
    "text": "Grand Museum",
    "quote": "Despite the Cloud Titan being defeated around 900 years ago, the armour was not found until roughly 700 years later when it was donated to the museum by a traveller.",
    "template": "citetext"
  },
  {
    "text": "Grand Museum",
    "quote": "The traveller claimed to have slain the Cloud Titan himself, with the giant having survived its original defeat. However, experts consider this unlikely.",
    "template": "citetext"
  },
  {
    "text": "Grand Museum",
    "quote": "The wyrm is believed to have originated from deep within the Hailstorm Mountains, but for unknown reasons, it travelled to the Avium Savannah around 200 years ago.",
    "template": "citetext"
  },
  {
    "text": "Grand Museum",
    "quote": "The wyrm terrorised the region for many moons before warriors from across the kingdom finally banded together to defeat it.",
    "template": "citetext"
  },
  {
    "text": "Bloody diary",
    "quote": "In my travels throughout the Shining Kingdom, I have bested many mighty creatures. From the Colossal Wyrm of the Avium Savannah to the Cloud Titan of Tempestus, I am proud to proclaim myself as a master slayer.",
    "template": "citetext"
  },
  {
    "text": "Soul journey",
    "author": "Aretha",
    "quote": "Ensouled heads are a sign of a soul in torment; it is therefore our duty to free such souls from their prison with all due speed. The magic of the Dark Altar enables the ensouled head to re-form itself a rudimentary body; this may be slain in order to grant liberty to the soul at last.",
    "template": "citetext"
  },
  {
    "text": "Transportation incantations",
    "author": "Amon Ducot",
    "quote": "Our blood and soul altars are focal points where the energy comes into this dimension from the true Blood and Soul Altars, wherever they may be.",
    "template": "citetext"
  },
  {
    "text": "Soul journey",
    "author": "Aretha",
    "quote": "...the Soul Altar enables our city's departed souls to have the comforting certainty of the River; it is clearly a great blessing...",
    "template": "citetext"
  },
  {
    "text": "Ricktor's diary (7)",
    "quote": "Messrs. Stalae and Frayn proceeded to survey the site as I studied the ancient text found around the Altar itself. I feel that even though the text is ancient I will be able to make progress on understanding it.",
    "template": "citetext"
  },
  {
    "text": "Ricktor's diary (7)",
    "quote": "One word keeps appearing in all of the text I read, sacrifice. I do not yet know under what terms the word should be used, I must study further to understand more.",
    "template": "citetext"
  },
  {
    "text": "Ricktor's diary (7)",
    "quote": "His understanding of the language is beyond laughable and his translation of the symbol as 'death' rather than 'sacrifice', is simply absurd.",
    "template": "citetext"
  },
  {
    "text": "Malumac's journal",
    "quote": "It took another day of searching but we think we've found it. The architecture is very unique and matches Zamorak's description. It looks like we may face a couple of challenges before the job is done though, the temple takes the form of a maze, one that is protected by numerous traps and guarded by some strange automatons. It's clear that whoever stored the artefact here did not wish for it to be recovered.",
    "template": "citetext"
  },
  {
    "text": "Malumac's journal",
    "quote": "Impressed by our work, Zamorak himself has personally given us our next mission. For our lord himself to give out a mission is rare, it is clear that this is something of great importance to him. (...) The information provided was vague, but Zamorak believed we would find the temple on the southern part of the island.",
    "template": "citetext"
  },
  {
    "text": "Malumac's journal",
    "quote": "Soon we will present the artefact to Zamorak and with it, he will win this war.",
    "template": "citetext"
  },
  {
    "text": "Malumac's journal",
    "quote": "...that's when our leader revealed his treachery, too late for us to stop it. He took the artefact from its pedestal and turned to face us. Before we could react, he launched a barrage of demonic magic towards us. Many were killed instantly.",
    "template": "citetext"
  },
  {
    "text": "Mount Karuulm diary",
    "author": "Karuulm",
    "quote": "The arrival seems to be a demon of Zamorak, one in possession of an artefact I have never encountered. While the demon arrived alone, he has used this artefact to call upon a variety of creatures to his side.",
    "template": "citetext"
  },
  {
    "text": "Transvergence theory",
    "author": "Amon Ducot",
    "quote": "If we look at the Dark Altar as a whole we can see that it is able to bring life out of death when reanimating corpses, corrupt individuals and break minds.",
    "template": "citetext"
  },
  {
    "text": "Transdimensional notes",
    "quote": "It is known, of course, that the Dark Altar can connect to other planes of existence. That is how it sustains our runic altars, by linking Kourend to whatever far-off realms contain the true Blood and Soul Altars.",
    "template": "citetext"
  },
  {
    "text": "Soul journey",
    "author": "Aretha",
    "quote": "We therefore owe a debt of gratitude to the Dark Altar, for it is the Dark Altar's power that creates and maintains Kourend's soul altar, drawing energy to this realm from the unknown plane where the true Soul Altar resides.",
    "template": "citetext"
  },
  {
    "text": "Transvergence theory",
    "author": "Amon Ducot",
    "quote": "I think it is no coincidence that the Dark Altar allows blood and soul runes to be created only as these are primarily needed to reanimate the dead.",
    "template": "citetext"
  },
  {
    "text": "Transvergence theory",
    "author": "Amon Ducot",
    "quote": "By only being able to harness the essence changing power with dark essence, the Dark Altar has even more use and purpose.",
    "template": "citetext"
  },
  {
    "text": "Transvergence theory",
    "author": "Amon Ducot",
    "quote": "It is almost as if the Dark Altar has some sense of self preservation and is looking for as many ways as possible to be integral to our community and thus, gain power within it.",
    "template": "citetext"
  },
  {
    "author": "Kardia",
    "text": "History of iban",
    "quote": "Meeting his demise in the White Knights' now famous Dawn Ascent, Iban died with the bitter taste of failure in his mouth.",
    "template": "citetext"
  },
  {
    "author": "Kardia",
    "text": "History of iban",
    "quote": "I, Kardia, had done the unimaginable: Iban was resurrected, the most powerful evil to take human form.",
    "template": "citetext"
  },
  {
    "author": "Kardia",
    "text": "History of iban",
    "quote": "Iban was a Black Knight who had learned to fight under the great Daquarius, Lord of the Black Knights.",
    "template": "citetext"
  },
  {
    "text": "Goblin symbol book",
    "page": "12",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Randulf Harlow.",
    "template": "citetext"
  },
  {
    "text": "Lithkren vault notes",
    "author": "Zorgoth",
    "page": "5",
    "quote": "...our kind was immune to their weapons for so long that we allowed ourselves to become reckless. A foolish mistake. We'd heard of the Necrosyrtes who had fallen on Kethsi. We should have known the humans would find those weapons. But we were arrogant and by the time we realised it, it was too late.",
    "template": "citetext"
  },
  {
    "text": "Ungael lab notes",
    "author": "Zorgoth",
    "page": "2",
    "quote": "For so long we have been tweaking the spores to no effect.",
    "template": "citetext"
  },
  {
    "text": "Old notes (Dragon Slayer II)#Crandor",
    "list": [
      "Old notes"
    ],
    "author": "Zorgoth",
    "quote": "Hundreds of trials have been performed, so many that I have lost count. ... The subject displayed heightened aggression, as desired. However, its strength is unchanged and its mental capacity is limited.",
    "template": "citetext"
  },
  {
    "text": "Old notes (Dragon Slayer II)#Crandor",
    "list": [
      "Old notes"
    ],
    "author": "Zorgoth",
    "quote": "Our work has outgrown this small facility [on Crandor], it is time to move on.",
    "template": "citetext"
  },
  {
    "text": "Ungael lab notes",
    "author": "Zorgoth",
    "page": "2",
    "quote": "For this trial, I decided we should change the subject instead. Green has failed us so far, maybe Blue will have better results.",
    "template": "citetext"
  },
  {
    "text": "Ungael lab notes",
    "author": "Zorgoth",
    "page": "7",
    "quote": "But once again, it was a disappointment. The strength in this one was phenomenal, a true sight to behold. However, it lacked the aggression needed. It was another vorkath, a pathetic failure. I should have let it live, a beast that strong would likely have still had a use. However, my anger got the better of me, and I destroyed it.",
    "template": "citetext"
  },
  {
    "text": "Ungael lab notes",
    "author": "Zorgoth",
    "page": "5",
    "quote": "As our operation grows, I feel we will soon need even more room to work. To that end, I have ordered the construction of a new facility, this one on Lithkren itself.",
    "template": "citetext"
  },
  {
    "text": "Ungael lab notes",
    "author": "Zorgoth",
    "page": "9",
    "quote": "Human forces are on the move. We don't know how they found the island, but that is irrelevant now. Luckily for us, the new facility is ready. I've ordered that all important materials be transported there at once. In the meantime, I intend to provide the humans with a little distraction. Seems like the vorkath will have a use after all.",
    "template": "citetext"
  },
  {
    "text": "Aivas' diary",
    "author": "Aivas",
    "page": "1",
    "quote": "One of the scouts came back today with a disturbing report. He claimed that he had seen the enemy abducting various beasts from the caves north of Karville. Demons, giants and spectres were just some of the ones he mentioned.",
    "template": "citetext"
  },
  {
    "text": "Aivas' diary",
    "author": "Aivas",
    "page": "2-3",
    "quote": "sailors have been having to brave more treacherous waters. While navigating the rarely travelled northern seas, they spotted an unmapped group of islands to the east. They claimed that one of the islands was the home of a large fortress, one built in the distinct architecture of the kin.",
    "template": "citetext"
  },
  {
    "text": "Ungael lab notes",
    "author": "Zorgoth",
    "page": "2",
    "quote": "Another setback, once again the humans are responsible. They found the island and launched an attack. As planned, the emergency protocol was enacted and the vault was sealed, unfortunately, I was still inside it when this happened.",
    "template": "citetext"
  },
  {
    "text": "Tomb (Dragon Slayer II)",
    "list": [
      "Camorra's tomb"
    ],
    "quote": "Here lies Camorra Shayzien // Founder of Shayzien House.",
    "template": "citetext"
  },
  {
    "text": "Refugees note",
    "quote": "Another hundred refugees arrived today. This war has already lasted multiple lifetimes for the lesser races, and there is no end in sight. I ask once again that we consider our capacity here. I do not wish to turn away those who are still faithful, but we are running out of room.",
    "template": "citetext"
  },
  {
    "text": "Request note",
    "quote": "I understand the need for security, but some of the humans have spent their entire lives in this place. Giving them a glimpse of the outside could be a much needed morale boost for everyone.",
    "template": "citetext"
  },
  {
    "text": "Prisoner's letter",
    "quote": "Something isn't right. The war is over and the gods are gone. We should be leaving this place, but instead we remain. Apparently, the Duke requires us to make preparations before we return to the surface, but there is something we are not being told.",
    "template": "citetext"
  },
  {
    "text": "Prisoner's letter",
    "quote": "The Duke hasn't left the asylum in days, and every day, more people are taken down there... never to return. I feel something terrible is fast approaching. We must leave before it does.",
    "template": "citetext"
  },
  {
    "text": "Warning letter",
    "quote": "If you're reading this, you've no doubt already seen the horrifying truth for yourself. The Duke thinks he's destined to restore the empire, at the small cost of all our lives!",
    "template": "citetext"
  },
  {
    "text": "Evacuation note",
    "quote": "He ate them... He ate them all!",
    "template": "citetext"
  },
  {
    "text": "Evacuation note",
    "quote": "Ghorrock is forsaken and must be evacuated at once. Round up all who are left and tell them they have an hour to leave. Jhallan and Mizzarch are preparing to have this place sealed.",
    "template": "citetext"
  },
  {
    "text": "Goblin symbol book",
    "page": "10",
    "template": "citetext"
  },
  {
    "text": "Old tablet",
    "quote": "With artefact 'Imperium' safely delivered to the east, focus must return to artefact 'Primus'.",
    "template": "citetext"
  },
  {
    "text": "The wardens",
    "quote": "In war, great weapons can turn the tide against even the strongest foes, and legend has long spoken of Tumeken using a powerful staff to build two such weapons.",
    "template": "citetext"
  },
  {
    "text": "The wardens",
    "quote": "In truth, referring to Tumeken's creations as 'weapons' does them no justice. They are in fact two ancient automatons, built to embody Tumeken and Elidinis themselves and seemingly imbued with their divine essence.",
    "template": "citetext"
  },
  {
    "text": "The wardens",
    "quote": "It was believed any truth to these legends had long since been lost, but here in Osmumten's tomb, the truth is revealed: the weapons exist, and they are the prize the Devourer so fervently seeks.",
    "template": "citetext"
  },
  {
    "text": "Akila's journal",
    "quote": "After we gave her a way in, the true horror of her plans became clear. I had never set eyes on the four lesser deities, but I knew them when I saw them. She had them all. She took them into the tomb, along with a selection of ghastly beasts.",
    "template": "citetext"
  },
  {
    "text": "Demonic tome",
    "author": "Ellemar",
    "loc": "Shadow of the Storm",
    "quote": "I did read forbidden books, and I did perform unholy rituals forbidden by the Church of Saradomin... All knowledge of [demons] is suppressed by the Church. Should we not know our enemies? IF we were to read the tomes of demon-lore, and yet keep the light of Saradomin in our hearts, might we not find new and better ways to fight these beasts?",
    "template": "citetext"
  },
  {
    "text": "Demonic tome",
    "author": "Ellemar",
    "loc": "Shadow of the Storm",
    "quote": "[There are] demons working behind the scenes to cause natural disasters and accidents. The chief among these demons is Agrith Naar. If Agrith Naar were to be removed from his own dimension he would be unable to work his magic on the world.",
    "template": "citetext"
  },
  {
    "text": "Demonic tome",
    "author": "Ellemar",
    "loc": "Shadow of the Storm",
    "quote": "The final act was for eight persons... The ritual was a success, and the great demon Agrith Naar appeared before us.",
    "template": "citetext"
  },
  {
    "text": "Demonic tome",
    "author": "Ellemar",
    "loc": "Shadow of the Storm",
    "quote": "We had prepared a magical cage, and with difficulty we imprisoned the demon. However, we were unable to destroy him, though we tried every physical and magical means. Furthermore, the magical cage was weakening, and we feared it would not be able to contain him for long. Therefore we decided to",
    "notes": "Note: The transcript ends after this, with the rest torn out.",
    "template": "citetext"
  },
  {
    "text": "Demonic tome",
    "author": "Ellemar",
    "loc": "Shadow of the Storm",
    "quote": "I know that it is too late to prevent my execution, and I do not dispute the letter of the charges against me.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Elsie Parks.",
    "template": "citetext"
  },
  {
    "text": "Old notes (Dragon Slayer II)",
    "quote": "This trial was different though, the subject did not reject the spores as previous ones did. Alas, the results were unsatisfactory. The subject displayed heightened aggression, as desired. However, its strength is unchanged and its mental capacity is limited.",
    "template": "citetext"
  },
  {
    "text": "The great divide",
    "quote": "For almost two millennia, we lived in the eastern realm, then in the year 1930, we lost all contact with our people back in Tirannwn.",
    "template": "citetext"
  },
  {
    "text": "Gollwyn's final statement",
    "author": "Gollwyn",
    "quote": "A further quarter of us were slain by traps within the forest as we fled, left behind in our haste. We reached the Well of Voyage by nightfall (...) Lord Iorwerth had sent his forces into the pass. (...) A bolt of magic hit one of my warriors in the torso, and I turned to help him. (...) By the time I turned back toward the skirmish, all was lost. The last of the defenders had begun to fall.",
    "template": "citetext"
  },
  {
    "text": "Cadarn lineage",
    "quote": "Able to trace its blood line back to one of the eight families brought here by Seren in the First Age, it was the Cadarn's responsibility to protect the other seven clans from any hostility encountered while colonising this new world.",
    "template": "citetext"
  },
  {
    "text": "Prifddinas' history",
    "quote": "Each of the eight clans would have its own segment of the city. Each segment would be edged on one side by a city wall with its opposing corner at the city centre, where 'The Tower of Voices' is located. [...] Seren then provided one special seed for every clan, telling them that each seed should be taken to the centre of each clans segment of the city. Once there, it should be planted where it will develop to form a tower.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Lawrence Lambare.",
    "template": "citetext"
  },
  {
    "text": "rsw:Transcript:RuneScape Lore Marathon - from RuneFest 2017#Fayrgs",
    "list": [
      "RuneScape Lore Marathon",
      "Mod Chaose",
      "Runefest 2017"
    ],
    "author": "rsw:Mod Chaose",
    "loc": "rsw:Runefest 2017",
    "quote": "these guys are kind of like lieutenants . . . beneath the ourgs. They're kind of micromanaging the battle, the ourgs make the big decisions, the big plans. But these guys kind of are: \"Alright, this section of the battle, we need to do this, something of this\", so on and so on. If there's a crisis . . . They're there to sort it out. And they don't have to bother the ourgs, necessarily. . . . They've got this huge gaping maw as well so they shout orders across the entire battlefield, it might be like a mile long battlefield and the guy in the end, he can still hear his orders, . . . These guys are fairly big as well, so if you imagine an ork and an ourg... Somewhere in between that",
    "template": "citetext"
  },
  {
    "text": "Goblin book",
    "quote": "But now goblins not have enough to eat, and have no commanders to tell them who to fight. So goblin tribes fight one another.",
    "page": "8-9",
    "template": "citetext"
  },
  {
    "text": "Grand Museum",
    "quote": "In the early days of the kingdom, criminals were sacrified to Ralos in a temple atop the Fortis Cliffs. However, King Maximus ordered the destruction of this temple, insisting there was no place for human sacrifice in Varlamore.",
    "template": "citetext"
  },
  {
    "text": "Eastern discovery",
    "quote": "After centuries of isolated development, after the God Wars, it was decided that the elven domain needed to expand. With their backs to the sea, there was only one way to go, east. After many years of hard work, a pass over the mountains was created.",
    "template": "citetext"
  },
  {
    "text": "Eastern discovery",
    "quote": "The gnomes, having taken great losses at the end of the God Wars, were more than happy to find a race who did not wish them harm and signed up to the treaty immediately. The humans, being of many different tribes, were a little harder to get any agreement from. After much time and organization however, the tribes concluded that a non-aggression pact with the elves was in all their best interests.",
    "template": "citetext"
  },
  {
    "text": "Eastern settlement",
    "quote": "This was a time of great prosperity and profit for elves, gnomes and humans alike. New trade agreements were being created with the gnomes and humans.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Varrock Museum Timeline exhibit, display number 20"
    ],
    "quote": "4th Age - yr 1-100. Around the beginning of the 4th Age, a new terror was seen in the world: the dragonkin.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Varrock Museum Timeline exhibit, display number 8"
    ],
    "quote": "4th Age - yr 1-200. Taverley is the site of the only known example of a surviving druidic stone circle, but the druids of Guthix speak of many others scattered across Gielinor in the past. Our best dating techniques place them in the 4th Age.",
    "template": "citetext"
  },
  {
    "text": "Astronomy Book",
    "quote": "At the start of the 4th Age, a learned man by the name of Scorpius, known well for his powers of vision and magic, sought communion with the gods of the world. (…) As time passed, Scorpius grew adept at using his specialized skills, and followed the movements of the stars in Gielinor, which he mapped and named, and are still used to this very day.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Varrock Museum Timeline exhibit, display number 29"
    ],
    "quote": "4th Age - yr 31-60. A fine example of an incredibly old star chart. Not much is known about it, but the positions of the stars indicate that it was made around the years 31-60 of the 4th Age.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Varrock Museum Timeline exhibit, display number 34"
    ],
    "quote": "4th Age - yr 500–900. An early 4th Age map showing the human civilisations starting to settle into more permanent villages.",
    "notes": "Indicated on the map at display are \"Karamja\", \"Entrana\", \"Asgarnia\", \"Ghost Town\", \"Avarrocka\", and \"Misthalin\".",
    "name": "map",
    "template": "citetext"
  },
  {
    "text": "Timeline",
    "quote": "King Rada I: 10th BA",
    "notes": "The date convention in Great Kourend is to count the number of decades before or since the signing of the Royal Accord of Twill, which occurred approximately 1,410 years from the present date. Ten decades before the accord means 1,510 years ago, which translates to the 659th year of the Fourth Age.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Varrock Museum Timeline exhibit, display number 24"
    ],
    "quote": "4th Age - yr 700-800. Arrav is probably the best known hero from the 4th Age. In his youth, he was found by a tribe that took him to be a good omen and set up a camp that they called Avarrocka. That camp, in later years, became known as our glorious city of Varrock.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Varrock Museum Timeline exhibit, display number 23"
    ],
    "quote": "4th Age - yr 1100-1200. A tide of evil creatures from the east threatened Avarrocka (…). Seven priestly warriors - Iriandul Caistlyn, Sarl Dunegun, Friar Twiblick, Derygull, Ivandis Seergaze, Erysail the Pious and Essiandar Gar - attempted to drive the evil creatures back into what we now know as Morytania. Saradomin blessed the River Salve, making it impassable to the foul things lurking in the swamps (…).",
    "template": "citetext"
  },
  {
    "text": "Timeline",
    "quote": "Xeric: 37th - 47th.",
    "template": "citetext"
  },
  {
    "text": "Glough's journal",
    "quote": "After spending half a century hiding underground you would think that the great migration would have improved life on Gielinor for tree gnomes. However, rather than the great liberation promised to us by King Healthorg at the end of the last age, we have been forced to live in hiding, up trees or in the gnome maze, laughed at and mocked by man.",
    "template": "citetext"
  },
  {
    "text": "The Giant Dwarf",
    "quote": "Five hundred years have passed since the rule of King Alvis, saviour of Keldagrim, victim of his own intentions. He founded the Consortium: the gathering of mining companies that were to serve the monarchy. But eventually the monarchy came to serve the Consortium. By the time of his death, the monarchy was all but abolished.",
    "notes": "(opening cutscene)",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Varrock Museum Timeline exhibit, display number 15"
    ],
    "quote": "4th Age - yr 1777. Temple records show that human settlers came to the temple on the River Salve looking for new lands in which to settle. (…) The Museum recently came into possession of this torn map showing the expansion routes of the settlers.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Varrock Museum Timeline exhibit, display number 6"
    ],
    "quote": "4th Age - yr 1937. Settlers established a town on the River Lum. Across the river they build a bridge and hence the town became called Lumbridge.",
    "template": "citetext"
  },
  {
    "text": "Timeline",
    "quote": "None (War of the Five Houses) : 120th – 123rd. King Kharedst I: 123rd - 126th.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Varrock Museum Timeline exhibit, display number 15"
    ],
    "quote": "5th Age - currently 169 years old. In the first years of the 5th Age, human mages discovered the secrets of making runes from rune essence. Due to the power of these runes, humans started to become dominant within the world, with the human kingdoms of Misthalin and Asgarnia quickly growing to become the ones we know today.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Varrock Museum Timeline exhibit, display number 4"
    ],
    "quote": "5th Age - yr 8. The kingdom of Asgarnia grew rapidly. King Raddallin, who was one of the tribal leaders of the area, had united many of the smaller tribes and settlements. However, one group within his domain is known as the Kinshra, or Black Knights. They had originally proved cooperative in helping the expansion of the kingdom of Asgarnia (…). Another group known as the White Knights had also proven to be particularly competent in battle and were now helping him by being the main military force defending his capital city of Falador. However, it turned out that the White Knights and Black Knights had always been bitter rivals.",
    "template": "citetext"
  },
  {
    "text": "The truth behind the myth (excerpt)",
    "quote": "It wasn't until Archibald Malore's translation into the common tongue that all [of the original Camorra poems] were standardised and Garak became a 'dragon'.",
    "template": "citetext"
  },
  {
    "text": "The truth behind the myth (excerpt)",
    "quote": "It is curious how, deposit all her other impressive accomplishments, it is the slaying of [Garak] that is considered to be Camorra's defining heroic feat. It is for this single act that she is counted among Arrav or Robert the Strong...",
    "template": "citetext"
  },
  {
    "text": "The truth behind the myth (excerpt)",
    "quote": "...her cooperation with [Robert the Strong] should, by all accounts, be far more impressive [than slaying Garak].",
    "template": "citetext"
  },
  {
    "text": "The truth behind the myth (excerpt)",
    "quote": "...no other dragon from this time period appears to have gained the legendary reputation that Garak has. If dragons were such an immense threat, then surely the historical record would have countless similar examples.",
    "template": "citetext"
  },
  {
    "text": "The truth behind the myth (excerpt)",
    "quote": "Examination of dragon corpses has shown that dragons possess remarkably developed brains. However, most dragons appear to be gripped by an instinctual rage and ferocity that makes them unable to utilise it to its full potential.",
    "template": "citetext"
  },
  {
    "text": "The truth behind the myth (excerpt)",
    "quote": "...examining the original Camorra poems shows that there is actually very little evidence for Garek having been a dragon.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Gertrude Fairweather.",
    "template": "citetext"
  },
  {
    "text": "Request note",
    "loc": "Ghorrock Prison",
    "quote": "Forgive me for writing to you about such a minor matter, but I was wondering if you'd had any more thoughts on my request? I understand the need for security, but some of the humans have spent their entire lives in this place. Giving them a glimpse of the outside could be a much needed morale boost for everyone.",
    "template": "citetext"
  },
  {
    "text": "Protest note",
    "loc": "Ghorrock Prison",
    "quote": "The recent treatment of our kind cannot be allowed to continue. Yes, the uprising was unacceptable, but all humans cannot all be tarred with the same brush! We are all loyal servants of the Empire, and it's time we are treated as such. If you agree, then join our cause! Our protest will be peaceful, but our voices will be heard!",
    "template": "citetext"
  },
  {
    "text": "Warning letter",
    "loc": "Ghorrock Prison",
    "quote": "If you're reading this, you've no doubt already seen the horrifying truth for yourself. The Duke thinks he's destined to restore the empire, at the small cost of all our lives!",
    "template": "citetext"
  },
  {
    "text": "Evacuation note",
    "loc": "Ghorrock Prison",
    "quote": "Ghorrock is forsaken and must be evacuated at once. Round up all who are left and tell them they have an hour to leave. Jhallan and Mizzarch are preparing to have this place sealed. After that, there will no escape. Not for him, and not for any others left inside.",
    "template": "citetext"
  },
  {
    "text": "Prifddinas' history",
    "quote": "It is told that the first elves to come through the World Gate found a world full of beautiful woodlands and terrible beasts.",
    "template": "citetext"
  },
  {
    "text": "Transcript:A Kingdom United",
    "quote": "On any ordinary day, the Grand Museum of Civitas illa Fortis would be bustling with visitors hoping to get a glimpse at the rare treasures within – the icon of Ralos, the armour of the Cloud Titan and, of course, the Royal Accord of Twill, finally taking pride of place in the glass cabinet found in the Hall of Kourend's centre.",
    "template": "citetext"
  },
  {
    "text": "Transcript:A_Kingdom_United",
    "list": [
      "A Kingdom United"
    ],
    "quote": "Yorah would meet the High Priest to hand over their predecessor's dagger and cement their place as one of the Kualti.",
    "template": "citetext"
  },
  {
    "text": "Imafore's betrayal",
    "quote": "[Great Kourend] was formed over a thousand years ago by settlers who had fled the God Wars.",
    "template": "citetext"
  },
  {
    "text": "Malumac's journal",
    "quote": "...that's when our leader revealed his treachery, too late for us to stop it. He took the artefact from its pedestal and turned to face us. Before we could react, he launched a barrage of demonic magic towards us. Many were killed instantly.",
    "template": "citetext"
  },
  {
    "text": "Mount Karuulm diary",
    "author": "Karuulm",
    "quote": "The arrival seems to be a demon of Zamorak, one in possession of an artefact I have never encountered. While the demon arrived alone, he has used this artefact to call upon a variety of creatures to his side.",
    "template": "citetext"
  },
  {
    "text": "Hosidius letter",
    "author": "Lord Ethrain Hosidius I",
    "quote": "Only yesterday did I meet with the lords of the other houses and we agreed in principle that all houses would offer half their land so we may farm more. Within six months we can have enough food to halt this famine.",
    "template": "citetext"
  },
  {
    "text": "Hosidius letter",
    "author": "Lord Ethrain Hosidius I",
    "quote": "My most venerable Council, I beseech you to grant my request as mentioned in previous meetings at your chamber. We can grow enough food to extricate us from the famine we have experienced these last five years. However, I cannot do so without the appropriate amount of land.",
    "template": "citetext"
  },
  {
    "text": "Official Order of Construction",
    "author": "Lord Arceuus I",
    "quote": "It is with this in mind that I, Lord Arceuus, Ruler of Great Kourend, hereby order the construction of a library. A library filled with texts, documents and research from all of Great Kourend. The library shall be constructed here, within Arceuus, and enchanted with spells from our greatest mages to protect the contents from evil.",
    "template": "citetext"
  },
  {
    "text": "Winter's End",
    "quote": "Dinh has constructed the doors to the prison from various metal compounds, including Lovakite, but they must be reinforced with Bruma bark and enchanted by the Order.",
    "template": "citetext"
  },
  {
    "text": "Winter's End",
    "quote": "Rejoice! Our mission has succeeded. The beast has been contained! The Bruma tree burns bright in the night sky, warming the northern tundra and holding back the beast.",
    "template": "citetext"
  },
  {
    "text": "Royal Wedding Invitation",
    "quote": "The State Chamberlain is commanded by The King to invite Mr Hanson Piscarilius to the marriage of His Royal Highness King Shayzien VI with Miss Enia Hosidius at Shayzien Chapel on 2,547 - 20 at High Noon.",
    "template": "citetext"
  },
  {
    "text": "The Great Expedition",
    "quote": "I have requested a team to survey the immediate area to the west. We will need this information to determine the level of danger and scope of the mission.",
    "template": "citetext"
  },
  {
    "text": "The Great Expedition",
    "quote": "The survey team reports findings of a mountain to the west of their encampment beyond a swampy area.",
    "template": "citetext"
  },
  {
    "text": "The Great Expedition",
    "quote": "King Shayzien VII has approved the expedition plans. 250 Days to ascend the western mountain and return with details of the findings.",
    "template": "citetext"
  },
  {
    "text": "Imafore's betrayal",
    "quote": "The Kingdom of Varlamore was formed in a very similar way to Kourend, by those fleeing the Age of Strife.",
    "template": "citetext"
  },
  {
    "text": "Shayzia military orders",
    "quote": "... all five of the leaders had agreed to the plan to depose the gluttonous King Agata IV.",
    "template": "citetext"
  },
  {
    "text": "Shayzia military orders",
    "quote": "It is with a heavy heart I must inform you of a great tragedy to befall our house. Lord Shayzien is dead. Murdered by a cowardly alliance between Lord Lovakengj and Lady Piscarilius.",
    "template": "citetext"
  },
  {
    "text": "Shayzia military orders",
    "quote": "The Lovakengj alliance with Lady Piscarilius was thankfully short lived, and there has been significant fighting between the two armies.",
    "template": "citetext"
  },
  {
    "text": "Shayzia military orders",
    "quote": "Meanwhile, Lady Hosidius has already rallied her forces as well, though it is unclear where her allegiances lie at this point.",
    "template": "citetext"
  },
  {
    "text": "Shayzia military orders",
    "quote": "Lord Arceuus has returned to Arceuus and reinforced the city. It seems he has no desire to participate in this conflict, but I suspect he will soon be given no choice.",
    "template": "citetext"
  },
  {
    "text": "Bloody diary",
    "quote": "The war started from some petty squabble between the lords and ladies of the five Houses, and I do not regret leaving at all.",
    "template": "citetext"
  },
  {
    "text": "Rose's note",
    "quote": "Find a great ruin that has withered and died. A seat of power, lost in a war of pride.",
    "template": "citetext"
  },
  {
    "text": "Bloody diary",
    "quote": "I have no doubts about it. The magic keeping the monsters in the Catacombs has begun to waver...",
    "template": "citetext"
  },
  {
    "text": "Bloody diary",
    "quote": "...demons have begun to climb to the surface, abducting innocents.",
    "template": "citetext"
  },
  {
    "text": "Bloody diary",
    "quote": "She [Mother] told me father survived the war, but she tells me since its end, there have been abductions occurring in the middle of the night, and father was just abducted the night before my return.",
    "template": "citetext"
  },
  {
    "text": "Bloody diary",
    "quote": "Further into the Catacombs, I managed to slay several demons. One of them carried a particularly odd object, appearing to be a key of sorts, and oozes with the same power from the Dark Altar.",
    "template": "citetext"
  },
  {
    "text": "Bloody diary",
    "quote": "I placed the key and was teleported into a large, empty chamber. I thought myself alone, until a large, dark demon made its presence known to me... Before I could gather my thoughts, the demon grabbed me and threw me across the chamber, breaking my spine.",
    "template": "citetext"
  },
  {
    "text": "Varlamore envoy",
    "quote": "In the hope of repairing the relationship with Varlamore, King Kharedst III ordered an envoy be sent to the Shining Kingdom. However, the envoy is not all that was sent. Despite the protests of many, the King insisted that the Accord be taken with the envoy to Varlamore to be displayed in the Grand Museum of Civitas illa Fortis.",
    "template": "citetext"
  },
  {
    "text": "Kharedst's memoirs",
    "author": "Rose",
    "quote": "At this morning's breakfast he revealed to me what he'd been hiding in the form of a birthday present. It's beautiful! A locket of pale gold shaped like a rose that contains a wonderful painting of mother opposite a dark purple crystal.",
    "template": "citetext"
  },
  {
    "text": "Kharedst's memoirs",
    "author": "Rose",
    "quote": "He assured me [the locket is] certainly at least several centuries old in between quick sips from a peculiar ornate flask with an 'X' imprinted on the side. I suppose he picked that up yesterday from the tinker as well.",
    "template": "citetext"
  },
  {
    "text": "Letter (The Queen of Thieves)",
    "list": [
      "Letter"
    ],
    "author": "Sophia Hughes",
    "quote": "Child of Yama, I have left the items you requested at the usual drop-off, courtesy of the Kourend Treasury. It goes without saying, but I trust you will make our master aware of who is funding his return. Regards, Sophia Hughes",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "page": "21",
    "quote": "Forgive me for not being with you for the decade dawn gathering but I'm afraid we have very little to celebrate.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Grimesquit Grime.",
    "template": "citetext"
  },
  {
    "text": "Display case 2",
    "quote": "A group of the more warmongering of the mountain tribe broke away, led by a warrior called Gunnar, and went on a rampage across northern Kandarin and Asgarnia to put a stop to this 'runecrafting'.",
    "template": "citetext"
  },
  {
    "text": "Display case 2",
    "quote": "The invading Fremennik were not happy about all the spellcasting and launched many attacks, reducing the Imcando to near extinction.",
    "template": "citetext"
  },
  {
    "text": "Display case 1",
    "quote": "The barbarian invaders were running out of steam. They were pretty much forced to make peace or be wiped out, so they agreed to settle down peacefully and make a village on the Misthalin/Asgarnia border, thinking they could lie low, well positioned to build up strength and resume their campaign later..",
    "template": "citetext"
  },
  {
    "text": "Varrock_Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Varrock Museum, display 16"
    ],
    "quote": "The world of Gielinor is said to have been created by the gods Saradomin, Zamorak and Guthix at the start of the 1st Age.",
    "template": "citetext"
  },
  {
    "text": "Varrock_Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Varrock Museum, display 16 (after Curse of the Empty Lord)"
    ],
    "quote": "However, recent evidence from a brave adventurer suggests that Zamorak was not a god at this point in time and so would not have been able to create worlds.",
    "template": "citetext"
  },
  {
    "text": "Histories of the hallowland",
    "quote": "It is said that before the dark Lord Drakan arrived in Morytania, a very different land existed. A green land, pleasant and bounteous. Sufficient to please many hundreds of farmers, and to supply large towns, villages and cities with food.",
    "template": "citetext"
  },
  {
    "text": "Journal page",
    "quote": "From the stadium to Everlight, crowds lined the streets. I'd never seen anything like it. It seems that the royal family have spared no expense. It makes sense though. This is the first time that the Dominion Games have taken place here.",
    "template": "citetext"
  },
  {
    "text": "Strange hallowed tome",
    "quote": "I paid a visit to the priests at the Hallowed Sepulchre. Icyene and humans are normally buried on different levels. For us, I pray they make an exception.",
    "template": "citetext"
  },
  {
    "text": "The sleeping seven",
    "quote": "Against all her considerable will she was forced to kneel and attend 'his-dark-self' in order that she might save her loving husband, Ascertes.",
    "template": "citetext"
  },
  {
    "text": "The turncloak",
    "quote": "Where's our god now? The king has been taken and so the queen has no choice. She'll surrender the capital causing the fighting to stop, and the killing to begin. Those who resist will be enslaved, especially the pious - they taste the best, or so I've heard. I'll ask you again, where's our god now?",
    "template": "citetext"
  },
  {
    "text": "The turncloak",
    "quote": "His-Dark-Self accepted our offering! My sisters and I have been tasked with clearing out the hamlets and leading the cattle right into the heart of his vampyre host... soon Hallowvale will be a name forgotten in time, covered by the grand shadow of our new god.",
    "template": "citetext"
  },
  {
    "text": "Akila's journal",
    "quote": "For some time now, we've been excavating a tomb for the Devourer. I don't know how long it's been. Time has no meaning when under her control.",
    "template": "citetext"
  },
  {
    "text": "Akila's journal",
    "quote": "Most of the others were left outside, but some of us were ordered to enter the tomb as well. She needs us in case more excavation work is required inside.",
    "template": "citetext"
  },
  {
    "text": "Akila's journal",
    "quote": "As I write, I can feel her hold on me beginning to strengthen once more. I pray it doesn't last. I'll continue to document what I can, when I can. It feels futile, but there's a chance someone stronger than me will find these words and act on them. Maybe I can help them stop the Devourer.",
    "template": "citetext"
  },
  {
    "text": "The wardens",
    "quote": "It seems my time is up. The Devourer never discovered my writing, but it doesn't matter now anyway... I wish I could keep writing, but she is closing in. I wish I had used my time more judiciously. So many things I should have done and said. All I can do now is pray my words help in some way, and that someone is able to overcome the Devourer.",
    "template": "citetext"
  },
  {
    "text": "Diary (Shades of Mort'ton)",
    "quote": "A patient only slightly afflicted had a short recovery with solution 194, but this lasted only a few minutes.",
    "page": "13",
    "template": "citetext"
  },
  {
    "text": "Diary (Shades of Mort'ton)",
    "quote": "Possible last entry... solution 194 revised to 207 which gives longer term but still not permanent relief from the affliction.",
    "page": "19",
    "template": "citetext"
  },
  {
    "text": "Diary (Shades of Mort'ton)",
    "quote": "Heard some further superstitious nonsense regarding a 'sacred-flame' where Flamtaer stood.",
    "page": "11-12",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Jack Tylner.",
    "template": "citetext"
  },
  {
    "text": "Goblin symbol book",
    "page": "12",
    "template": "citetext"
  },
  {
    "text": "Feathered journal",
    "quote": "The only 'loot' we managed to grab was a bag of refreshments from the gnome ball pitch. There'd better be something good in there, I could eat a camel right now.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Horvik Ravitz.",
    "template": "citetext"
  },
  {
    "text": "Goblin symbol book",
    "page": "11",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Iffie Nitter.",
    "template": "citetext"
  },
  {
    "text": "Imafore's betrayal",
    "quote": "For the first few years of Imafore's rule, Varlamore remained the peaceful and prosperous kingdom that it had always been.",
    "template": "citetext"
  },
  {
    "text": "Tatty page",
    "quote": "They [Imcando dwarves] took his head clean off! He's a vampyre! It shouldn't have been possible, but they did it all the same! The parasite must be to blame.",
    "template": "citetext"
  },
  {
    "text": "Tatty page",
    "quote": "The parasite must be to blame. It's far more dangerous than we thought, and I fear others may be infected as well. Many have claimed to be feeling strangely unwell, and one of the legionaries even started having visions. Of all things, he thought he saw the Carnifex Maximus' body move!",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Mabel Malore.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Display case 24"
    ],
    "quote": "4th Age - Years 700–800 ... That camp, in later years, became known as our glorious city of Varrock.",
    "template": "citetext"
  },
  {
    "text": "The turncloak",
    "author": "Phosani",
    "quote": "His-Dark-Self accepted our offering! My sisters and I have been tasked with clearing out the hamlets and leading the cattle right into the heart of his host of Vampyres.",
    "template": "citetext"
  },
  {
    "text": "Guide book",
    "quote": "Or perhaps the town of Brimhaven, on the exotic island of Karamja? It's only a short boat trip, with regular transport leaving from Ardougne Harbour at all times of the day, all year round.",
    "template": "citetext"
  },
  {
    "text": "Gielinor's flora - fruit",
    "quote": "A tropical palm like tree native only to the island of Karamja. (…) Although a completely inedible fruit due to its tough woody skin and hollow interior, it is cultivated instead as a way of storing liquid.",
    "template": "citetext"
  },
  {
    "text": "Gielinor's flora - trees",
    "quote": "The origin of the name is likely a miscommunication of the old Karamjan word m'oganwo.",
    "template": "citetext"
  },
  {
    "text": "Tattered scroll",
    "quote": "Bervirius, son of King Danthalas, was killed in battle. His devout mother Rashiliyia was so heartbroken that she swore fealty to Zamorak if he would return her son to her. Bervirius returned as an undead creature and terrorized the King and Queen.",
    "template": "citetext"
  },
  {
    "text": "A scribbled note",
    "loc": "Legends' Quest",
    "quote": "The spirit of an ancient one lurks deep within my soul... I am too weak to cast the curse myself and fight the beast within.",
    "template": "citetext"
  },
  {
    "text": "Scrawled note",
    "loc": "Legends' Quest",
    "quote": "Day 1... I have prepared the incantations, and will invoke the spirits of my ancestors to pay them homage.",
    "template": "citetext"
  },
  {
    "text": "Tattered scroll",
    "loc": "Shilo Village",
    "quote": "His remains were taken far to the South, and then towards the setting sun to a tomb that is surrounded by and level with the sea. This is the only way to contain the spirits of witches and the undead.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Katrine Raven.",
    "template": "citetext"
  },
  {
    "text": "Mount Karuulm diary",
    "author": "Karuulm",
    "quote": "[The volcano] features a selection of resources I have never encountered. Maybe one of these resources will be the key to our salvation.",
    "template": "citetext"
  },
  {
    "text": "Mount Karuulm diary",
    "author": "Karuulm",
    "quote": "Zorgoth, Kerapac and the others never cared for my ideas.",
    "template": "citetext"
  },
  {
    "text": "Mount Karuulm diary",
    "author": "Karuulm",
    "quote": "[Kerapac] showed no interest in [the drakes], preferring to focus on his dragons instead.",
    "template": "citetext"
  },
  {
    "text": "Mount Karuulm diary",
    "author": "Karuulm",
    "quote": "The hydra project has stalled. While the enhanced creation showed promise, I have been unable to replicate it. As such, I intend to bring the project to an end.",
    "template": "citetext"
  },
  {
    "text": "Mount Karuulm diary",
    "author": "Karuulm",
    "quote": "I intend to relocate to a mountain to the south. There's a lizard species there that may well be key to my next project.",
    "template": "citetext"
  },
  {
    "npc": "The Great Expedition",
    "quote": "The survey team reports findings of a Mountain to the west of their encampment beyond a swampy area.",
    "template": "citetext"
  },
  {
    "npc": "The Great Expedition",
    "quote": "King Shayzien VII has approved the expedition plans. 250 Days to ascend the western mountain and return with details of the findings.",
    "template": "citetext"
  },
  {
    "npc": "Stone tablet (Lizardman Temple)",
    "quote": "A strange mist surrounded the mountain this week... Was this his doing? His work on the mountain must be progressing.",
    "template": "citetext"
  },
  {
    "npc": "Stone tablet (Lizardman Temple)",
    "quote": "The days following showed a drastic change in the flora around the mountain, the lush greenery has rotted and the open flatlands have become sodden and impassable.",
    "template": "citetext"
  },
  {
    "text": "The Giant Dwarf",
    "quote": "Five hundred years have passed since the rule of King Alvis, saviour of Keldagrim, victim of his own intentions. He founded the Consortium: the gathering of mining companies that were to serve the monarchy. But eventually the monarchy came to serve the Consortium. By the time of his death, the monarchy was all but abolished.Now the Kings in Keldagrim are but a distant memory, with only the statue of King Alvis to remind the people of the old days. The dark days.",
    "notes": "(opening cutscene)",
    "name": "cutscene",
    "template": "citetext"
  },
  {
    "text": "Forgettable_Tale...#Room_4",
    "list": [
      "Red Axe Employee Records"
    ],
    "quote": "It was here that he got his nickname, the Butcher of Barendir, as he mercilessly killed the trolls even as they retreated in defeat. Here, also, he got his distinctive scar running across his forehead in a hand-to-hand battle with a particularly ferocious troll.",
    "template": "citetext"
  },
  {
    "text": "Herman's book",
    "page": "4",
    "quote": "The older dwarves living near Keldagrim remember a youth of that name travelling through their mines at that time. They claim that he gave them great assistance in defending the mines from a rogue tribe of trolls, eventually driving the trolls out of those mines completely.",
    "template": "citetext"
  },
  {
    "text": "Scabaras' capture",
    "quote": "The last of her race, Kephri is a dawn scarab - one of an extremely long-lived and intelligent race of beetles. The rest of her kind were wiped out during the great war with the Ruinous Powers, but Kephri escaped death thanks to Scabaras himself.",
    "template": "citetext"
  },
  {
    "text": "Scabaras' capture",
    "quote": "Over the years, Kephri dedicated herself to Scabaras, living a content life of isolation.",
    "template": "citetext"
  },
  {
    "text": "Scabaras' capture",
    "quote": "However, no being is infallible, and her isolation soon began to take its toll. Fearing for the end of her race, Kephri longed for children to pass on her knowledge.",
    "template": "citetext"
  },
  {
    "text": "Scabaras' capture",
    "quote": "The Devourer learnt of her desires and a pact was soon made. In return for her help, the Devourer would revive her race, making Kephri children even smarter than herself.",
    "template": "citetext"
  },
  {
    "text": "Scabaras' capture",
    "quote": "By warping another race of scarabs, the Devourer granted Kephri her children as promised, but they had no more intelligence than a common locust.",
    "template": "citetext"
  },
  {
    "text": "Scabaras' capture",
    "quote": "However, the Devourer had promised children even smarter than Kephri herself, and that was a vow she intended to keep. She bound Kephri and destroyed her mind, leaving nothing more than a husk.",
    "template": "citetext"
  },
  {
    "text": "Scabaras' capture",
    "quote": "In her final moments of consciousness, Kephri called out to Scabaras, but by the time he arrived, it was too late. The plan had worked perfectly, and thanks to Kephri, The Devourer had captured her first lesser deity.",
    "template": "citetext"
  },
  {
    "text": "Glough's Journal",
    "author": "Glough",
    "loc": "The Grand Tree",
    "page": "2-3",
    "quote": "Today I heard of three more gnomes slain by Khazard's human troops for fun, I can't control my anger! ... We are small and at heart not warriors but something must be done! We will pick up arms and go forth into the human world! We will defend ourselves and we will pursue justice for all gnomes who fell at the hands of humans!",
    "template": "citetext"
  },
  {
    "text": "Glough's Journal",
    "loc": "The Grand Tree",
    "author": "Glough",
    "page": "1-2",
    "quote": "However, rather than the great liberation promised to us by King Healthorg at the end of the last age, we have been forced to live in hiding up trees or in the gnome maze, laughed at and mocked by man. Living in constant fear of human aggression, we are in a no better situation now than when we lived in the caves!",
    "template": "citetext"
  },
  {
    "text": "Shayzia military orders",
    "quote": "... all five of the leaders had agreed to the plan to depose the gluttonous King Agata IV.",
    "template": "citetext"
  },
  {
    "text": "Kharedst's memoirs",
    "quote": "If it pleases you, my dear child, would you record our future outings? When I'm old and my mind is fading I'd like to reminisce all the times we've spent together around this fine Kingdom of mine. Heed the lessons of our time together and reflect, for someday you will be Queen over this great land.",
    "template": "citetext"
  },
  {
    "text": "Kharedst's memoirs",
    "author": "Rose",
    "quote": "Being royalty, it's good practise to dress down and be somewhat anonymous as Father believes it's a good lesson in understanding the residents, for both the good traits and the bad.",
    "template": "citetext"
  },
  {
    "text": "Kharedst's memoirs",
    "author": "Rose",
    "quote": "At this morning's breakfast he revealed to me what he'd been hiding in the form of a birthday present. It's beautiful! A locket of pale gold shaped like a rose that contains a wonderful painting of mother opposite a dark purple crystal.",
    "template": "citetext"
  },
  {
    "text": "Kharedst's memoirs",
    "author": "Rose",
    "quote": "He assured me [the locket is] certainly at least several centuries old in between quick sips from a peculiar ornate flask with an 'X' imprinted on the side. I suppose he picked that up yesterday from the tinker as well.",
    "template": "citetext"
  },
  {
    "text": "Grand Museum",
    "quote": "This statue depicts King Maximus, the creator of the Fortis Colosseum. In the early days of the kingdom, criminals were sacrified to Ralos in a temple atop the Fortis Cliffs. However, King Maximus ordered the destruction of this temple (...) In place of the temple, King Maximus had the Fortis Colosseum built, with it remaining there to this day.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum",
    "quote": "The kingdom of Asgarnia grew rapidly. King Raddallin, who was one of the tribal leaders of the area, had united many of the smaller tribes and settlements.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Roald Remanis.",
    "template": "citetext"
  },
  {
    "text": "Certificate (Shield of Arrav)",
    "quote": "I recommend to his majesty, King Roald III, that the bearer is rewarded as per Proclimation 252 of the year 143 in the 5th age, by King Roald II.",
    "template": "citetext"
  },
  {
    "text": "Book (Shield of Arrav)",
    "quote": "As a result, the current ruler, King Roald, put a 1200 gold bounty (a massive sum of money in those days) on the return of the shield.",
    "template": "citetext"
  },
  {
    "text": "Royal accord of twill",
    "quote": "Fourth, that of this day the Royal Lord of our Kingdom whom [sic] is part of the great house of Hosidius, will have ten years in the role of Grand Lord. Upon the expiry of these ten years he will willingly pass the title of Grand Lord to the Royal Lord of our Kingdom whom [sic] is part of the great house of Lovakengj for a period of no more than ten years. And so it shall continue for the Royal Lord of our Kingdom whom [sic] is part of the great house of Shayzien, then for the Royal Lord of our Kingdom whom [sic] is part of the great house of Piscarilius and finally for the Royal Lord of our Kingdom whom [sic] is part of the great house of Arceuus. Henceforth this is known as the Right of Succession to the Office of Grand Lord.",
    "template": "citetext"
  },
  {
    "text": "A Shayzien State",
    "quote": "Signed, King Shayzien III, 1,048 - 13",
    "notes": "The dating convention in Great Kourend lists the number of days followed by the number of decades that have passed since the adoption of the Royal Accord of Twill; assuming that Lord Shayzien had taken on the title of Grand Lord at the onset of the 13th decade, his push for absolute power would have taken place some 1048 days into his rule.",
    "template": "citetext"
  },
  {
    "text": "The Times of Lathas",
    "quote": "You skim over the heavy book, it talks about the heritage of the line of Kings who carry the name Ardignas. They only came into power 68 years ago, but in which time there have been six kings, the current being King Thoros.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#Display cases 3",
    "list": [
      "Varrock Museum display No. 47"
    ],
    "quote": "5th Age - yr 136\nKing Ulthas of Ardougne dies from an accidental arrow shot while out on a hunting expedition. Ardougne is left to his 2 sons, Tyras and Lathas who decide to split the city between them.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Launa Talvoy.",
    "template": "citetext"
  },
  {
    "text": "Manual",
    "loc": "Horror from the Deep",
    "quote": "Lightomatic - the brand you can sometimes trust.",
    "template": "citetext"
  },
  {
    "text": "Manual",
    "loc": "Horror from the Deep",
    "quote": "Lightomatic Deluxe 500 Maintenance, Upkeep and Users' Manual... Thank you for purchasing the Lightomatic Deluxe lighthouse lighting equipment.",
    "template": "citetext"
  },
  {
    "text": "Manual",
    "loc": "Horror from the Deep",
    "quote": "NOTE: By reading our advertisement in the Varrock Herald, you will invalidate your warranty.",
    "template": "citetext"
  },
  {
    "text": "Diary (Shades of Mort'ton)",
    "quote": "I've been out with my assistant Liornish Stemplehair, she's an able assistant, but preoccupied with her family life. How will she become a respected scholar in her own right?",
    "page": "5",
    "template": "citetext"
  },
  {
    "text": "Royal Accord of Twill",
    "quote": "...of this day one member from the Royal Lords of our Kingdom whom are part of the great houses of Hosidius, Lovakengj, Shayzien, Piscarilius and Arceuus shall be chosen to be the Grand Lord of Kourend for a period of no more than ten years...",
    "template": "citetext"
  },
  {
    "text": "Royal Accord of Twill",
    "quote": "...of this day one member from the Royal Lords of our Kingdom whom are part of the great houses of Hosidius, Lovakengj, Shayzien, Piscarilius and Arceuus shall be chosen to be the Grand Lord of Kourend for a period of no more than ten years...",
    "template": "citetext"
  },
  {
    "text": "Royal Accord of Twill",
    "quote": "Ethrain Hosidius, Seabry Shayzien, Ret Piscarilius, Solange Lovakengj and Bourath Arceuus all Royal Lords of our Kingdom.",
    "template": "citetext"
  },
  {
    "text": "Royal Accord of Twill",
    "quote": "...of this day one member from the Royal Lords of our Kingdom whom are part of the great houses of Hosidius, Lovakengj, Shayzien, Piscarilius and Arceuus shall be chosen to be the Grand Lord of Kourend for a period of no more than ten years...",
    "template": "citetext"
  },
  {
    "text": "Royal Accord of Twill",
    "quote": "...of this day one member from the Royal Lords of our Kingdom whom are part of the great houses of Hosidius, Lovakengj, Shayzien, Piscarilius and Arceuus shall be chosen to be the Grand Lord of Kourend for a period of no more than ten years...",
    "template": "citetext"
  },
  {
    "text": "Royal Accord of Twill",
    "quote": "...of this day one member from the Royal Lords of our Kingdom whom are part of the great houses of Hosidius, Lovakengj, Shayzien, Piscarilius and Arceuus shall be chosen to be the Grand Lord of Kourend for a period of no more than ten years...",
    "template": "citetext"
  },
  {
    "text": "Royal Accord of Twill",
    "quote": "...of this day one member from the Royal Lords of our Kingdom whom are part of the great houses of Hosidius, Lovakengj, Shayzien, Piscarilius and Arceuus shall be chosen to be the Grand Lord of Kourend for a period of no more than ten years...",
    "template": "citetext"
  },
  {
    "text": "Royal Accord of Twill",
    "quote": "...of this day one member from the Royal Lords of our Kingdom whom are part of the great houses of Hosidius, Lovakengj, Shayzien, Piscarilius and Arceuus shall be chosen to be the Grand Lord of Kourend for a period of no more than ten years...",
    "template": "citetext"
  },
  {
    "text": "Royal Accord of Twill",
    "quote": "...of this day one member from the Royal Lords of our Kingdom whom are part of the great houses of Hosidius, Lovakengj, Shayzien, Piscarilius and Arceuus shall be chosen to be the Grand Lord of Kourend for a period of no more than ten years...",
    "template": "citetext"
  },
  {
    "text": "Royal Accord of Twill",
    "quote": "...of this day one member from the Royal Lords of our Kingdom whom are part of the great houses of Hosidius, Lovakengj, Shayzien, Piscarilius and Arceuus shall be chosen to be the Grand Lord of Kourend for a period of no more than ten years...",
    "template": "citetext"
  },
  {
    "text": "Royal Accord of Twill",
    "quote": "...of this day one member from the Royal Lords of our Kingdom whom are part of the great houses of Hosidius, Lovakengj, Shayzien, Piscarilius and Arceuus shall be chosen to be the Grand Lord of Kourend for a period of no more than ten years...",
    "template": "citetext"
  },
  {
    "text": "Royal Accord of Twill",
    "quote": "...of this day one member from the Royal Lords of our Kingdom whom are part of the great houses of Hosidius, Lovakengj, Shayzien, Piscarilius and Arceuus shall be chosen to be the Grand Lord of Kourend for a period of no more than ten years...",
    "template": "citetext"
  },
  {
    "text": "Royal Accord of Twill",
    "quote": "...of this day one member from the Royal Lords of our Kingdom whom are part of the great houses of Hosidius, Lovakengj, Shayzien, Piscarilius and Arceuus shall be chosen to be the Grand Lord of Kourend for a period of no more than ten years...",
    "template": "citetext"
  },
  {
    "text": "Grand Museum",
    "quote": "Cloak of Ranul - It is said that the cloak on display here was crafted during the first Teok Xiki, more commonly known as the Gathering. The Gathering is the process used by both the Church of Ralos and the Sect of Ranul to select a new Teokan after the death of the previous one.",
    "template": "citetext"
  },
  {
    "text": "A taste of hope (book)",
    "author": "Lowerniel Drakan",
    "quote": "As the head of the newly formed House Drakan, I drank in the Stranger from Afar's lessons more eagerly than my peers. Before the concept of laws were passed on to our newborn aristocracy, I seized an opportunity to co-opt my neighbouring houses by draining their leaders of blood. These smaller houses fell under my leadership, and the House of Drakan became the prevailing power on Vampyrium.",
    "template": "citetext"
  },
  {
    "text": "A taste of hope (book)",
    "author": "Lowerniel Drakan",
    "quote": "The arrival of the Stranger from Afar [Zaros] brought an end to the tribal system, with him forming the tribes into the early houses of Vampyrium. He introduced to us alien cultural concepts such as society and art.",
    "template": "citetext"
  },
  {
    "text": "The turncloak",
    "author": "Phosani",
    "quote": "Where's our god now? The king has been taken and so the queen has no choice. She'll surrender the capital causing the fighting to stop, and the killing to begin. Those who resist will be enslaved, especially the pious - they taste the best, or so I've heard. I'll ask you again, where's our god now?[...]I'll make Saradomin rue the day he turned his back on us.",
    "template": "citetext"
  },
  {
    "text": "The turncloak",
    "author": "Phosani",
    "quote": "His-Dark-Self accepted our offering! My sisters and I have been tasked with clearing out the hamlets and leading the cattle right into the heart of his vampyre host. Our armour is black and our cloth crimson, but they still know a Justiciar when they see one and they know it would be heresy to defy me. A small hermitage to the north east of the capital is our next target, while our master moves further south.",
    "template": "citetext"
  },
  {
    "text": "The shadow realm",
    "quote": "Lord Drakan has tasked me with learning more about the shadow realm. To aid in this task, I've been given a dark beast. The natural connection this creature has with the shadows should make the task far easier.[...]Success! The creature has managed to connect to the other side, and early telepathic intrusions show that they've made contact.",
    "template": "citetext"
  },
  {
    "text": "The shadow realm",
    "quote": "I will travel with the creature and ask this mysterious being about the secrets of the shadow realm. Lord Drakan will be most impressed with my findings. I can already taste the blood prize and it is delicious.",
    "template": "citetext"
  },
  {
    "text": "The wild hunt",
    "author": "Lowerniel Drakan",
    "quote": "Before the Stranger from Afar domesticated us, our people were hunters unlike any others. No creature on Vampyrium could match our strength or our cunning. No creature, except one. The yarasa. The yarasa were our true equals. Strong, fast, and unpredictable. They made for the ultimate hunt.",
    "template": "citetext"
  },
  {
    "text": "The wild hunt",
    "author": "Lowerniel Drakan",
    "quote": "But with unity under the eight tribes came a power we had never before experienced. We massacred the yarasa with ease, their strength no match for our superior numbers. I have many regrets, but none more so than the events of that day. It was no hunt, just a joyless slaughter.",
    "template": "citetext"
  },
  {
    "text": "The wild hunt",
    "author": "Lowerniel Drakan",
    "quote": "However, there was one that managed to defy us right up to the day we left Vampyrium. Xarpus, the last King of the yarasa. The yarasa were a formidable foe, but compared to Xarpus, they were no foe at all. He is the apex predator of Vampyrium and he is my target.[...]I had no doubt that he would have survived all these years.[...]At long last, I will face a true foe again. At long last, I will feel the joy of the hunt.[...]However, if I should fall, let it be known that I am finally free again.",
    "template": "citetext"
  },
  {
    "text": "Arena book",
    "page": "2-3",
    "quote": "It soon became evident just how dangerous this was, with a great many tragic accidents occurring due to inexperienced wizards. Wizards and victims alike were calling for something to be done, but it was only due to a tragic accident involving one of the leaders of that time that the training arena was constructed.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Display case 5"
    ],
    "quote": "The invading Fremennik had a number of sympathisers within the kingdom of Misthalin ... they destroyed the Mage Training Arena.",
    "template": "citetext"
  },
  {
    "text": "Arena book",
    "page": "3",
    "quote": "There were many warriors of melee and ranged combat that took offence to this new art of magic, and taking matters into their own hands, they destroyed the arena.",
    "template": "citetext"
  },
  {
    "text": "Arena book",
    "page": "4",
    "quote": "a collection of Wizards took it upon themselves to resurrect the building along with all Guardians of Magic that were destroyed with it. These Guardians were created out of the very same essence as runestones, embodying the magic power and authority needed to oversee the arena.",
    "template": "citetext"
  },
  {
    "text": "Letter (The Queen of Thieves)",
    "list": [
      "Letter"
    ],
    "author": "Sophia Hughes",
    "quote": "Child of Yama, I have left the items you requested at the usual drop-off, courtesy of the Kourend Treasury. It goes without saying, but I trust you will make our master aware of who is funding his return. Regards, Sophia Hughes",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Sani Semiv.",
    "template": "citetext"
  },
  {
    "text": "Big book of bangs",
    "author": "Mel Achy",
    "quote": "In my travels, I have witnessed many explosive creations. One of particular note, is fire oil. Used in the far east, fire oil has an incredible explosive capability. However, it also sticks to anything it touches.",
    "template": "citetext"
  },
  {
    "text": "The Sleeping Seven",
    "quote": "Though many men did slow its passage to what is now called Varrock, none did manage to halt its progress proper",
    "page": "4",
    "template": "citetext"
  },
  {
    "text": "The Sleeping Seven",
    "quote": "This collection of priestly valour did cast Saradomin's blessings upon the untrained and fearful fighters of Varrock and those of her outside villagers.",
    "page": "6",
    "template": "citetext"
  },
  {
    "text": "The Sleeping Seven",
    "quote": "the rabble of the Misthalin defence started to bite and the tide of evil from Morytania became smashed and torn on their pikes and staves.",
    "page": "6-7",
    "template": "citetext"
  },
  {
    "text": "The Sleeping Seven",
    "quote": "The fighting became fiercest at Silvarea and they stood side by side to prevent the evil from entering Misthalin again.",
    "page": "13",
    "template": "citetext"
  },
  {
    "text": "The Sleeping Seven",
    "quote": "As the priestly brothers and sisters fought on, some of them cast blessings into the Salve and sealed in it the vengeful power of Saradomin who would act as Misthalin's guardian against 'his-dark- self'.",
    "page": "14",
    "template": "citetext"
  },
  {
    "text": "The Sleeping Seven",
    "quote": "The temple stands even now as a contentious reminder to those evil minions who would seek to wreak havoc in the land of Saradomin.",
    "page": "14",
    "template": "citetext"
  },
  {
    "text": "Crumbling tome",
    "quote": "they were first seen when the legions of evil were pressing their hardest into civilised lands.",
    "page": "1",
    "template": "citetext"
  },
  {
    "text": "Crumbling tome",
    "quote": "For years these brothers fought hard against the enemy",
    "page": "3",
    "template": "citetext"
  },
  {
    "text": "Crumbling tome",
    "quote": "The most disturbing thing was how his presence started to affect the brothers, they became distracted and on occasion even received injuries that required attention.",
    "page": "6",
    "template": "citetext"
  },
  {
    "text": "Crumbling tome",
    "quote": "It was deep in the heart of the enemies' territory, in the failing light of dusk, that the enemy struck back.",
    "page": "6-7",
    "template": "citetext"
  },
  {
    "text": "Crumbling tome",
    "quote": "As if on cue all the six brothers sighed one last breath and died",
    "page": "9",
    "template": "citetext"
  },
  {
    "text": "Crumbling tome",
    "quote": "On the last day the assembled troops buried the brothers inside their stone tombs, then with great reverence, but little ceremony, they covered the tombs with earth.",
    "page": "12",
    "template": "citetext"
  },
  {
    "text": "Crumbling tome",
    "quote": "the army broke camp and turned to march back to their lands",
    "template": "citetext"
  },
  {
    "text": "Crumbling tome",
    "quote": "Not many of the original army made it back to these lands, many more had perished on the journey home",
    "page": "13",
    "template": "citetext"
  },
  {
    "text": "Goblin symbol book",
    "page": "10",
    "template": "citetext"
  },
  {
    "text": "Neilan's journal",
    "quote": "I may have taken a little trip to the library last night. [...] I managed to make off with a few of their restricted tomes without them even knowing.",
    "page": "3",
    "template": "citetext"
  },
  {
    "text": "Neilan's journal",
    "quote": "The cities are too busy for my little experiment, so I've found somewhere a bit quieter. A nice cave off the beaten track.",
    "page": "4",
    "template": "citetext"
  },
  {
    "text": "Neilan's journal",
    "quote": "It took days of trying, but I've managed to fully reanimate the body of a rat.",
    "page": "5",
    "template": "citetext"
  },
  {
    "text": "Neilan's journal",
    "quote": "On my way to the cave this morning I went past the body of a bear. [...] If I can get it to the cave, it will make for a great new test subject.",
    "page": "6",
    "template": "citetext"
  },
  {
    "text": "The Great Expedition",
    "quote": "Having completed three expeditions to the Northern Tundras in recent years, [Magnus Rimor] is the bravest soldier and most seasoned explorer we have.",
    "template": "citetext"
  },
  {
    "text": "The Great Expedition",
    "quote": "[Thomas Berlin] was the first officer to sail from Port Piscarilius to the Frozen Tundra of the North and live to tell the tale.",
    "name": "tomberlin",
    "template": "citetext"
  },
  {
    "text": "Wintertodt parable",
    "quote": "[The Winter Beast] proceeded to devour the animals upon the farm and freezing the next year's crops.",
    "template": "citetext"
  },
  {
    "text": "Winter's End",
    "quote": "May we finally defeat the Beast after five decades of terror?",
    "template": "citetext"
  },
  {
    "text": "Kasonde's journal",
    "quote": "...the kingdom [Varlamore] is littered with ruins from this ancient race.",
    "template": "citetext"
  },
  {
    "text": "Kasonde's journal",
    "quote": "...this [lizardmen] architecture bears more than a few similarities to the Old One ruins found in Varlamore. While there are no known Old One ruins in Kourend or Kebos, the lizardmen must have adopted this architectural style from somewhere.",
    "template": "citetext"
  },
  {
    "text": "Tatty page",
    "quote": "The most exciting of my discoveries is the fact that these ruins belonged to a previously unknown race. Also of interest is the fact that the extinction of this race seems to have been fairly recent.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#2nd_floor3rd_floor_Display_cases",
    "list": [
      "Display case 24"
    ],
    "quote": "The open nature of the Order of Wizards ended in disaster in the 70th year of the 5th Age. Zamorakian members of the order betrayed them and burnt down the Wizards' Tower.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#2nd_floor3rd_floor_Display_cases",
    "list": [
      "Display case 24"
    ],
    "quote": "The tower was rebuilt, but the location of the Rune Essence Mine used by the order was lost.",
    "template": "citetext"
  },
  {
    "text": "Winter's End",
    "quote": "Dinh has constructed the doors to the prison from various metal compounds including Lovakite but they must be reinforced with Bruma bark and enchanted by the Order.",
    "template": "citetext"
  },
  {
    "text": "The living statues",
    "quote": "Ecstatic with his creation, Snaarldor gave a big speech about the glory of the Big High War God and the such, as if he expected some lumps of carved rock to understand a single thing",
    "template": "citetext"
  },
  {
    "text": "Scroll (Making History)",
    "quote": "Timeline of the Ardougne Outpost: Start of Fifth age: Outpost built + 65 Years: 'The Dreaded Years of Tragedy' + 68 Years: 'The Great Battle'",
    "notes": "The Great Battle occurred in the year 98. Therefore, the Outpost was likely built in the year 30.",
    "template": "citetext"
  },
  {
    "text": "Old tablet",
    "quote": "With artefact 'Imperium' safely delivered to the east, focus must return to artefact 'Primus'.",
    "template": "citetext"
  },
  {
    "text": "Damp tablet",
    "quote": "Consensus is that while on duty guarding artefact 'Imperium', Legionary Gellius broke protocol and interacted with the artefact. This resulted in Legionary Valgus entering a frenzied state. Four legionaries were killed before Valgus was apprehended. By order of the Praefectus Classis, both Gellius and Valgus were later executed.",
    "loc": "Desert Treasure II",
    "template": "citetext"
  },
  {
    "text": "Damp tablet",
    "quote": "With artefact 'Imperium' safely secured, the Praefectus Classis has given consent for a day of celebration before the return voyage. All are invited to join her in her ancestral home.",
    "loc": "Desert Treasure II",
    "template": "citetext"
  },
  {
    "text": "Old tablet",
    "quote": "By order of the Praefectus Classis, all vessels are to be prepared for battle. With artefact 'Imperium' safely delivered to the east, focus must return to artefact 'Primus'. New intelligence has confirmed its location and it is expected attempts to recover it will be met with heavy resistance from Saradominist forces.",
    "template": "citetext"
  },
  {
    "text": "Slimy tablet",
    "quote": "She [Perseriya] has acquired the means to teleport large numbers of individuals directly into the temple. While the fleet controls the waters above, your soldiers will be tasked with clearing the temple of all resistance.",
    "template": "citetext"
  },
  {
    "text": "Slimy tablet",
    "quote": "Our force has been kept light intentionally to ensure we can surprise the Saradominist forces. However, using the same teleportation method she'll use to give us access to the temple, the Praefectus Classis also has the ability to call in any reinforcements we need.",
    "template": "citetext"
  },
  {
    "text": "Slimy tablet",
    "quote": "The battle is lost and we must withdraw. The attempt to call in reinforcements failed, and the temple has been ripped asunder by a rift of unknown power. The rift is growing rapidly and has already claimed much of the fleet. The Praefectus Classis is lost. Retreat is the only option.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Phillipa DeMarne.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Phingspet Grime.",
    "template": "citetext"
  },
  {
    "text": "The turncloak",
    "quote": "His-Dark-Self accepted our offering! My sisters and I have been tasked with clearing out the hamlets and leading the cattle right into the heart of his host of Vampyres.",
    "template": "citetext"
  },
  {
    "text": "Buried alive",
    "quote": "The elders haven't woken for almost a fortnight and so by the laws set forth by Mother, we must move them deep into the Sanctuary with all their possessions.",
    "template": "citetext"
  },
  {
    "text": "Prifddinas' history",
    "quote": "Seren proceeded to showed them all to a clearing in the forest, where she had already created the Tower of Voices, a place for all elven kind to congregate and the future home of the Assembly of Elders.",
    "template": "citetext"
  },
  {
    "text": "Prifddinas' history",
    "quote": "Seren then provided one special seed for every clan, telling them that each seed should be planted in the center of each clan's segment of the city. The eight clans did this, and found that the seeds grew into great towers. Before long, there were nine crystal towers in the clearing.",
    "template": "citetext"
  },
  {
    "text": "The spurned demon",
    "quote": "After a failed mission to the island of Karamja, Zalcano was held responsible for the treachery of her brother, and was cursed by Zamorak. He gave her a simple task, bring back her brother to answer for his crimes, and the curse would be lifted.",
    "template": "citetext"
  },
  {
    "text": "The spurned demon",
    "quote": "We assumed the demon would be the first of many, but to our surprise, the scouts reported that she seemed to be working alone. Not only that, but she did not seem to be here for us as we first feared.",
    "template": "citetext"
  },
  {
    "text": "The spurned demon",
    "quote": "The [Amlodd] mystics weaved their spells and discovered something fascinating. The demon, she seemed to be under some sort of spell, a curse. From what they could tell, the curse seemed to be slowly turning her entire body to stone.",
    "template": "citetext"
  },
  {
    "text": "The spurned demon",
    "quote": "With the help of the Ithell clan, the Trahaearn artisans built a large prison in the volcanic caverns beneath the city. With Amlodd magic sealing the way in, the prison was more than suitable for trapping the demon. All that was left to do, was capture her... The demon did not take kindly to our attempts to capture her and fought back with all her might. Many fell to her, but in the end we had her trapped beneath the city, ready for the Trahaearn clan to begin their research.",
    "template": "citetext"
  },
  {
    "text": "Eastern discovery",
    "quote": "After centuries of isolated development, after the God Wars, it was decided that the elven domain needed to expand. With their backs to the sea, there was only one way to go, east. After many years of hard work, a pass over the mountains was created.",
    "template": "citetext"
  },
  {
    "text": "Eastern discovery",
    "quote": "King Baxtorian concluded that the safest way to proceed was to draw up non-aggression pacts with the other races of the land. They were the gnomes to the north, the humans to the east and the ogres to the south.",
    "template": "citetext"
  },
  {
    "text": "Eastern discovery",
    "quote": "...the elves approached the ogres and their kin to the south. Unfortunately, without Bandos' guidance which had held these races together for millennia, the nation had fallen into a bloody civil war, making any form of a treaty with each side useless.",
    "template": "citetext"
  },
  {
    "text": "Eastern settlement",
    "quote": "It was decided that as the ogre nation to the south was unstable, the Cadarn clan should be the first to settle the newly acquired land, as they were one of the few clans able to defend themselves.",
    "template": "citetext"
  },
  {
    "text": "Eastern settlement",
    "quote": "After the Cadarn clan had secured the new realm, the other clans, seeing how much wealth was coming over Arandar, were quick to join them.",
    "template": "citetext"
  },
  {
    "text": "Eastern settlement",
    "quote": "New trade agreements were being created with the gnomes and humans. Soon new elven settlements started to be created... Within a few decades of 'The Break Out', the elves had created many thriving settlements and a vast network of roads.",
    "template": "citetext"
  },
  {
    "text": "Gollwyn's final statement",
    "quote": "He [Adwr] sobbed as he recounted the betrayal, the killings, the sacking of the city, the takeover of the Tower of Voices... All of which was on Lord Iorwerth's command.",
    "template": "citetext"
  },
  {
    "text": "The great divide",
    "quote": "For almost two millennia we lived in the eastern realm, then in the year 1930, we lost all contact with our people in Tirannwn. We found that the route over the mountains was impassable and our incantations were unable to penetrate the gates that had been there.",
    "template": "citetext"
  },
  {
    "text": "The great divide",
    "quote": "King Baxtorian called an emergency council... Soon it was decided to send five members of the Cadarn clan through the Well of Voyage, to recover any information that could tell us what was happening.",
    "template": "citetext"
  },
  {
    "text": "The great divide",
    "quote": "After a few weeks, Adwr returned, the only one of the five scouts that made it back.",
    "template": "citetext"
  },
  {
    "text": "The great divide",
    "quote": "We marched on the gates of Prifddinas on the morning of the eighth day, where everything fell apart. I do not know how Lord Iorwerth knew of our plans, but his forces were waiting for us. Baxtorian tried to reason with him, but he would not listen. They destroyed almost half our forces before we called a retreat. A further quarter of us were slain by traps within the forest as we fled, left behind in our haste.",
    "template": "citetext"
  },
  {
    "text": "Imafore's betrayal",
    "quote": "From the floating city of Tempestus to the peak of the Proudspire, he showed them everything that Varlamore had to offer.",
    "template": "citetext"
  },
  {
    "text": "Smelly journal",
    "quote": "Jardor has turned to drinking in the ocean, he says it'll bring him closer to the gods... for who he's referring to I do not know. The snakestone lies.",
    "template": "citetext"
  },
  {
    "text": "Tome of the sun",
    "quote": "The world was nothing and began when Ralos came into being. With a burst of glorious energy which provides us with heat, light and from this, life.",
    "template": "citetext"
  },
  {
    "text": "Tome of the moon",
    "quote": "From the dark of the night, with the absence of light, Ranul came into being.",
    "template": "citetext"
  },
  {
    "text": "Tome of the moon",
    "quote": "After life begins, the only other significant event is death, however death should not be feared, instead it should be both embraced and respected.",
    "template": "citetext"
  },
  {
    "text": "Tome of the moon",
    "quote": "Ranul teaches us that we must explore and uncover the mysteries of the world. To present the knowledge that we find to others but only as we see fit as we should not reveal secrets that would cause harm to others.",
    "template": "citetext"
  },
  {
    "text": "Tome of the temple",
    "quote": "I tried to warn them against meeting with the dark wizard but they wouldn't listen! I can already feel it, we've been corrupted and my friends are becoming more fanatical and straying further from Ranul, corrupting his teachings and trying to force premature death onto others. I can feel it too, part of me is slipping away slowly... Ranul, please forgive me.",
    "template": "citetext"
  },
  {
    "text": "rsw:Transcript:RuneScape Lore Marathon - from RuneFest 2017#Raurgs",
    "list": [
      "RuneScape Lore Marathon",
      "Mod Chaose",
      "Runefest 2017"
    ],
    "author": "rsw:Mod Chaose",
    "loc": "rsw:Runefest 2017",
    "quote": "These guys are support roles, so these are your scouts, these are your pre-emptive assassins, and your messengers. . . . They're lanky, thin, they're built for speed, they can camouflage well . . . These guys have a hunched posture, they're kind of almost quadrupeds, so they'd be running along on four legs, just be so fast, get in there, get out, do their job.",
    "template": "citetext"
  },
  {
    "text": "Eathram & rada extract",
    "quote": "Unto him was said, 'you are a man, a man of hope, a man of truth and innocence' and he was emboldened in his mission beforest.",
    "template": "citetext"
  },
  {
    "text": "Rada's census",
    "notes": "The names of the Lords can be found at the heading of each subsection. The title 'mst.' is likely an abbreviation of either 'master' or 'magister', both of which are honorifics usually accorded to the heir of a certain noble title.",
    "template": "citetext"
  },
  {
    "text": "Eathram & rada extract",
    "quote": "First was Lord Pecule then Eathram, then the Elders Draben and Ferral and the young Svelgn.",
    "template": "citetext"
  },
  {
    "text": "Eathram & rada extract",
    "quote": "The world dids't pass from Horatio to Eathram, yet still wisdom did not prevail.",
    "template": "citetext"
  },
  {
    "text": "Eathram & rada extract",
    "quote": "Through oppression Eathram stood up and, arm'd in naught but leather and steel, did he steal back the people.",
    "notes": "The fact that Eathram wore \"naught but leather and steel\", which is repeated twice in the text, might also hint at his lower-class background: the soberness of a utilitarian military dress denotes him as a man of the people, in contrast to the luxurious textiles of the upper gentry.",
    "template": "citetext"
  },
  {
    "text": "Eathram & rada extract",
    "quote": "'Wither now thee go, my lord?' was he asked, to which he replied, 'my future is ordained and my path has been shown unto me.'",
    "template": "citetext"
  },
  {
    "text": "Timeline",
    "quote": "King Rada III: 7th BA - 6th BA.",
    "template": "citetext"
  },
  {
    "text": "Eathram & rada extract",
    "template": "citetext"
  },
  {
    "text": "Winter's End",
    "quote": "May we finally defeat the beast after five decades of terror? (...) Lord Lovakengj has officially declared that today is the day of Winter's End. 2,548 - 7.",
    "template": "citetext"
  },
  {
    "text": "Eathram & rada extract",
    "quote": "Ahead of 4 phalanx of spears and 100 knights did Eathram enter Kourend unopposed.",
    "template": "citetext"
  },
  {
    "text": "Eathram & rada extract",
    "quote": "The hope for his people and the fear for his enemies carried before him.",
    "template": "citetext"
  },
  {
    "text": "Eathram & rada extract",
    "quote": "Such force showed his might so much that the King could do naught but turn his sword upon his self.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Reldo Trimmly.",
    "template": "citetext"
  },
  {
    "text": "Ablenkian's escape",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Romeo Gontamue.",
    "template": "citetext"
  },
  {
    "text": "Kharedst's memoirs",
    "quote": "If it pleases you, my dear child, would you record our future outings? When I'm old and my mind is fading I'd like to reminisce all the times we've spent together around this fine Kingdom of mine. Heed the lessons of our time together and reflect, for someday you will be Queen over this great land.",
    "template": "citetext"
  },
  {
    "text": "Kharedst's memoirs",
    "author": "Rose",
    "quote": "Being royalty, it's good practise to dress down and be somewhat anonymous as Father believes it's a good lesson in understanding the residents, for both the good traits and the bad.",
    "template": "citetext"
  },
  {
    "text": "Kharedst's memoirs",
    "author": "Rose",
    "quote": "At this morning's breakfast he revealed to me what he'd been hiding in the form of a birthday present. It's beautiful! A locket of pale gold shaped like a rose that contains a wonderful painting of mother opposite a dark purple crystal.",
    "template": "citetext"
  },
  {
    "text": "Kharedst's memoirs",
    "author": "Rose",
    "quote": "He assured me [the locket is] certainly at least several centuries old in between quick sips from a peculiar ornate flask with an 'X' imprinted on the side. I suppose he picked that up yesterday from the tinker as well.",
    "template": "citetext"
  },
  {
    "text": "Hosidius letter",
    "quote": "Only yesterday did I meet with the lords of the other houses and we agreed in principle that all houses would offer half their land so we may farm more.",
    "template": "citetext"
  },
  {
    "text": "Hosidius letter",
    "quote": "My most venerable Council, I beseech you to grant my request as mentioned in previous meetings at your chamber.",
    "template": "citetext"
  },
  {
    "text": "Hosidius letter",
    "quote": "Within six months we can have enough food to halt this famine.",
    "template": "citetext"
  },
  {
    "text": "Hosidius letter",
    "quote": "I understand the most venerable Council's concern of the political implications of such a move, however the political security of this great kingdom will not matter if it is unable to feed itself.",
    "template": "citetext"
  },
  {
    "text": "Twill accord",
    "list": [
      "Know that before the Council of Elders, for the health of our soul and those of our ancestors and heirs, and the better ordering of our kingdom, at the advice of Ethrain Hosidius, Seabry Shayzien, Ret Piscarilius, Solange Lovakengj and Bourath Arceuus all Royal Lords of our Kingdom."
    ],
    "template": "citetext"
  },
  {
    "text": "Display case 2",
    "quote": "The Fremennik mountain tribe has always been opposed to the manufacture of runes, as they feel this should be the work of the gods.",
    "name": "manufacture",
    "template": "citetext"
  },
  {
    "text": "Display case 2",
    "quote": "A group of the more warmongering of the mountain tribe broke away, led by a warrior called Gunnar, and went on a rampage across northern Kandarin and Asgarnia to put a stop to this 'runecrafting'.",
    "template": "citetext"
  },
  {
    "text": "Moonclan manual",
    "quote": "As we all know, from the tales told to us in the Secret Tongue, 'magic' was first discovered in these lands by V--- when he accidentally stumbled upon the Stone of J--.",
    "template": "citetext"
  },
  {
    "text": "Moonclan manual",
    "quote": "the stone was instantly removed by those powers who walk a higher Astral Path than ourselves",
    "template": "citetext"
  },
  {
    "text": "Moonclan manual",
    "quote": "he [V---] did discover something of great importance in the caves where first he found the stone; the very rocks that had surrounded it had been subtly changed by its presence. The rocks in their contact with the Stone of J-- had gained a yearning to be something they were not.",
    "template": "citetext"
  },
  {
    "text": "Moonclan manual",
    "quote": "...V--- discovered that by focussing thought upon them he could transform them entirely for short periods of time into the very elements of the universe.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Display case 21"
    ],
    "quote": "In the first years of the 5th Age, human mages discovered the secrets of making runes from rune essence.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Display case 21"
    ],
    "quote": "The mages who discovered rune essence ... set up a great tower of wizardry in southern Misthalin.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Display case 11"
    ],
    "quote": "It soon became evident just how dangerous this was, with a great many tragic accidents occurring due to inexperienced wizards. Wizards and victims alike called for something to be done, but it was only due to a tragic accident involving one of the leaders of that time that the Mage Training Arena was constructed, established with all skill levels in mind.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Display case 21"
    ],
    "quote": "Due to the power of these runes, humans started to become dominant within the world, with the human kingdoms of Misthalin and Asgarnia quickly growing to become the ones we know today.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Display case 7"
    ],
    "quote": "Using the power of runes, Saradominist humans in Kandarin, led by the Carnillean family, became confident and decided to take on the evil influences resident in the area around what is now know as Ardougne. Of particular note was an evil lord by the name of Hazeel, so they stormed his home and defeated the Zamorakins inside. The following morning, the Carnillean forefathers moved into the empty household and claimed it as their own. From this base the Carnilleans began to build the city of Ardougne.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Display case 2"
    ],
    "quote": "A group of the more warmongering of the mountain tribe broke away, led by a warrior called Gunnar, and went on a rampage across northern Kandarin and Asgarnia to put a stop to this 'runecrafting'.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Display case 5"
    ],
    "quote": "The invading Fremennik had a number of sympathisers within the kingdom of Misthalin ... they destroyed the Mage Training Arena.",
    "template": "citetext"
  },
  {
    "text": "Arena book",
    "page": "3",
    "quote": "There were many warriors of melee and ranged combat that took offence to this new art of magic, and taking matters into their own hands, they destroyed the arena.",
    "template": "citetext"
  },
  {
    "text": "Arena book",
    "page": "4",
    "quote": "a collection of Wizards took it upon themselves to resurrect the building along with all Guardians of Magic that were destroyed with it. These Guardians were created out of the very same essence as runestones, embodying the magic power and authority needed to oversee the arena.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Display case 2"
    ],
    "quote": "They had been given many fire and nature runes by the White Knights of Falador to help with their smithing by use of the Superheat Item spell.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Display case 2"
    ],
    "quote": "The invading Fremennik were not happy about all the spellcasting and launched many attacks, reducing the Imcando to near extinction.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Display case 1"
    ],
    "quote": "The barbarian invaders were running out of steam. They were pretty much forced to make peace or be wiped out, so they agreed to settle down peacefully and make a village on the Misthalin/Asgarnia border, thinking that they could lie low, well-positioned to build up strength and resume their campaign later.",
    "template": "citetext"
  },
  {
    "text": "Moonclan manual",
    "quote": "As we all know, from the tales told to us in the Secret Tongue, 'magic' was first discovered in these lands by V--- when he accidentally stumbled upon the Stone of J--.",
    "template": "citetext"
  },
  {
    "text": "Moonclan manual",
    "quote": "he [V---] did discover something of great importance in the caves where first he found the stone; the very rocks that had surrounded it had been subtly changed by its presence. The rocks in their contact with the Stone of J-- had gained a yearning to be something they were not.",
    "template": "citetext"
  },
  {
    "text": "Moonclan manual",
    "quote": "...V--- discovered that by focussing thought upon them he could transform them entirely for short periods of time into the very elements of the universe.",
    "template": "citetext"
  },
  {
    "text": "Moonclan manual",
    "quote": "Our Fremennik forefathers believe 'magic' to be a possession of the gods, and that our use of it risks far more than any benefits it may bring;",
    "template": "citetext"
  },
  {
    "text": "Moonclan manual",
    "quote": "We [the Moon Clan] of course take the more enlightened view that we should use all tools at our disposal for our own betterment.",
    "template": "citetext"
  },
  {
    "text": "Varrock_Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Varrock Museum, display 16"
    ],
    "quote": "The world of Gielinor is said to have been created by the gods Saradomin, Zamorak and Guthix at the start of the 1st Age.",
    "template": "citetext"
  },
  {
    "text": "Varrock_Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Varrock Museum, display 16 (after Curse of the Empty Lord)"
    ],
    "quote": "However, recent evidence from a brave adventurer suggests that Zamorak was not a god at this point in time and so would not have been able to create worlds.",
    "template": "citetext"
  },
  {
    "text": "Goblin symbol book",
    "page": "11",
    "template": "citetext"
  },
  {
    "text": "Arachnids of vampyrium",
    "quote": "When the Stranger from Afar led the vampyres to Gielinor...",
    "loc": "Theatre of Blood",
    "notes": "Stranger from Afar refers to Zaros.",
    "template": "citetext"
  },
  {
    "text": "The wild hunt",
    "author": "Lowerniel Drakan",
    "quote": "Before the Stranger from Afar domesticated us...",
    "loc": "Theatre of Blood",
    "template": "citetext"
  },
  {
    "text": "Eastern discovery",
    "quote": "After centuries of isolated development, after the God Wars, it was decided that the elven domain needed to expand. With their backs to the sea, there was only one way to go, east. After many years of hard work, a pass over the mountains was created.",
    "template": "citetext"
  },
  {
    "text": "Gollwyn's final statement",
    "author": "Gollwyn",
    "quote": "[Adwr had] narrowly escaped with his life, something which could not be said about his companions. He sobbed as he recounted the betrayal, the killings, the sacking of the city, the takeover of the Tower of Voices... All of which was on Lord Iorwerth's command.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Varrock Museum Timeline exhibit, display number 23"
    ],
    "quote": "4th Age - yr 1100-1200. A tide of evil creatures from the east threatened Avarrocka (…). Seven priestly warriors - Iriandul Caistlyn, Sarl Dunegun, Friar Twiblick, Derygull, Ivandis Seergaze, Erysail the Pious and Essiandar Gar - attempted to drive the evil creatures back into what we now know as Morytania.",
    "template": "citetext"
  },
  {
    "text": "The Sleeping Seven",
    "quote": "As the priestly brothers and sisters fought on, some of them cast blessings into the Salve and sealed in it the vengeful power of Saradomin who would act as Misthalin's guardian against 'his-dark- self'.",
    "page": "14",
    "template": "citetext"
  },
  {
    "text": "Tomb (Dragon Slayer II)",
    "quote": "Here lies Camorra Shayzien // Founder of Shayzien House.",
    "template": "citetext"
  },
  {
    "text": "Armed Forces Report",
    "page": "2, 4",
    "quote": "Officers: XII ... Medical Roster: IV ... Total Personnel: CIV",
    "template": "citetext"
  },
  {
    "text": "Armed Forces Report",
    "page": "5",
    "quote": "We must expand our forces substantially in order to face these threats and defend the Kingdom of Great Kourend.",
    "template": "citetext"
  },
  {
    "text": "Armed Forces Report",
    "page": "6",
    "quote": "We must invest in officer class training in order to maintain obedience throughout the ranks.",
    "template": "citetext"
  },
  {
    "text": "Armed Forces Report",
    "page": "6",
    "quote": "Furthermore, we live in a time were magical discoveries are made every day, and the threat of a magical based attack increases with each discovery. Standard forces are not prepared to battle such a threat. We must invest in defence against these dark arts.",
    "template": "citetext"
  },
  {
    "text": "Armed Forces Report",
    "page": "8",
    "quote": "The armed forces shall separate into three regiments: - Elder Warriors - Twisted Archers - Kodai Mages",
    "template": "citetext"
  },
  {
    "text": "Armed Forces Report",
    "page": "8",
    "quote": "Each regiment will consist of two hundred personnel under the command of a General, with each General reporting to myself.",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "page": "14-15",
    "quote": "Sgt Mattin refused to follow orders pertaining to the acquisition and delivery of civilians to the chambers of His Lordship, Xeric, on the day of 3,470 - 37",
    "template": "citetext"
  },
  {
    "text": "Chronicles of Xeric",
    "page": "15",
    "quote": "Sgt Mattin pleads guilty to the charge of Gross Insubordination for which the sentence is execution by twisted archer.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Shilop Fairweather.",
    "template": "citetext"
  },
  {
    "text": "Gollwyn's final statement",
    "author": "Gollwyn",
    "quote": "[Adwr] sobbed as he recounted the betrayal, the killings, the sacking of the city, the takeover of the Tower of Voices... All of which was on Lord Iorwerth's command.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#Display cases 3",
    "list": [
      "Display case 26"
    ],
    "name": "case",
    "quote": "5th Age - Year 154: A strange undead necromancer leads an army of undead out of the Wilderness in an attack upon Varrock. Misthalin is strong enough and still has enough runes that the attack is defeated fairly quickly",
    "template": "citetext"
  },
  {
    "text": "Journal (Making History)",
    "author": "Drozal",
    "quote": "I've met a great and powerful follower of Zamorak, whom has offered me the chance to join him and others in the quest for ultimate power and desolation of others. [...] I move into the old outpost north of Ardougne at the end of the week.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#Display cases 3",
    "list": [
      "Varrock Museum, display 33"
    ],
    "quote": "5th Age - yr 162–163. The old king of Asgarnia, King Vallance, falls very ill. The White Knights took advantage of this and began to take control of Falador and Asgarnia for themselves.",
    "name": "display33vallance",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#Display cases 3",
    "list": [
      "Varrock Museum, display 33"
    ],
    "quote": "Year 163, 5th Age - The White Knights declared that the Black knights were no longer to have any political power within Asgarnia. Lord Daquarius of the Kinshra immediately responds by declaring his Black Knights as being at a state of war with Falador. The two sides engaged in a big battle to the north of Falador - however, both sides were fairly evenly matched, and retreated to their fortresses to build up their forces and devise plans to crush the other, once and for all.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Ehntor Prysin.",
    "template": "citetext"
  },
  {
    "text": "Transvergence theory",
    "quote": "I believe the power of the Dark Altar allows the energy needed to change essence into runes to seep through to this dimension.",
    "template": "citetext"
  },
  {
    "text": "Soul journey",
    "author": "Aretha",
    "quote": "We therefore owe a debt of gratitude to the Dark Altar, for it is the Dark Altar's power that creates and maintains Kourend's soul altar, drawing energy to this realm from the unknown plane where the true Soul Altar resides.",
    "template": "citetext"
  },
  {
    "text": "Melzar's notes",
    "quote": "Had dream last night of great cabbage. Cabbage of Jas. Used by Gods to create all life and magic. all runes have part of its power. so with runes I can control power above magic.",
    "template": "citetext"
  },
  {
    "text": "Moonclan manual",
    "quote": "As we all know, from the tales told to us in the Secret Tongue, 'magic' was first discovered in these lands by V--- when he accidentally stumbled upon the Stone of J--.",
    "template": "citetext"
  },
  {
    "text": "Moonclan manual",
    "quote": "He did discover something of great importance in the caves where first he found the stone; the very rocks that had surrounded it had been subtly changed by its presence. The rocks in their contact with the Stone of J-- had gained a yearning to be something they were not.",
    "template": "citetext"
  },
  {
    "text": "Moonclan manual",
    "quote": "[...] V--- discovered that by focussing thought upon them he could transform them entirely for short periods of time into the very elements of the universe.",
    "template": "citetext"
  },
  {
    "text": "Old tablet",
    "quote": "By order of the Praefectus Classis, all vessels are to be prepared for battle. With artefact 'Imperium' safely delivered to the east, focus must return to artefact 'Primus'. New intelligence has confirmed its location and it is expected attempts to recover it will be met with heavy resistance from Saradominist forces.",
    "template": "citetext"
  },
  {
    "text": "Slimy tablet",
    "quote": "The battle is lost and we must withdraw. The attempt to call in reinforcements failed, and the temple has been ripped asunder by a rift of unknown power. The rift is growing rapidly and has already claimed much of the fleet. The Praefectus Classis is lost. Retreat is the only option.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Straven Enroy.",
    "template": "citetext"
  },
  {
    "text": "Harmony",
    "author": "Aenwyn Iorwerth",
    "quote": "Apart from the Cywir, Seren had managed to convince all the other clan leaders to join her in the new world.",
    "template": "citetext"
  },
  {
    "text": "Transcript:A Kingdom United",
    "quote": "On any ordinary day, the Grand Museum of Civitas illa Fortis would be bustling with visitors hoping to get a glimpse at the rare treasures within – the icon of Ralos, the armour of the Cloud Titan and, of course, the Royal Accord of Twill, finally taking pride of place in the glass cabinet found in the Hall of Kourend's centre.",
    "template": "citetext"
  },
  {
    "text": "Atlax's diary",
    "quote": "Perhaps the temple lived up to the stories before the battle, but now there's just a big hole in the wall, some strange symbols on the floor that kind of freak me out and a whole lot of rubble. According to Pharana, the Justiciar of the Lion wants no time wasted. We start work tomorrow.",
    "template": "citetext"
  },
  {
    "text": "Grand Museum",
    "quote": "Cloak of Ranul - It is said that the cloak on display here was crafted during the first Teok Xiki, more commonly known as the Gathering. The Gathering is the process used by both the Church of Ralos and the Sect of Ranul to select a new Teokan after the death of the previous one.",
    "template": "citetext"
  },
  {
    "text": "Meeting notes",
    "quote": "Thus, it seemed appropriate that, instead of choosing a company at random, the human would decide. Thus the Black Bug was suggested.",
    "template": "citetext"
  },
  {
    "quote": "Let it be known that we, the ever faithful servants of the Empty Lord, have bound this vault in his name. Here, his mighty treasures will be forever safe from the soulless betrayers, and all others who would dare oppose the might of the Empire.",
    "loc": "Desert Treasure II",
    "template": "citetext"
  },
  {
    "text": "Drozal's Journal",
    "quote": "We have been told to 'beware for your days are numbered' by the people of Ardougne. It seems the city has asked for some external help, which will be upon us some time soon. I'm sure we will eliminate such a threat though.",
    "page": "8",
    "template": "citetext"
  },
  {
    "text": "The History of the Outpost",
    "quote": "The Zamorakians' only purpose seemed to be the disruption of the nearby city of Ardougne, over the years now known as the 'The Dreaded Years of Tragedy'.",
    "page": "4",
    "template": "citetext"
  },
  {
    "text": "The History of the Outpost",
    "quote": "The battle produced two survivors - the two ex- friends, both being the most powerful mages.",
    "page": "7",
    "template": "citetext"
  },
  {
    "text": "The History of the Outpost",
    "quote": "Settling for the neutral god Guthix, the two went about their ways to spread equality among the people. One of the friends became king, to listen to people's views and ensure a fair and equal life for everyone, whilst the other friend founded the market place, allowing people to trade their skills and wares under equal rights and opportunities.",
    "page": "8",
    "template": "citetext"
  },
  {
    "text": "Slimy tablet",
    "quote": "She [Perseriya] has acquired the means to teleport large numbers of individuals directly into the temple. While the fleet controls the waters above, your soldiers will be tasked with clearing the temple of all resistance.",
    "template": "citetext"
  },
  {
    "text": "Slimy tablet",
    "quote": "The battle is lost and we must withdraw. The attempt to call in reinforcements failed, and the temple has been ripped asunder by a rift of unknown power. The rift is growing rapidly and has already claimed much of the fleet. The Praefectus Classis is lost. Retreat is the only option.",
    "template": "citetext"
  },
  {
    "text": "Elixir of Everlasting",
    "quote": "The formulae is complete! The elders of the Sisterhood have been imbibing the elixir for a full year now and the results have been marvellous.",
    "template": "citetext"
  },
  {
    "text": "Buried alive",
    "quote": "The elders haven't woken for almost a fortnight and so by the laws set forth by Mother, we must move them deep into the Sanctuary with all their possessions.",
    "template": "citetext"
  },
  {
    "text": "Stone tablet (The Garden of Death)",
    "quote": "Transfer method success. Body success. Soul vessel success. Time arrived. Death poison needed. Death create life.",
    "loc": "The Garden of Death",
    "template": "citetext"
  },
  {
    "text": "Stone tablet (The Garden of Death)",
    "quote": "Death poison fail. Plant create dark death. Send home. Home destroyed. No life. Soul vessel fail. Zema-Tal destroyed.",
    "loc": "The Garden of Death",
    "template": "citetext"
  },
  {
    "text": "Tatty page",
    "quote": "He claims the target to be a danger to the Empire who cannot be allowed to live, but it's hard to ignore the role the Carnifex Maximus' pride may be playing. After all, this is the first time anyone has escaped his axe.",
    "loc": "Desert Treasure II - The Fallen Empire",
    "template": "citetext"
  },
  {
    "text": "Tatty page",
    "quote": "[The venators] have found some isolated woods on the far side of this new landmass, hidden behind some mountains. We will not be disturbed there. The Carnifex Maximus has ordered a camp be constructed at once. [...] The camp is complete and the venators have been dispatched to locate the dwarves.",
    "loc": "Desert Treasure II - The Fallen Empire",
    "template": "citetext"
  },
  {
    "text": "Tatty page",
    "quote": "They attempted something. It's not clear what exactly, but whatever it was, it didn't go well. To learn more, I've collected a sample from the ritual site to investigate.",
    "loc": "Desert Treasure II - The Fallen Empire",
    "template": "citetext"
  },
  {
    "text": "Tatty page",
    "quote": "It seems my eagerness may have come at a cost. The sample I collected from the ritual site was carrying some sort of parasite, and of course, it was the Carnifex Maximus himself who ended up getting infected. He showed little interest in my work, right until I told him it had the potential to kill. That got his attention right away.",
    "loc": "Desert Treasure II - The Fallen Empire",
    "template": "citetext"
  },
  {
    "text": "Tatty page",
    "quote": "They attacked! The dwarves must have tracked the venators, for they found our camp with ease. Most of our party is dead or injured, but the worst is what happened to the Carnifex Maximus. They took his head clean off! He's a vampyre! It shouldn't have been possible, but they did it all the same! The parasite must be to blame.",
    "loc": "Desert Treasure II - The Fallen Empire",
    "template": "citetext"
  },
  {
    "text": "Tatty page",
    "quote": "Of all things, he thought he saw the Carnifex Maximus' body move!",
    "loc": "Desert Treasure II - The Fallen Empire",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Thessalia Nitter.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Gryff Aldock.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Treznor Withings.",
    "template": "citetext"
  },
  {
    "text": "The wardens",
    "quote": "In war, great weapons can turn the tide against even the strongest foes, and legend has long spoken of Tumeken using a powerful staff to build two such weapons.",
    "template": "citetext"
  },
  {
    "text": "The wardens",
    "quote": "In truth, referring to Tumeken's creations as 'weapons' does them no justice. They are in fact two ancient automatons, built to embody Tumeken and Elidinis themselves and seemingly imbued with their divine essence.",
    "template": "citetext"
  },
  {
    "text": "The wardens",
    "quote": "It was believed any truth to these legends had long since been lost, but here in Osmumten's tomb, the truth is revealed: the weapons exist, and they are the prize the Devourer so fervently seeks.",
    "template": "citetext"
  },
  {
    "text": "Akila's journal",
    "quote": "After we gave her a way in, the true horror of her plans became clear. I had never set eyes on the four lesser deities, but I knew them when I saw them. She had them all. She took them into the tomb, along with a selection of ghastly beasts.",
    "template": "citetext"
  },
  {
    "text": "Incriminating letter",
    "quote": "The Teokan will soon travel to the east and you will be selected to accompany him. You must ensure he never returns. Only with his demise can Twilight's Promise begin. Only with his demise will we see the Final Dawn.",
    "template": "citetext"
  },
  {
    "text": "Moonclan Manual",
    "quote": "As we all know, from the tales told to us in the Secret Tongue, 'magic' was first discovered in these lands by V--- when he accidentally stumbled upon the Stone of J--.",
    "template": "citetext"
  },
  {
    "text": "Tatty page",
    "quote": "He claims the target to be a danger to the Empire who cannot be allowed to live, but it's hard to ignore the role the Carnifex Maximus' pride may be playing. After all, this is the first time anyone has escaped his axe.",
    "template": "citetext"
  },
  {
    "text": "Tatty page",
    "quote": "The timing couldn't be worse, for the venators have also located the dwarves.",
    "template": "citetext"
  },
  {
    "text": "Tatty page",
    "quote": "It seems my eagerness may have come at a cost. The sample I collected from the ritual site was carrying some sort of parasite, and of course, it was the Carnifex Maximus himself who ended up getting infected.",
    "template": "citetext"
  },
  {
    "text": "Tatty page",
    "quote": "They took his head clean off! He's a vampyre! It shouldn't have been possible, but they did it all the same! The parasite must be to blame.",
    "template": "citetext"
  },
  {
    "text": "Tatty page",
    "quote": "They attacked! The dwarves must have tracked the venators, for they found our camp with ease. Most of our party is dead or injured...",
    "template": "citetext"
  },
  {
    "text": "Tatty page",
    "quote": "The parasite must be to blame. It's far more dangerous than we thought, and I fear others may be infected as well. Many have claimed to be feeling strangely unwell, and one of the legionaries even started having visions. Of all things, he thought he saw the Carnifex Maximus' body move!",
    "template": "citetext"
  },
  {
    "text": "Kasonde's journal",
    "quote": "Find your way into the southern Kingdom of Varlamore, and you'll be presented with a huge range of interpretations. Not too surprising when you consider that the kingdom is littered with ruins from this ancient race.",
    "template": "citetext"
  },
  {
    "text": "Tatty page",
    "quote": "The most exciting of my discoveries is the fact that these ruins belonged to a previously unknown race. Also of interest is the fact that the extinction of this race seems to have been fairly recent.",
    "template": "citetext"
  },
  {
    "text": "Grand Museum",
    "quote": "100 years after the founding of Fortis, it was decreed that a second settlement be built to address issues caused by the fast growing population.",
    "template": "citetext"
  },
  {
    "text": "Grand Museum",
    "quote": "At the time, the islands of Tempest Bay were not considered a strong contender due to the unstable ground and the presence of a band of hill giants.",
    "template": "citetext"
  },
  {
    "text": "Bloody diary",
    "quote": "In my travels throughout the Shining Kingdom, I have bested many mighty creatures. From the Colossal Wyrm of the Avium Savannah to the Cloud Titan of Tempestus, I am proud to proclaim myself as a master slayer.",
    "template": "citetext"
  },
  {
    "text": "Bloody diary",
    "quote": "I have received news back home from a dear friend that the War of the Five Houses has ended, and I believe it is about time I return to Kourend. The war started from some petty squabble between the lords and ladies of the five Houses, and I do not regret leaving at all. My expertise lies in killing monsters, not my fellow man.",
    "template": "citetext"
  },
  {
    "text": "Bloody diary",
    "quote": "I recall encountering a particularly nasty demon capable of summoning torrential rainstorms in the Avium Savannah.",
    "template": "citetext"
  },
  {
    "text": "Bloody diary",
    "quote": "Being requested by a group of dwarves underground to quell the demon's rage, they forged me a silver sword combined with some mystical metal, which they claimed was carefully tuned to greatly harm demons.",
    "template": "citetext"
  },
  {
    "text": "Bloody diary",
    "quote": "Using this silver sword, I slayed the demon with ease, but not before its blood permanently stained my sword black.",
    "template": "citetext"
  },
  {
    "text": "Grand Museum",
    "quote": "Despite the Cloud Titan being defeated around 900 years ago, the armour was not found until roughly 700 years later when it was donated to the museum by a traveller.",
    "template": "citetext"
  },
  {
    "text": "Grand Museum",
    "quote": "The traveller claimed to have slain the Cloud Titan himself, with the giant having survived its original defeat. However, experts consider this unlikely.",
    "template": "citetext"
  },
  {
    "text": "Grand Museum",
    "quote": "The wyrm is believed to have originated from deep within the Hailstorm Mountains, but for unknown reasons, it travelled to the Avium Savannah around 200 years ago.",
    "template": "citetext"
  },
  {
    "text": "Grand Museum",
    "quote": "The wyrm terrorised the region for many moons before warriors from across the kingdom finally banded together to defeat it.",
    "template": "citetext"
  },
  {
    "text": "Imafore's betrayal",
    "quote": "To this day, no one knows exactly why Imafore murdered them. It's a secret he took to his grave...",
    "template": "citetext"
  },
  {
    "text": "Grand Museum",
    "quote": "The war went on to last six years and ended at the Battle of the Proudspire when Varlamorian freedom fighters led by Imafore's own cousin captured him. Imafore was executed soon after, with his cousin, Mezpah Arkan, taking the throne.",
    "template": "citetext"
  },
  {
    "text": "Varlamore envoy",
    "quote": "In the hope of repairing the relationship with Varlamore, King Kharedst III ordered an envoy be sent to the Shining Kingdom. However, the envoy is not all that was sent. Despite the protests of many, the King insisted that the Accord be taken with the envoy to Varlamore to be displayed in the Grand Museum of Civitas illa Fortis.",
    "template": "citetext"
  },
  {
    "text": "Varlamore envoy",
    "quote": "...the war with Varlamore remains fresh in the minds of Kourend's people. The betrayal of Emperor Imafore is hard to forget and it is likely this mistrust will continue for numerous lifetimes.",
    "template": "citetext"
  },
  {
    "text": "Shayzia military orders",
    "quote": "... all five of the leaders had agreed to the plan to depose the gluttonous King Agata IV.",
    "template": "citetext"
  },
  {
    "text": "Shayzia military orders",
    "quote": "It is with a heavy heart I must inform you of a great tragedy to befall our house. Lord Shayzien is dead. Murdered by a cowardly alliance between Lord Lovakengj and Lady Piscarilius.",
    "template": "citetext"
  },
  {
    "text": "Shayzia military orders",
    "quote": "The Lovakengj alliance with Lady Piscarilius was thankfully short lived, and there has been significant fighting between the two armies.",
    "template": "citetext"
  },
  {
    "text": "Shayzia military orders",
    "quote": "Meanwhile, Lady Hosidius has already rallied her forces as well, though it is unclear where her allegiances lie at this point.",
    "template": "citetext"
  },
  {
    "text": "Shayzia military orders",
    "quote": "Lord Arceuus has returned to Arceuus and reinforced the city. It seems he has no desire to participate in this conflict, but I suspect he will soon be given no choice.",
    "template": "citetext"
  },
  {
    "text": "Bloody diary",
    "quote": "The war started from some petty squabble between the lords and ladies of the five Houses, and I do not regret leaving at all.",
    "template": "citetext"
  },
  {
    "text": "Rose's note",
    "quote": "Find a great ruin that has withered and died. A seat of power, lost in a war of pride.",
    "template": "citetext"
  },
  {
    "text": "Varrock Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Varrock Museum, display 4"
    ],
    "quote": "Another group known as the White Knights had also proven to be particularly competent in battle and were now helping him by being the main military force defending his capital city of Falador.",
    "template": "citetext"
  },
  {
    "text": "Varrock_Museum#2nd_floor3rd_floor",
    "list": [
      "Varrock Museum, display 33"
    ],
    "quote": "5th Age - yr 162-163. The old king of Asgarnia, King Vallance, falls very ill. The White Knights took advantage of this and began to take control of Falador and Asgarnia for themselves.",
    "template": "citetext"
  },
  {
    "text": "Varrock_Museum#2nd_floor3rd_floor",
    "list": [
      "Varrock Museum, display 33"
    ],
    "quote": "Year 163, 5th Age. The White Knights declared that the Black knights were no longer to have any political power within Asgarnia. Lord Daquarius of the Kinshra immediately responds by declaring his Black Knights as being at a state of war with Falador. The two sides engaged in a big battle to the north of Falador - however, both sides were fairly evenly matched, and retreated to their fortresses to build up their forces and devise plans to crush the other, once and for all.",
    "template": "citetext"
  },
  {
    "author": "Kardia",
    "text": "History of iban",
    "quote": "Iban was a Black Knight who had learned to fight under the great Daquarius, Lord of the Black Knights. Together, they had taken on the might of the White and the blood of a hundred soldiers had been wiped from the sword of Iban.",
    "template": "citetext"
  },
  {
    "author": "Kardia",
    "text": "History of iban",
    "quote": "Meeting his demise in the White Knights' now famous Dawn Ascent, Iban died with the bitter taste of failure in his mouth.",
    "template": "citetext"
  },
  {
    "text": "Varrock Census",
    "quote": "[Citizen's name] Wilough Fairweather.",
    "template": "citetext"
  },
  {
    "author": "Herman Caranos",
    "text": "Herman's book",
    "quote": "One tribe, now disbanded, used to tell of a strange mystical warrior named 'Deesus'- surely a corruption of 'Dionysius'-who helped defend their camp from the monsters that roam the northern lands.",
    "template": "citetext"
  },
  {
    "text": "Imafore's betrayal",
    "quote": "The Kingdom of Varlamore was formed in a very similar way to Kourend, by those fleeing the Age of Strife.",
    "template": "citetext"
  },
  {
    "text": "Tekton's journal",
    "author": "Tekton",
    "quote": "Tekton built Master a new temple on mountain top. Tekton's temple could focus cave magic, bring it out of caves so anyone could use it without needing to be as clever as Tekton. Master used Tekton's temple to wield cave magic. It made Master very happy.",
    "template": "citetext"
  },
  {
    "text": "Tekton's journal",
    "author": "Tekton",
    "quote": "But Master not so happy when everyone else started wielding cave magic too, especially nasty high priest.",
    "template": "citetext"
  },
  {
    "text": "Tekton's journal",
    "author": "Tekton",
    "quote": "Master told Tekton to shut down temple. Master wanted Tekton to find new ways to wield cave magic, but so only Master could do it. Tekton broke temple like Master said - but only slightly, so Tekton can fix it again if Master ever changes his mind.",
    "template": "citetext"
  },
  {
    "text": "Tekton's journal",
    "author": "Tekton",
    "quote": "Tekton tried to teach Master how to wield cave magic without needing temple, but Master couldn't do it. Maybe Master didn't understand crystals as well as Tekton did. Master not so happy about that.",
    "template": "citetext"
  },
  {
    "text": "Tekton's journal",
    "author": "Tekton",
    "quote": "Master created new body for Tekton out of rock and metal from caves, and transferred Tekton's soul into it. Tekton's old body disintegrated, but that okay now Tekton was living in shiny new body that Master made.",
    "template": "citetext"
  },
  {
    "text": "Tekton's journal",
    "author": "Tekton",
    "quote": "Master enchanted Tekton's anvil, and brought it into cave, and taught Tekton to use it to fix the new body whenever it get damaged. Master may not understand crystals as well as Tekton, but Master still very powerful.",
    "template": "citetext"
  },
  {
    "text": "Stone tablet (Lizardman Temple)",
    "quote": "A strange mist surrounded the mountain this week... Was this his doing? His work on the mountain must be progressing.",
    "template": "citetext"
  },
  {
    "text": "Houndmaster's diary",
    "quote": "It had to be her though, of course it did. She was the strongest of the pack, my personal favourite, now a twisted, scaly abomination.",
    "template": "citetext"
  },
  {
    "text": "Houndmaster's diary",
    "quote": "Before Master began his wretched experiments, we failed to notice her... condition. There's two of them now.",
    "template": "citetext"
  },
  {
    "text": "Stone tablet (Lizardman Temple)",
    "quote": "Our subservience is being tested. We continue to drink the tonic, but Master, what is it doing to us? Everyone seems to have developed a horrible skin rash, were these side-effects known of? No! I I hear him now. This is progress. Temple complete. To the mountain? Of course Master. We'll come to you. Scaly and strong.",
    "template": "citetext"
  },
  {
    "text": "Vanguard judgement",
    "quote": "[The Vanguard] had heard of our new settlement on Mount Quidamortem, and had come to re-pledge their allegiance to our Lord.",
    "template": "citetext"
  },
  {
    "text": "Vanguard judgement",
    "quote": "...he welcomed the Vanguard, letting them approach his presence - an honour granted only to his most trusted servants. He bade us deck them in fine clothes and set out a feast in their honour, as though they were his long-lost kin rather than traitors who had failed him.",
    "template": "citetext"
  },
  {
    "text": "Vanguard judgement",
    "quote": "Lord Xeric waved a hand in a curious gesture, and I felt a magical wave emanating from the crystals of the chamber. Writhing on the ground, the Vanguard began to melt and re-form into new shapes.",
    "template": "citetext"
  },
  {
    "text": "Vanguard judgement",
    "quote": "Lord Xeric bade me record all that I had seen of the Judgement of the Vanguard. My record is to stand as a testimonial to his wrath and his vengeance. I have written it down faithfully.",
    "template": "citetext"
  },
  {
    "text": "Transdimensional notes",
    "quote": "In the caverns beneath Quidamortem, our lord sensed a disruption in the fabric of reality.",
    "template": "citetext"
  },
  {
    "text": "Transdimensional notes",
    "quote": "Our lord managed, with much effort, to widen the disruption until a stable portal stood before us, allowing us to see out of this world and into some other realm.",
    "template": "citetext"
  },
  {
    "text": "Transdimensional notes",
    "quote": "In our awe, we looked for too long, forgetting that a door opens in two directions. We could see these creatures, and they could see us.",
    "template": "citetext"
  },
  {
    "text": "Transdimensional notes",
    "quote": "We sought to drive it back with our magicks, but it seemed well protected from such attacks, and eventually our lord bade us retreat.",
    "template": "citetext"
  },
  {
    "text": "Nistirio's manifesto",
    "quote": "I am the god, and I need no priests. There is no need for a guide or conduit, not when my power is manifest. If Xeric will not recognise me as his lord and master, away with him!",
    "template": "citetext"
  },
  {
    "text": "Nistirio's manifesto",
    "quote": "Although the former High Priest had indeed become mighty, Xeric was able to bind him to four great crystals of power, imprisoning his avatar forever in this place.",
    "template": "citetext"
  },
  {
    "text": "Dark journal",
    "quote": "...our lord has led us to victory over the Guardian in the Deep, and has seized the power that he sought.",
    "template": "citetext"
  },
  {
    "text": "Dark journal",
    "quote": "I am truly awestruck by the power that our lord now wields. If we were to return to Kourend, as he originally planned, I have no doubt that we would regain our former dominion over the kingdom with very little effort.",
    "template": "citetext"
  },
  {
    "text": "Goblin symbol book",
    "page": "12",
    "template": "citetext"
  },
  {
    "text": "Abyssal book",
    "quote": "Thanks to the portals, the Abyss has become a runecrafting gold mine, especially when combined with the pouches detailed previously. However, as also noted, lack of access to the lost Rune Essence Mine is preventing us from utilising the Abyss to its full potential.",
    "template": "citetext"
  },
  {
    "text": "Abyssal book",
    "quote": "One recent development of concern in this area is the sudden increase in rune production from the Order of Wizards. Could it be that they have found a way to the Rune Essence Mine themselves?",
    "template": "citetext"
  },
  {
    "text": "Abyssal book",
    "quote": "While originally only intended as a way for us to access the Abyss, the portal spell soon proved to have some very beneficial side effects. It has also allowed us to open portals to most of the runic altars found across Gielinor.",
    "template": "citetext"
  },
  {
    "text": "Arachnids of vampyrium",
    "quote": "When the Stranger from Afar led the vampyres to Gielinor...",
    "loc": "Theatre of Blood",
    "notes": "Stranger from Afar refers to Zaros.",
    "name": "Arachnids",
    "template": "citetext"
  },
  {
    "text": "The wild hunt",
    "author": "Lowerniel Drakan",
    "quote": "Before the Stranger from Afar domesticated us...",
    "loc": "Theatre of Blood",
    "template": "citetext"
  },
  {
    "text": "A taste of hope (book)",
    "author": "Lowerniel Drakan",
    "quote": "The arrival of the Stranger from Afar brought an end to the tribal system, with him forming the tribes into the early houses of Vampyrium. He introduced to us alien cultural concepts such as society and art.",
    "loc": "Sins of the Father",
    "template": "citetext"
  },
  {
    "text": "A taste of hope (book)",
    "author": "Lowerniel Drakan",
    "quote": "I drank in the Stranger from Afar's lessons more eagerly than my peers. Before the concept of laws were passed on to our newborn aristocracy",
    "loc": "Sins of the Father",
    "template": "citetext"
  },
  {
    "text": "Prifddinas' history",
    "author": "Unknown",
    "quote": "It is told that the first elves to come through the World Gate found a world full of beautiful woodlands and terrible beasts.",
    "notes": "The Elves arrived in the First Age into an unscathed world",
    "template": "citetext"
  },
  {
    "text": "Ablenkian's Escape",
    "author": "Ablenkian",
    "quote": "Now I flee into the deep forests of Forinthry. Perhaps I can find shelter in one of the older temples, the forgotten shrines.",
    "name": "Ablenkian",
    "template": "citetext"
  },
  {
    "author": "Varrock_Museum#1st_floor2nd_floor_Display_cases",
    "list": [
      "Varrock Museum Display number 31"
    ],
    "quote": "The scorched earth of the Wilderness is a lasting reminder of the destruction wrought during the God Wars.",
    "notes": "Wilderness is barren and desolate due to scorching.",
    "template": "citetext"
  },
  {
    "text": "The sleeping seven",
    "quote": "Eight centuries and a score into the history of our land there came a darkness which fell about the land once called Hallowvale. The queen of that sad time, an iycene of once formidable power, became to be deposed by 'his-dark-self' and his hordes…",
    "template": "citetext"
  },
  {
    "text": "Bloody notes",
    "author": "Otrava",
    "quote": "On my travels today I ventured quite far into the Humblethorn forest and came across a strange tree that lived within a dark ruin. (…) I should know but the magic is strange and utilised only by the dark Zarosian warlocks and outlawed for followers of Saradomin.",
    "notes": "Both talk about the same tree, this links them together",
    "name": "Otrava",
    "template": "citetext"
  },
  {
    "text": "Bloody notes",
    "author": "Otrava",
    "quote": "News came today from the north - the tree had predicted the fall of Kharyrll, how could this be?",
    "template": "citetext"
  },
  {
    "text": "Tree wizards' journal",
    "author": "Xazyd Wier",
    "quote": "I fled in the night as the turncloaks breached the fortress and I now find myself held up in a great hollow tree that sits amid an overgrown ruin.",
    "notes": "Both talk about the same tree, this links them together.Turncloaks are betrayers, coming from a Zarosian, this almost definitely refers to Zamorakians.",
    "template": "citetext"
  },
  {
    "text": "Important letter",
    "quote": "However, the door was sealed long ago by the leaders of the four armies.",
    "loc": "The Frozen Door",
    "name": "Seal",
    "template": "citetext"
  },
  {
    "text": "Bloody grimoire",
    "author": "Otrava",
    "quote": "An evil has swept into our lands and we have been called to protect the weak (…) when my belief wasn't waning, when our lands were not beset by the beautiful rot of chaos. (…) embrace the darkness that heals them of their wounds, while the light of Saradomin forbids us of such heinous acts. (…) Amongst the dead I found a version of the Senntisten Scriptures…",
    "notes": "In short: Author Otrava is a follower of Saradomin in this book and in the book Bloody notes as well. In Bloody notes she describes that the Zarosian fortress of Kharyrll succumbs to Zamorakian forces. She then goes on to describe how she finds Senntisten Scriptures on dead Zamorakians, this proofs that they must have plundered Senntisten prior to capturing Kharyrll",
    "template": "citetext"
  },
  {
    "text": "Tree wizards' journal",
    "author": "Xazyd Wier",
    "quote": "I fled in the night as the turncloaks breached the fortress",
    "notes": "Turncloaks are betrayers",
    "name": "Wier",
    "template": "citetext"
  },
  {
    "author": "Varrock_Museum#Ground_floor1st_floor_display_cases",
    "list": [
      "Varrock Museum Display number 44"
    ],
    "quote": "A battered and bent coin with Zamorakian markings. It bears the word 'Senntisten', which we believe to be the original name of the city, Saranthium, before it was rebuilt by those loyal to Saradomin.",
    "template": "citetext"
  },
  {
    "text": "Translation",
    "author": "Terry Balando",
    "quote": "And so it came to pass, that deep in the (fiery/uncomfortable) desert, the gods (argued/decided) amongst themselves that the (fortress/home) would be the (selected/chosen) place that would (imprison/conceal) the (wealth/power).",
    "loc": "Desert Treasure I",
    "template": "citetext"
  },
  {
    "text": "Translation",
    "author": "Terry Balando",
    "quote": "The permanent (exile/journey) of the people ended.",
    "loc": "Desert Treasure I",
    "template": "citetext"
  },
  {
    "text": "Ablenkian's escape",
    "author": "Ablenkian",
    "quote": "By my brothers and sisters and by those who swore to battle by my side. I pledged my service to the Empty Lord and I never wavered, even as I was warned of his downfall.",
    "name": "Dragon rider",
    "template": "citetext"
  },
  {
    "text": "Slimy tablet",
    "quote": "The battle is lost and we must withdraw. The attempt to call in reinforcements failed, and the temple has been ripped asunder by a rift of unknown power. The rift is growing rapidly and has already claimed much of the fleet. The Praefectus Classis is lost. Retreat is the only option.",
    "template": "citetext"
  },
  {
    "text": "Crondis' capture",
    "quote": "Zebak was never the strongest of his kind, or the fastest. However, he may well have been one of the smartest.",
    "template": "citetext"
  },
  {
    "text": "Crondis' capture",
    "quote": "Unable to compare with his rivals in the traditional way, Zebak instead used his ingenuity to lure them into elaborate traps. To begin with, he simply took their food and left them to starve, but over time, his hunger grew. Before long, he started to feast on his victims too.",
    "template": "citetext"
  },
  {
    "text": "Crondis' capture",
    "quote": "In the end, the once weak crocodile had grown to become the strongest. You'd be forgiven for thinking he might have stopped there, but Zebak's hunger knew no end. As he continued to feast, his food supply ran short.",
    "template": "citetext"
  },
  {
    "text": "Crondis' capture",
    "quote": "In return for his service, the Devourer promised Zebak that he would never go hungry again. Blinded by avarice, he willingly agreed. Together, Zebak and the Devourer lured Crondis to her imprisonment.",
    "template": "citetext"
  },
  {
    "text": "Crondis' capture",
    "quote": "However, rather than granting the endless supply of food he craved, the Devourer cursed him. To a being like Zebak, the curse was a fate far worse than death, for it caused every bite of food to turn to dust in his mouth. He longed for death, but the Devourer's curse prevented this as well, binding him to the world of the living.",
    "template": "citetext"
  }
]