[
  {
    "list": [
      "A man came to me with the King's seal. I gave the man Daconia rocks. And Daconia rocks will kill the tree!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Only as flesh becomes ash, \nand wood becomes dust, \n...will Iban's corpse embrace \nnature's eternal lust."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Red is north of Blue. Yellow is south of Purple. Green is north of Purple. Blue is west of Yellow. Purple is east of Red."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I am writing to advise you that our secret preparations to the statue have been completed. All you need to do now is hit it with your boat. Take some gullible human along when you do, the mines are crawling with them these days. The human will surely get the major blame. \n\n After this, the statue is going to be rebuilt in the image of our great director. You need not concern yourself with the how and why, but rest assured you will be compensated greatly.",
      "Regards, Colonel Grimsson of the Red Axe"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Report on Intruder\n\n\nWe found a dwarf wandering in our mines. We weren't sure if he was a spy or simply an explorer, but we couldn't take any risks. We decided to send him back with his memory wiped, rather than put him to use as one of our test subjects. We can't afford having to explain another mysterious disappearance at this point. Additionally, we added something to the spell that would make him hungry for kebabs and thirsty for beer, so that whatever he can remember will be dismissed as the ravings of a drunken fool. Grunsh did a good job, he seems to be fitting in well. Nevertheless, the spell seems to have been a little bit too strong, the subject is unlikely to recover from his condition. His obsession with kebabs is a bit too extreme. Will tell Grunsh to adjust his spell next time."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Red Axe Employee Records\n\n\nHreidmar, director of the Red Axe (employee #1)\n\nInformation classified.\n\nGrimsson, the butcher of Barendir (employee #4297)\n\nGrimsson was once a soldier in the dwarven army and quickly made his way up the ranks, up to colonel. He served with the Black Guard at Ice Mountain and in Kandarin. He was present at the battle of Barendir when he fought against an army of trolls. It was here that he got his nickname, the Butcher of Barendir, as he mercilessly killed the trolls even as they retreated in defeat. Here, also, he got his distinctive scar running across his forehead in a hand-to-hand battle with a particularly ferocious troll. After this battle Grimsson became more and more aggressive, even to his fellow dwarves. Following a particularly vicious attack on a comrade, he was dismissed from the Black Guard. Soon after, he was recruited by the Red Axe. Here he's learned to control his rage and become even stronger. By now, he has become the right hand dwarf of the director. While he holds no official rank, he is still often affectionately referred to as 'The Colonel'.\n\nGrunsh, Ogre Shaman (employee #38262)\n\nFound lost and near death in the ice cold mountains above Keldagrim, Grunsh was nearly mistaken for a troll at first. Taken in by the Red Axe and nursed back to health, it turned out that he was in fact a powerful ogre shaman. Intelligent by ogre standards, and steadfastly loyal to his rescuers, he has taken up a prominent position in the ranks of the Red Axe. This is primarily due to the fact that since dwarves cannot use magic, they must rely on other races as spellcasters. Grunsh fits the bill perfectly."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "\" Why should I, Tolna, be trapped in such a wretched place? Arrghh, It's not fair! Feel my ANGER! \""
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "\" It's so quiet and dark. I FEAR I may never escape this horrid place. Mum, Dad, help me! \""
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "\" Where am I, How long have I been here? Am I still the person I once was? Oh why am I so CONFUSED? \""
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "\" What's the point? No-One will ever help me. I'm not worth anything, will anyone ever combat my HOPELESSNESS? \""
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The Godfather attacked us. We have fled to safety. If you are loyal to her majesty, find us by using the co-ordinates \"AIR\", \"DLR\", \"DJQ\", \"AJS\"."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Deep within the Kharidian Desert, south of Shantay Pass, unrest is growing within the cities of Menaphos and Sophanem. With the threat of the Devourer still lurking in the shadows, the High Priest of Icthlarin has deemed it time to make contact with the citizens of Sophanem who had fled to Menaphos in the face of the recent plague. Thus far his attempts have proved futile, however, as Menaphos remains wary of the contagion and refuses to comply."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Thirty years ago, Crandor was a thriving community with a great tradition of mages and adventurers. Many Crandorians even earned the right to be part of the Champions' Guild! One of their adventurers went too far, however. He descended into the volcano in the centre of Crandor and woke the dragon Elvarg. He must have fought valiantly against the dragon because they say that, to this day, she has a scar down her side, but the dragon still won the fight. She emerged and laid waste to the whole of Crandor with her fire breath! Some refugees managed to escape in fishing boats. They landed on the coast, north of Rimmington, and set up camp but the dragon followed them and burned the camp to the ground. Out of all the people of Crandor there were only three survivors: a trio of wizards who used magic to escape. Their names were Thalzar, Lozar and Melzar."
    ],
    "personquoted": "Guildmaster",
    "template": "cquote2"
  },
  {
    "list": [
      "Back in my father's day, Crandor was an important city-state. Politically, it was as important as Falador or Varrock and its ships traded with every port. But, one day when I was little, all contact was lost. The trading ships and the diplomatic envoys just stopped coming. I remember my father being very scared. He posted lookouts on the roof to warn if the dragon was approaching. All the city rulers were worried that Elvarg would devastate the entire continent."
    ],
    "personquoted": "Duke Horacio",
    "template": "cquote2"
  },
  {
    "list": [
      "The crimson swift is a tropical bird that typically lives in dense jungle areas. Subtlety is not one of this bird's strong points, its striking red plumage ensuring it will be visible wherever it goes, making it a popular first bird for hunters and spotters alike.",
      "William Oddity's Guide to the Avian"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "TokKul is precious to us; why want you to trade it to someone else? Do you not know that TokKul is most sacred? We TzHaar age and harden, and when death takes us naturally we are then solid, unchanging obsidian. The ancients among us are then made into TokKul to ensure that they remain cared for by their descendents.\n\nJalYt-Ket: you would trade the bodies of your ancestors? We do not wish for TokKul to be traded by hands unwatched by TzHaar.",
      "TzHaar-Hur-Lek, Postbag from the Hedge 17"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Sadly the game was not as complete as we wanted and we spent the first few months trying to \"fix\" the game where we could. About a month or so ago we took the decision to stop trying to \"fix it\" as we still wouldn't have the game we wanted and the game certainly did not meet all the objectives and specifications established in the original game design document and therefore it would be better to go back to the founding principles and build the game we always wanted –Andrew is now overseeing the project and working very closely with the team to build, not all was lost as we naturally have developed the game engine substantially over the last few years and the new designs benefits massively from this as well as a ton of experience within the team as to what works and what doesn't. So whilst the content and a lot of the game play will change from what was previously built almost everything else will go straight back into Stellar Dawn.",
      ", 25 October 2009"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "This beautiful bird can be found in hot jungle climates where it expertly catches small insects for food. It is perhaps therefore ironic that it is usually caught for its bright plumage, which can be used in turn to make excellent fly fishing lures.",
      "William Oddity's Guide to the Avian"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What ultimately proved to be the final breaking point for Jagex was when several of the banks that provided the credit card processing services for Jagex started to charge a much higher processing fee due to the excessive number of charge-backs that were happening compared to other internet-based companies. It should be noted that Jagex wasn't necessarily singled out individually, as nearly all on-line gaming companies have had to address this issue to one extent or another. In addition, these banks threatened to completely cut off these financial services, report Jagex to various credit bureaus as a fraudulent enterprise, and issued an ultimatum that Jagex had to get the RWT issue under control. Quite literally, the very existence of Jagex as a company was threatened and had anti-RWT policies and game changes not been enacted, RuneScape as a game would no longer exist either."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "On a more serious note, many of you will be aware of our efforts to stop real-world trading and how some of our recent updates have been part of that. You may have questions about it: What does it mean? How does it affect the game? How big a problem is it? What are the ways of dealing with it? To answer these questions and more, we'll be releasing a very important Development Diary on the subject."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Our belief is that 25 million XP out of 250 million XP is not a lot. If someone is committed enough to get that amount of XP, the 10% extra is not going to make any difference to them. As for the difference between Jagex RWTing and RWT companies doing it is that we do it without negatively impacting on Runescape and use the revenue generated to make Runescape better.\n\nRWT companies create the bots, bot the game at the expense of players and keep the cash.\nEverytime we sell membership we are real-world trading. RuneScape wouldn't exist if we didn't do it.",
      "Mod Mat K"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "We don't want players to be able to buy their way to success in RuneScape. If we let players start doing this, it devalues RuneScape for others. We feel your status in real-life shouldn't affect your ability to be successful in RuneScape."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I am the great Iban, I cannot die."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "An imposter dares desecrate this sacred place! ... Home to the only true child of Zamorak. Join the damned, mortal!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Yes, that's it, fight, fight with all your heart. It's always so much sweeter when they resist us. Come with us. Come and be with us for all eternity."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "\"I'm (very slowly) writing my own Java RPG, and eventually I want to have this oracle type thing up a mountain where you can go, and it will give you a hint on your current quest. Obviously you should make it fairly hard to get to. (i.e put it out of the way, and protect it with some monsters) but it does stop people getting completely and utterly stuck!\"",
      "Andrew Gower"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "We haven't been ruled by a king for many a year... that statue was long overdue for replacement anyway. You're not under arrest, I merely wanted to talk to you. But let me introduce myself. I am Veldaban, son of Dondakan. I am the Commander of the Black Guard in Keldagrim."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "...When the Temple Knights discovered rumours of the ruined temple, they immediately feared the return of some ancient evil and sent a contingent of their strongest warriors to investigate. The knight that lies dying amidst the crumbling masonry is all that remains of that doomed expedition..."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Myriad and beautiful were the creatures and civilisations of the early ages of the world. Gielinor was a work of art, shaped lovingly over the millennia by the creative mind of Guthix. Only the sturdiest races survived the God Wars, and even then only by abandoning their high culture and gearing their societies towards war. Of the more delicate races there is now no trace, and almost no memory. One such race had bodies as fragile as snowflakes, yet they built crystal cities that stood for a thousand years. The wind would whisper through the spires and fill them with sweet harmonies, and the rising sun would shine through the precious gems that studded the towers and create inter plays of light as if rainbows were dancing. Indeed, so marvelous was this light-show that the patterns of light themselves became alive, and great flocks of luminous creatures rode along the gem cast beams, each drawn to its own colour. The creatures you see floating in this chasm are the last sorry remnants of that age. I do not know how they made their way here and survived to this time, but I am grateful for their company.",
      "Juna"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "A man came to me with the King's seal, I gave the man Daconia rocks, and Daconia rocks will kill the tree!",
      "Hazelmere"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "This polar bird, found in the far northern regions, can survive at impressively low temperatures. Although its long tail affords it great manoeuvrability, it is also the cause of a great deal of interest from collectors.",
      "William Oddity's Guide to the Avian"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Two players take turns to draw a rune from a bag, which contains ten runes in total. Each rune has a different value: an air is worth one point, up to a Nature rune which is worth nine points. If a player draws the Death rune then the game is over, and they have lost. A player can choose to hold if they wish and not draw any more runes, but this runs the risk of the other player drawing more runes until they have a greater points total and win.",
      "Robin"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The copper longtail is found in temperate wooded regions and is one of the most common birds in the world. Although its appearance is unremarkable it is a graceful and successful bird that continues to fend well for itself.",
      "William Oddity's Guide to the Avian"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The golden warbler can be easily identified by its hideously annoying song. Although the warbler is prized by hunters for its fine feathers, it is probably caught just as much simply to shut it up.",
      "William Oddity's Guide to the Avian"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "TokKul is precious to us; why want you to trade it to someone else? Do you not know that TokKul is most sacred? We TzHaar age and harden, and when death takes us naturally we are then solid, unchanging obsidian. The ancients among us are then made into TokKul to ensure that they remain cared for by their descendents.\n\nJalYt-Ket: you would trade the bodies of your ancestors? We do not wish for TokKul to be traded by hands unwatched by TzHaar.",
      "TzHaar-Hur-Lek, Postbag from the Hedge 17"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "A battered and bent coin with Zamorakian markings. It bears the word 'Senntisten', which we believe to be the original name of the city, Saranthium, before it was rebuilt by those loyal to Saradomin. Partial numbers on the coin would indicate that it is from the year 3740, presumably from the 3rd Age."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "A coin in very good condition with Saradominist markings. It bears the word 'Saranthium', which we have found to be the name of the city being excavated east of Varrock. The numbers on the coin would indicate that it is from the year 3804, presumably from the 3rd Age as the Godwars were coming to an end."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Two distinct types of pottery have been recovered from the Dig Site, adding evidence to the two settlements on this site. The red clay pottery appears to be much older and occasionally has purple Zarosian symbols, while the Saradominist artefacts are usually of a lighter shade with blue decorations."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Aah RuneFest, seems our worst kept secret so far. We are planning a real world event for the players currently code named RuneFest. I can't give too much away otherwise the team will be beat me with my own shoes But I suppose I can say that I'm really excited about meeting the player(s). As are the rest of the Jagex family. Take care and hopefully see you all soon Irl.",
      "Mark Gerhard"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Runescape nation was the project name for RuneFest. No RuneFest will go international afterwards, the 1st will be in England. Yeah it will go on tour :) I can't say too much about RuneFest though as the will club be [sic] to death with my own shoes if I do :) There will be official coms on RuneFest to follow shortly I'm sure",
      "Mark Gerhard"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Yes Rule :)",
      "Mark Gerhard"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Class 09: Audio recordings; video recordings; audio-visual recordings; pre-recorded publications; downloadable electronic publications; data-carriers for audio and visual and audio-visual recordings; CDs; DVDs.\n\nClass 16: Printed publications; printed matter; books, leaflets, brochures; posters, postcards, stationery.\n\nClass 25: Clothing, footwear, headgear.\n\nClass 41: Entertainment; organising, promotion and production of entertainment and events; organising, production and presentation of shows, staged events, theatrical performances, concerts, live performationces and audience participation events; musical entertainment; live musical entertainment; production, presentation and distribution of sound and video recordings; provision of recreational facilities; arranging and conducting festivals; arranging and conducting competitions; arranging and conducting events relating to computer games and video games and Internet games; information and advisory and consultancy services relating to all of the foregoing.",
      "British Intellectual Property Office"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Hey guys,\n\nI want to take a few moments to apologise to you and explain where, why, how and what next will happen with regards to the new duck NPC in Falador Park.\nFirst off, we think it's important to explain the motives and reasoning behind the decision to add a new NPC to the game outside of poll. The original duck model was built inside the Easter event earlier this year, and as a nice gesture, I decided to move it to Falador park and rename it after a popular streamer as a thank you for their feedback and continued effort to support the game. Initially, this wasn't part of our development plan or schedule and was implemented quickly to have it in-game in time for the removal of Easter.\n\nIn retrospect, it's clear that the decision wasn't in line with our ethos and caused a considerable upset and division within the community, something we definitely did not intend to happen. Furthermore, the handling of the situation in regards to the removal of topics discussing the duck, whether they be positive or negative, was definitely poor.\nAs a result, the NPC has been removed from the game in the update which went live earlier.\n\nLastly, but by no means least, I'd like to take this opportunity to apologise for this incident. It's not within our nature to cause divisions or negative sentiment within our communities and part of what makes us a strong and focussed team is the support, feedback and continued existence of all player driven and controlled communities – Something we have always taken time to engage ourselves with and support.\nTo sum up, what do you think we should do next to ensure the quality and implementation of updates are in line with your expectations and how we can avoid situations like this in future.\n\nMod Reach and the Old School Team.\"",
      "Mod Reach"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Our data science team draw account names from a pre-defined criteria that we supply, this usually include things like game bias, time zone, activity, pillar points, Authentication / Bank PIN equals true and so on. We vary the raw trawl of accounts from time to time to fit our needs, for example we have recently focused on OS game bias from Australian time zones.\n \nOnce we have that list we review each account for reports made about it, display name history and linked accounts to identify rule breaking on undesirable behaviour on alternative accounts. We then do some due diligence checks to see if any of the accounts are linked to cheating communities or have any links or concerns in relation to Community Safety issues. Once we have that list we extract any accounts that log in from countries whose Authorities provide public searchable *** offender records and, where possible, run a sense check against public records. We then run a hijacking check to see if the account user is involved in account phishing or other activity such as name selling or account selling and then finally a check of any payment fraud history. We sometimes do a few further adhoc checks such as removing accounts with a lot of public wi-fi or proxy access.\n \nOnce we have that final list the players can be invited and if they accept the invite they will move into a state where they can't mute anyone and their reports are closely monitored for about 2 months. Once we are happy that the reporting is of a good standard we move the account to a full P Mod status which means they can mute and also that the accounts are then checked weekly for security, activity and mute accuracy.\n  \nHope that helps.",
      "",
      "on Reddit"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "You are free to create as many accounts as you like, and you are welcome to trade between your accounts just as you would with any other player - you can log into two accounts at the same time to do this if you wish. Trading wealth or items between your own accounts is done entirely at your own risk. We advise that you use the trade system we supply to trade between your own accounts. Unusual trade methods like dropping, death or trust trades are particularly risky and we strongly advise against them.\n\nIf any of your accounts obtained items or wealth through rule breaking activity, for example macro use or real-world trading, then all your accounts may be banned.\n\nAlso, multi-logged accounts must not interact with each other to gain an unfair advantage in game play, such as ‘rigging’ the result of a minigame. For example, it is against the rules to have a number of accounts in a minigame all controlled by the same person, in order to try and guarantee the minigame outcome."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "My friend, you were right to send me to investigate the dwarf's drunken claims, for I have discovered a treasure beyond our wildest dreams. The aviansie are alive, and I suspect they still guard the Godsword! Beneath the remnants of the temple a great battle is being fought between followers of Bandos, Armadyl, Saradomin and Zamorak. My command was slaughtered and I am grieviously wounded. YOU MUST PREVENT THE GODSWORD FROM FALLING INTO THE WRONG HANDS! I do not know how I am going to get this message to you, why is that talking skull never around when he's needed? Your comrade, Sir Gerry.",
      "Knight's notes"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "An aged guardian stands by a lever near the Yanille bank. When you talk to her, she lists the boss monsters of various quests that you have completed. You select which one you'd like to fight again. Once you're ready, you pull the lever. You are teleported into a cave that looks exactly like the KBD lair, but instead of the KBD you meet the monster you wished to fight. It's a private cave, so you'd have the monster all to yourself. If you win, you get rewarded with yellow tokens. The aged guardian exchanges these for degradable yellow armour that absorbs monster damage but not PVP damage.",
      "Mod Ash & Mod Nexus, Content Developers"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Ivandis Seergaze of Lumbridge - A deft and well skilled man of unusual appearance, he held a most bizarre control over some powerful minions of Drakan's horde. A rod or staff helped imbue him with such power. Then with the aide of a Guthix serum he would turn the vile entity, often times destroying the creature instantly or reverting it to an original incarnation or worst of all enraging it greatly, much to the chagrin of his holy brothers."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The key issues we had to consider when it came to splashing was that it has always been a part of Old School, however until the random events were removed it was something which wasn't appealing to players. Of course, there are those who think that splashing should remain as it is an easy way to level magic. However, we think that if everyone could get 99 magic easily any future update to the magic skill would be redundant.\n\nWhat we have decided to do is to emulate the effect of random events if you are splashing. So, if you are splashing in an area where you can receive random events and not interacting with the game for a period of time, your account will stop auto-retaliating.",
      "The Old School Team"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Shall I compare thee to a desert's day \nThou art drier and more rough-skinned. Rough sandstorms shake the cacti away And Summer's head defers to Autumn wind. Sometimes too hot, the eye of heaven shines, With Guthix's gold complexion often dimmed; And every fair from fair sometimes declines, By chance or desert's changing course untrimmed. But thine eternal desert shall not fade Nor lose possession of that sand thou owest Nor Zamorak brag thou art in his shades, When in eternal lines to sand thou growest; So long as camels breathe or eyes can see, So long lives this and this gives life to thee.",
      "Al, Shall I compare thee to a Desert's Day"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "This Is Just To Say I have nibbled the cacti that were by the oasis,  and which you were probably saving for lunch.  Forgive me, they were delicious, so crunchy and so cold. ''",
      "Al, This Is Just To Say"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "0000 1 1 0110 111000 10010 10010 1000 00 1 010101 0100 1011 10010 0110 01 0100 100 111 1010 101",
      "@OldpackAvailers"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      ".... - - .--. ---... -..-. -..-. -... .. - .-.-.- .-.. -.-- -..-. .--. .- .-.. -.. --- -.-. -.-"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Asking for someone's bank PIN is just as serious as asking for an account password... Under no circumstances should you tell another player your password, PIN number or any other personal details of your account.",
      "Rule 3 - Password Scamming",
      "Rules of RuneScape"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Over the course of the next four weeks we will be releasing four clues here on the forums. These clues will be solvable in game, allowing you to unlock one piece of a brand new set of cosmetic gear each week!\n\nOnce all four have been released, the information they provide can be combined to create a fifth, incredibly challenging clue. The first player to successfully solve this clue will be forever commemorated in game. All players who are able to complete the clue will also receive the fifth and final piece of equipment to complete the set!",
      "The Old School Team"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Damn, to provide context... there will be some clues put out over social media, somewhat similar to crack the clue but considerably easier.\nBit of a raids teaser basically. Keep an eye on the old school twitter!",
      "Mod Kieren - From the comment of a reddit post revealing the first piece without a hint given."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The 60kB limit was still in place when I wrote \"Sea Shanty 2\", so it was a simple tune like all those early tracks — again, I was going for catchy. It came very quickly to me once I was in the shanty-writing groove. It has remained in the game for well over a decade, and has always enjoyed a degree of notoriety because it's a cheesy earworm. Since Old School RuneScape launched in 2013, we came to realise that the fanbase had re-embraced the track, and it has become a meme. There are plenty of silly videos featuring it, Rick-Rolling, etc. Although it makes me cringe a little, I don't mind it being a humorous song as it has charm. One of my ambitions in life is to write a novelty track and retire from the proceeds. \"Sea Shanty 2\" might be my best effort yet, but sadly I'm not close to retiring...",
      "Ian Taylor"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "'Obey the of your,  and ' - King Kharedst IV"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Lady Verzik cordially invites you to the Theatre of Blood! The greatest collection of powerful beasts are here for your entertainment.\n\nTickets available from June 7th!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "the"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "My dear,\n\nI wish you to know of the intense pleasure I am deriving as I observe your struggles in the Theatre. Your desperation in the face of your foe, coupled with the relief you show when you survive for just a few moments longer - the sight and scent of your travails are delicious. Bravo, you are a most talented performer!\n\nIf circumstances were otherwise, I would dearly love to summon you to my own castle's dungeon, where I could sample your pain in a more intimate setting. But, alas, your life will surely end with this performance, this swan song.\n\nI thus send you some nourishment to prolong my pleasure as I watch you struggle.",
      "Yours until death, 'Anonymous'"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I'm, like, totally bored. My wife has her nose buried in a book, and snaps at me whenever I go near her.\n\nThe Theatre's not my thing, but it beats getting cussed at every time she thinks I'm interrupting her reading, so you may as well have some stuff to keep you fighting for longer.",
      "Amblor"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Meat sack,\n\nYour pitiful attempts to survive Verzik's Theatre are quite laughable. However, you are clearly under the impression that you can survive the challenges ahead, so I hereby enclose some supplies to prolong the agony for you.",
      "Marisa"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Hey human,\n\nI'm not much into the blood sports myself, but my husband's totally obsessed with watching this stuff. As long as he's busy watching you, he won't keep bothering me, so I can get on with this book I'm trying to read.\n\nHere's some supplies to make your fight go on longer.",
      "Cheers, Mervilla"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Peasant,\n\nYou fight well, for a human. I doubt my wife and I will find anyone more diverting to watch in the near future, so we are sending you this package to ensure your fight does not end immediately.",
      "Regards, Rachra + Roida"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Adventurer,\n\nYou've [sic] putting up a good fight there. Have some food to keep yourself going a bit longer.\n\nIf anyone's ever going to beat this Theatre, I'd like to see it be you. But that's not going to happen, obviously - it's far too hard for a human.",
      "Sargrita"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I bet my mate that you'd get a lot further than this, so here's some stuff to make sure you do. Don't tell him, okay?",
      "Trevallyn"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "You rock, human!\n\nHere's something to help you take the fight all the way to Verzik - give Her Freaky Ladyship a wallop from me, if you can!\n\nAnd hey, Ladyship, I bet you've got your goofy orators reading all these messages, but you're never going to know who I am!\n\nlol [sic]",
      "Unknown"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Human,\n\nYour struggle has been most entertaining so far. My wife and I wish to see more of your antics before you perish, so we are sending you some supplies to keep you alive for longer.",
      "Yours faithfully, Vladirog"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "We are most displeased with your performance. Are you even trying?",
      "Message if a player finishes a raid with a score of 0"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "As soon as you touch the coins you hear the grinding sound of bones against stone as you see skeletons and zombies rising up out of the ground. The coins turn to dust in your hands."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "King Roald of Varrock has gratefully agreed to be Patron to my efforts to create a full, true, and accurate history of this world in which we live. I have made a start by opening two new sections available to the public; the official histories page, and the tales from the tavern.\n\nPlease be advised if checking out any manuscripts or documents that they are to be returned on time, and late fees will be deducted at a rate of 2 gold per day. I also ask visitors to keep the noise down in the research areas, or their library card may be revoked.",
      "Reldo"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Late last year [2013] Mod Balance and Mod Infinity made comments about Auto Hot Keys and mousekeys, specifically whether or not they were against the rules. A few RuneScapers weren't satisfied with their response to the situation and so we escalated the issue to our anti-cheating specialists who have confirmed that their statements were correct.\n\nThey have confirmed that:\n\nMousekeys (i.e. the windows accessibility tool) is allowed (it always has been); anything else is third party software and is not. If the team see evidence that a player is using AHK's, super-mousekeys or any other versions of this macroing software then they will take action against them. If a player is using normal mousekeys, they won't. The team are perfectly capable of detecting both and telling the difference between them.\n\nWhen it comes to skilling, mousekeys can potentially give an advantage when it comes to emptying the inventory quickly, however this requires a certain level of skill, though the following section of macroing rule is quite clear in regards to this behaviour:\n\n\"Software that generates input to our game applets. This includes software that automatically moves the mouse pointer or generates mouse clicks or key presses.\"\n\nNow, mousekeys do not generate input as that is done by the user; it doesn't automatically move the mouse pointer to a specified coordinate, it moves it at a steady pace in the direction specified by the key pressed (2,4,6 or 8) and stops doing so when the key is released. It doesn't generate mouse clicks (as that is done by the user pressing 5) and it doesn't generate key presses. Without augmentation or modification (adjusting the inbuilt settings is not augmentation or modification and is fine) mousekeys are not capable of violating the rules against third party software.",
      "Mod MattHe",
      "Clan Leaders Forum"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Similar to the last clue-seeker event, over the course of the next couple of weeks we will be releasing hints to help Crack the Clue. These clues will be solvable in game allowing you to unlock a piece of a brand-new set of cosmetic gear!\n\n\nOnce all clues have been released, the information they provide can be combined to create an especially challenging mystery. The first player to successfully solve it will be forever commemorated in the game. All players who are able to complete the clue will also receive the final piece of equipment to complete the set!",
      "Newspost announcing the event"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Join thousands of players attempting to unearth the hidden treasure scattered across Gielinor. The first person to solve all 5 clues will earn a special in-game reward. Be sure to keep an eye on our social media channels for the weekly clues!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What you needed to do, is you needed to take this probability calculation and put it into the right distribution, which is the Poisson distribution, which, as we all know, is French for fish. Anyway, you'd come out with an RGB code, which was red. And the solution is a red fish. A red herring. And you guys couldn't even get that, and you think you're gonna solve Crack the Clue? I don't think so!",
      "Mod Mat K"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Hmm, syntax wise it's similar to any C-style language, except variable names are prefixed with their type (eg. %varname is an integer). We also lack full array support. Other than that, it'd do pretty much anything you could do in C or Java.",
      "Mod Chris E",
      "Game Engine Q&A"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The flames of Lloigh-enn are an often rumoured, almost mythical, barrier between various dimensions, that require a spell recited most precisely, that is different for each individual who wishes to pass through.\n\nI am surprised a mere mortal has heard of them, let alone encountered them in person;\n\nI had thought them long since extinguished... You have my gratitude adventurer, it is not often the curiousity [sic] of Zamorak is excited.\n\nI will have to look into this, it could be very useful in my plans...",
      "Zamorak"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Presently, we are in the 169th year of the 5th Age. The length of a day, of course, is equal to one cycle of the sun and the moon.\n\nThere are ten months in the RuneScape calendar. [...] An extra day is added to Moevyng every four years to account for an anomaly in the way the calendar has been calculated. Moevyng Day, as it is called, tends to fall in the middle of the month.\n\nThe most intriguingly-named month is the Ire of Phyrrys. My colleagues over at the Observatory have uncovered the charred remains of a diary that belonged to Phyrrys, apprentice to the astronomer Scorpius.\n\nEarly entries in Phyrrys's diary tell of how he was attempting to figure out the RuneScape calendar, based upon the astronomical studies his mentor was conducting. However, a few pages have survived of Scorpius's own diary, heavily hinting at Phyrrys's ineptitude, and how at the culmination of the apprentice's initial calendar research, he'd failed to account for a whole forty days.\n\nThis is backed up in Phyrrys's own diary entries, whereby from this date on, his anger (ire) seemed to grow and grow at his inability to work these forty days into the calendar. It is assumed that a later inhabitant of the Observatory found these notes and, quite easily, corrected the mistake by placing them between Septober and Novtumber, naming the month in honour (or more likely in jest) of the 'challenged' Phyrrys.",
      "Reldo"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I have tried to convince him to stay, but he will not listen. He believes our mother is controlling us, keeping us close against our will. He does not see that she only acts out of fear, fear that she might lose us. He wants me to join him, but I won't leave her behind. She is our mother, our creator, we owe everything to her.",
      "Memory of Seren, memoriam crystal (1)"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "She cries out for him, desperate for him to return to her. I've been trying my best to comfort her, but it has been little help. In her desperation for him to return, she has created new life in his image. They are pale imitations though, shadows of him and I. Their creation has been sapping her energy, and I fear she will grow too weak. All may not be lost though, for I may be able to convince them to sacrifice their energy and return it to her.",
      "Memory of Seren, memoriam crystal (2)"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "She has been dreaming more and more often recently. As she dreams, more beings are manifested. While her initial creations held some intellect, the latest ones have been purely instinctual. She is clearly running out of energy and running out of time. The beings that sacrificed themselves for her slowed things down, but it hasn't been enough. I am left with no choice, for I am powerless to help her. I have to leave her, before it is too late.",
      "Memory of Seren, memoriam crystal (3)"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "It was not easy to leave her, but I knew I had no choice. Since my departure, I travelled far and wide, finding nothing but empty worlds, long since abandoned. I almost gave up, but just as I was ready to stop, I came upon a world full of life. The creatures here, they are a joy to behold, living in harmony with each other and their home. I approached them, fearful of how they would react to me. It soon became clear that there was no need for fear. They fell in love with me, and I fell in love with them. At long last, I feel like I am home. Never shall I leave their side.",
      "Memory of Seren, memoriam crystal (4)"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "My name is Martin Holt. I have dedicated my entire life to serving the Kingdom of Great Kourend. Under the council's rule, we've supposedly enjoyed nothing but harmony and prosperity for decades... but I know better. I can see it. I can feel it. This age of so-called 'peace' is reaching its end, and I fear for what comes next.\n\nEver since the last king died and his heir disappeared, the law of the council has become progressively unjust... corrupt... broken. Those whom we've entrusted this once great Kingdom to have become the ones we dread the most! They threaten the very foundations of all that we've built... and until the monarchy is restored, we will protest, we will rebel, and we WILL have justice!\n\nGreat Kourend will be a kingdom divided no more!",
      "Martin Holt"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "It's standard to not discuss active investigations and actions being taken, at least until after we've taken steps to resolve the issues. We became aware of a method being used to duplicate gold, and a combination of things - including tip-offs from Rendi and our system monitoring - led to us becoming aware of it very quickly. The Support and anti-cheating teams worked on removing a large amount of gold and investigated the accounts involved, whilst the SysAdmin and Engine teams were working on stopping it happening more. We remain diligent, and are yet to see any repeated occurrence of the exploit - work is continuing to improve our game systems to prevent this sort of thing from occurring again.",
      "Mod Sween"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Little is known about the giant eagles. There are reported sightings in many parts of the world, but the nests of these magnificent creatures remain elusive. The only record of such a nest being found is in the folk tale of the bandits of the golden claw. It is said that the bandits leader could talk to and befriend the eagles, and used the eagles' nest at the top of what is now known as the eagles' peak as a hideout. The story goes to hint at a secret entrance to the hideaway existing near the peak of the mountain, but until this day it has not been found.",
      "William Oddity's Guide to the Avian"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I wish I was a cow My life would be so simple I could lie around just eating grass And wonder if I was a pimple."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Twinkle, twinkle little egg Wouldn't you like to grow some legs? And run around, on grass so green arguing with the milk and cream."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How goes it, blade of grass? I'm glad you're not any thinner You should invite your friends around So I can have my dinner!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "T'was brillig and the slithey toathes Did gyre and gimbol in the wabe All mimsy were the borrowgroves And the mome raths outgrabe."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "While I sense the beating of a good heart I will not open. Feed me three crests of the blessed and the creature's remains, throw them to me as an offering... a gift of hatred, a token. Then finally rejoice as all goodness dies in my flames."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Hi there,\n\nThis is a message from Jagex Player Support.\n\nAs part of our ongoing investigation, unusual activity was identified on a number accounts [sic], including this one, which resulted in the movement of wealth and items back into the live game.\n\nAs a result of this investigation a member of The OldSchool [sic] Team has been dismissed from employment at Jagex for misuse of moderator privileges as related in the following newspost . [sic]\n\nWe have decided in these rare circumstances to return your account to as close as possible the state it was in prior to the incident by returning your lost wealth.\n\nPlease note that due to certain unavoidable restrictions we may return platinum instead of specific items so you can purchase replacements.\n\nWe take matters like this very seriously and, as such, we would like to assure you that we have taken steps to make sure that an incident like this will not happen again.\n\nIf you need further help, check out our online support centre.",
      "Jagex Player Support"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The time has come, my warriors. The gifts I bestowed upon you have served you well, and you, in turn, have served your god. Now, it is time to begin your servitude to me... to my god. You shall stand ever vigilant for His return, and then you will be champions in His glorious army - we shall have victory against the usurper. But first, you must die...",
      "Sliske"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "This is what I get for exploring uncharted caves. Looks like I'm trapped down here - My entry rope slipped off and now there's nowhere to go but deeper. I think I'd be safer just waiting and praying for rescue. If anyone finds this, get out while you can."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Wizards Mizgog, Sedridor and Traiborn walk into a bar. The bartender serves them two wizard mind bombs and one asgarnian [sic] ale. The bar closes at 11, at which point everyone leaves. How many people left the bar?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Gielinor's story is rich and vibrant. It spans thousands of years, has born witness to countless massive battles and the rise and fall of gods, heroes, villains, kings and queens. There are epics a-plenty, but among those are stories of everyday folk. The people doing the battling, worshipping the gods, and falling victim to the violence. Ordinary characters living in this extraordinary fantasy world. And that's where we wish to begin with the first of the Twisted Tales.",
      "Official description"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "With smile of Child-like wonder, and penetrating gaze, the enigmatic Gnome Child shall watch you all your days.\n\nIn good times and in evil, in fat times and in lean, he watches you with interest, but will not intervene.\n\nBut if you make the Gnome Child your champion or your friend, his freakish smile shall follow you, until the bitter end."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "...Content Development often add little jokes to their updates. Sometimes we're told about them before they're added to the game. Occasionally, they believe that it would be more amusing to just add them without telling us. Then we get lots of messages asking what a 'Thingy' is..."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "During a pre-arranged meeting with the RuneLite developer we outlined our concerns with the nature of the client and asked for its immediate closure without the need to escalate any legal action against a dedicated Old School player. We did this because we believe RuneLite was and is infringing Jagex's IP rights and damaging the game which goes against our commitment to our community to maintain the integrity of the game. Specifically, the sharing of tools used to deobfuscate Old School RuneScape code, and then re-publishing said code.\n\nWhilst this may seem heavy handed, if ignored it's entirely plausible that this code could make its way into the hands of developers seeking to adapt it to create botting scripts, or developers who would implement game-breaking features. We cannot allow for botting to become an even easier pursuit with our code in opensource, without our permission.",
      "Jagex"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Hopefully the news that Jagex and the Old School team are tackling this project in earnest is something that excites you, even though it does mean that we need to politely ask you shut down your personal project.",
      "Jagex"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Uncover Kourend's murky past and see another side to your adventures in Kourend Chronicles, a six-part series packed with new lore from your favourite continent. Check back each week for more stories, and keep your eyes peeled - we've sprinkled in a few cheeky hints for Kourend's future...",
      "A Kingdom Divided - Coming June 2021"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "In one of his four great dreams, Tumeken travelled to the border of his lands. On his journey, he saw many weak men and women struggling to cope with the heat. He helped them as best he could, but knew there was only so much he could do. After many days of travel, he encountered a great man who towered over all. He stood in the middle of a mountain pass, ensuring all could safely travel through. Tumeken approached the man and said: 'You are, indeed, the strongest of men. I shall give unto you a piece of myself, so that you may help me rule these lands. You will be an example to remind our people to take care of their wellbeing, both physical and mental.' And so, Het, the god of health, was born."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "In one of his four great dreams, Tumeken travelled to a part of his lands where two rival tribes were in opposition. He saw both sides engage in heated argument, but as he looked on, he also saw a troop of baboons. They were playing and learning together, sharing food and chittering excitedly. Tumeken called out to them, and one scampered towards him. Tumeken stoked [sic] the baboon and said: 'You are, indeed, the most sociable of creatures. I shall give unto you a piece of myself, so that you may help me rule these lands. You will be an example to remind our people to take pleasure in the joys of friendship.' And so, Apmeken, the goddess of companionship, was born."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "In one of his four great dreams, Tumeken travelled to a large settlement by the River Elid. Upon his arrival, the citizens prepared a great feast of excess in his honour. Horrified by the waste, Tumeken left the city. However, as he did, he saw a crocodile in the river, stalking its prey. The crocodile was slow and patient, but in the end, the meal was hers. Tumeken caught the eye of the crocodile and said: 'You are, indeed, the most resourceful of creatures. I shall give unto you a piece of myself, so that you may help me rule these lands. You will be an example to remind our people to never overindulge in physical pleasures.' And so, Crondis, the goddess of resourcefulness, was born."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "In one of his four great dreams, Tumeken travelled to the emptiest part of his lands. There, he came upon a lone cave which delved deep below the sand. Inside, Tumeken sat and reflected. However, as he did, he noticed a small scarab burrowing in and out of the chamber. Tumeken watched it for hours, until he finally snatched it up before it could flee. He looked at the small scarab in his hand and said: 'You are, indeed, the most isolated of beings. I shall give unto you a piece of myself, so that you may help me rule these lands. You will be an example to remind our people of the importance of tranquillity, but also the dangers of solitude.' And so, Scabaras, the god of isolation, was born."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Slog around a board with a sun tanned snail about these items ~ Cracker Jack http://ow.ly/ou8Ah",
      "Old School RuneScape's Twitter account"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "50 under me initially over the rough big red company ok? ~ Cracker Jack http://ow.ly/oBVV3",
      "Old School RuneScape's Twitter account"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Fragments have started to reveal themselves...\n\nOver the next few days, dIscover a trail of clues across our newsposts to uncover a new Fragment.\n\nGood Luck! The first person to @JagexSarnie on Twitter with #FragmentHunt & solve the name will win 6 months of Membership.",
      "",
      "Old School RuneScape Twitter"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Another clue uncovered...\n\nWill you be the firSt to solve all of the puzzles?",
      "",
      "Old School RuneScape Twitter"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "This marks the halfway point.\n\nWe've been enjoying alL the theories and guesses so far, but who will be the first?\n\nDon't forget to @JagexSarnie on Twitter with #FragmentHunt and the answer to win 6 months of membership!",
      "",
      "Old School RuneScape Twitter"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Another secret lies hidden amongst the completed solution.\n\nCan you discover where the secret frAgment is kept?\n\n#FragmentHunt",
      "",
      "Old School RuneScape Twitter"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Someone has solved the puzzle!\n\nHere's the fiNal trail of clues to finish off the #Fragmenthunt.\n\nStay tuneD for more details on the fragment which we'll reveal tomorrow.",
      "",
      "Old School RuneScape Twitter"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What considerations went into creating this roadmap? When creating the roadmap, did you take into account all of the player feedback from the past year?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we expect reasonable consistency on updates next year?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When can we expect the ToA Rewards Blog?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Do you think delaying Leagues 3 was the correct decision and can you explain more about your decision for the delay?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What progress have you made on Account Security since you were last on Stream discussing it in the Summer?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There has been a lack of smaller Polls this year. When is Poll 76 and do you have plans to introduce more Polls next year?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there anything more official you can share about how the GE tax is going? Also, will we ever be able to see item sink/tax statistics ingame?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why have the Wilderness changes taken so long to implement?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why does it feel like the Wilderness updates are making the Wilderness safer? If the goal is to increase activity, why don’t you focus on increasing the profit from Wilderness content?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Do you have a longer-term plan for PvP?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The past year, nothing significant has failed a Poll. Are you guys happy with the current state of the Polling System?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What is being done to solve issues of lag spikes occurring in-game?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are you planning on bringing back any iteration of Partner Slayer?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The roadmap includes “New Player Experience” in it. Can you expand on this? I would like to know what is being done to attract new players to the game?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There are several streamers who are using cheat clients and nothing happens to their accounts. Why is this?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are there ever going to be plans to add a new Skill in game?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What about the Deadman Reborn re-run?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What are your plans for the revival of the multi scene in the long term? Since rev changes, this Community decreased."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When will we get more info on the mechanics of Leagues 3?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What is being done to tackle the constant stream of bots at Last Man Standing? They are in every single game right now and it is almost impossible to ignore them."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will there ever be a world dedicated to Finnish and Swedish Players and such? Are there ever going to be more dedicated Worlds in general?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Any possibilities of adding a Group/Clan instance, similar to the Corporeal Beast for Nex? Would be nice to just do it with the clan and not 80 random people."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we extend private instances to other God Wars bosses/other bosses in general, locking it behind combat diary with higher tiers = more players can join?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Have you considered lowering the amount of supplies dropped? Right now, it seems way too easy to get supplies, even if it is a mass. Also, was it intentional that it would be very easy to stay at Nex indefinitely, with the number of prayer potions and food dropping on average and the fact that resupplying and re-entering is so easy as well?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is it possible to increase the drop rate of the Nihil Shards on the monsters where you get kill count? As an Ironman, I have to gather 250 Nihil Shards. The current rate to get them is just absurd! I've been lucky enough to get an early Nihil Horn to make the Zaryte crossbow, but it'll take about 100 hours of Nex masses to collect 250 shards and that seems extremely excessive."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why is the default GE guide price of Nihil Horn 150,000 GP yet the price of Blood Essence is at 2m? It seems incorrect."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There seems to be an awful lot of Blood Essence drops - if one person gets Blood Essence in my clan, everyone in the party all seems to. Is this intentional?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you come up with an alternative solution for disconnections at Nex? Currently, if you disconnect and manage to survive, you get kicked directly out of the door, into the range of hard-hitting mobs.\n\nIf you don't have enough kill count, an ancient item or a teleport out, you're in danger. Simply teleporting just inside the frozen door would make no difference to essence mechanics but would put you somewhere safe."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When the hype of Nex dies down, will her mechanics be tweaked again? People are complaining about how easy the boss is, but that is just a factor of 70-80 people killing her at one time. If you make it so she doesn't drop as many supply drops, and you buff her SS delay."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I don't get how the drop system works. Is only the MVP of each killable to get the unique? Or is it randomly rolled for everyone that's done damage to her? Is loot scaling to team size? If so, why?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Any plans to make other bosses such as Corporeal Beast/God Wars Dungeon work similar to Nex in terms of loot distribution?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Crossbows were said to be Nex's weakness, yet it feels like everyone at Nex is using a Twisted bow, Bow of Faerdhinen, and Dark Bow. Zaryte Crossbow feels underwhelming because of this, and so does Armadyl Crossbow. What are the team's thoughts on how the Zaryte Crossbow is stacking up?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "In her final phase, Nex uses Ancient Curses. Could there be a chance for the prayer book to come to Old School in the future?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What is the reason Nex is unscaled? How do you feel about people achieving 500 kill count on the day of release?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why did you decide to not let the Ancient Ceremonial robes skip KC? Is there a chance this will be changed in the future?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will Combat Achievements be added for Nex?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Would it be possible to add a Group Ironman-only room to Nex, so you are not forced to abort the kill to prevent the loss of prestige if someone crashes you?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will Torva Armour get a set effect in the future?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you make the Nex bank NPC more visible and not move?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Does Blood Essence just give extra runes, like the diary reward, or does it give extra experience for those runes as well?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What are Ecumenical Key Shards, and where do you get them? Are they a replacement for getting full keys at the Wilderness GWD, or are they dropped by minions in the Ancient Prison?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Would you consider a KC system similar to Nex's for the other GWD generals? Currently, it doesn't make sense to grind out KC for Arma or Sara since there are no low-level NPCs to kill like for Zammy or Bandos."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why isn't *cough* more punishing in terms of HP damage as well to force people to get rid of it instead of camping full Ancestral gear to bypass its effects?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What as the work like getting Nex to sprint? Will other NPCs be able to sprint going forward?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there any potential to be able to pay someone to repair Torva from the damaged piece and Bando's components rather than needing 90 Smithing? Much like you can for the Corp sigils and DFS?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How are the boss mechanics for Nex different from pre-EoC RS2 or even RS3?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "If the Ancient Godsword is considered for a buff, would you consider allowing its spec to overheal?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Were there any nicknames being considered for Nex besides \"The Fifth General?\""
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why were the voice lines from the original Nex fight not added? It added so much to the feel of the boss fight."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there any discussion on the art design of Nex? Does the Mod Team think that the design can be improved, or are they happy with the current model?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Guardians of the Rift was first mentioned back in the 2020 December Gazette, can you talk a bit about what aspects you changed since?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you take us through the basics of the minigame for anyone who may not have read the blog yet?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will players be able to use blood essence or Daeyalt essence in the minigame?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Who are the Shield Guardians and the Rift Guardians?! What do they do?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I think we also have a concept image of the arena itself - West. Can you talk a bit about the process of creating this?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Did you take any inspiration from ‘The Great Orb Project’ or ‘RuneSpan’? For those who might not know, the Great Orb Project was a minigame in the Runecrafting Guild from 2008, and RuneSpan was a runecrafting update in 2012. I saw comparisons coming up when we published the blog, so I just wanted to know if it was something you looked at from a design perspective."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The blog says that Guardians of the Rift will be accessible to limited account types such as skillers/10hps. Can you confirm whether Temple of the Eye will be possible to complete as a Level 3? Has it been designed with Skillers in mind?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What kind of XP rates does the Guardians of the Rift minigame sit at different RC levels?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is the intention to be the Wintertodt of Runecrafting? Do you think this minigame solves all player problems with RC?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How do these XP rates sit in comparison to existing methods with Lava Runes and ZMI? Do you intend to shift existing methods?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you tell the players more about how XP rates are balanced. Especially when it comes to pre-development, during development, and then post-balancing for player feedback?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What considerations are you taking into account when designing GotR? It looks like there’s a rewards rift and then a rewards shop. Can you talk a bit more about those two elements? Why did you decide to make some rewards random and then some purchasable?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why did we opt to go with a new pet rather than adding a roll for the existing Rune Guardian pet?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you talk about what exactly the \"True\" Blood Altar is? Will it be accessible via the Abyss?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What will Blood RC XP rates look like for the 'True Blood Altar' in comparison to the one located in Zeah?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will the RC max cape allow access to the True Blood Altar?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Mod West, would you be up for discussing the design of the new Runecrafting Skilling Outfit?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Mod West - Is there any potential for a recoloured version of this design? Can you talk about your inspiration behind the recolours?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I know this has been asked a lot but are there any current plans to address Wintertodt hp scaling? Ideas for warmth gauges/bandages etc., have been thrown around for many years, yet to this day, it is still a pain to kill this boss without being early or late into your account. It would be nice to shake up the early game of most accounts and know that postponing Firemaking training isn't going to bite you in the ass if you come back later."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Now that we have a G.E. tax for gold sinking, can we finally change the pet insurance system to be free and automatic, and for pets to go to your bank if your inventory is full and there's already a pet out? (Excluding the Wildy). Many people never use their cosmetic pets because constantly losing 1m isn't fun."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Mod Zuko had a proposal to rework teleport items with charges. The gist of the post, from my understanding, would be to make all teleport charges be tracked via a player variable, like the Dodgy Necklace, instead of an object variable (e.g. Xeric's Talisman) or having one type of item per charge (e.g. Amulet of glory). Would it be possible to implement this change? If so, would the devs be interested in polling it?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are there any plans for new POH styles? There is a lot of potential for new ones based on examples like Priff, Morytania, and Shayzien."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are there any plans to address the Nex Drop Rates? Hype dying down after the first week is normal, but the nerf killed the boss's popularity. Can we revert the nerf or even buff it further?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Could Barbarian Training be reworked as a mini-quest? The current layout is clunky, and it's difficult to know what step you're on or what you need to do to progress/finish the training."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Any plans for additions to the Clan Hall? I feel like there could be a gold/item sink potential there with upgrades that add more things to do—for example, donating X amount of ores/saplings to add some higher tier skilling nodes or donating enough money as a clan to unlock alternate colour palettes/themes for the clan hall itself like house themes."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Some Skilling boosting items seem to be tradeable, but not others; any chance this will be changed? (IE: Spirit Flakes vs Blood Essence) is the example they've given."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we get a skill cape teleport for the Woodcutting Guild? Maybe waive the favour needed for the guild if someone has 99, or make the teleport go outside if the favour has not been obtained yet."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can mobile get a toggle that switches Chin traps default click from \"check\" to \"reset\"? It would make Hunter on mobile better."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we please get a system to safely transfer names without having to resort to going to the black market? This sort of system has been going on for way too long, and so many people are getting names sniped. The name selling market is probably one of the shadiest markets there is; please put a stop to it."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Clue boxes have been one of my favourite QoL in the Shattered Relics league. I love taking a break from slayer to do clues between tasks rather than during them. Would it be possible to poll them again for the main game? My only concern would be letting people stack clues from impling jars, but I think that would be a simple compromise to bring clue boxes to the main game. My only concern would be letting people stack clues from implement jars, but I think that would be a simple compromise to bring clue boxes to the main game."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Has there been any more thought given to increasing the Grand Exchange tax value and whether additional items will be added to the list?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are there plans to change some of the KC requirement combat tasks? Please don't lock CAs behind time sinks and instead focus on more skill-testing challenges. If I can kill a boss 100 times, I can kill it 250 times."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we get an Elemental Workshop 3 quest in the future with new rewards? Currently, if you look at elemental/mind armour, it is kind of weak compared to the effort needed to make it; it would be nice if they get an update."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will we ever get a solo only version of Nex, similar to Phosani Nightmare?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you change Puro-Puro dragon implings spawn time to random? Wiki says it's random, but it's not, and some farmers/bots use timers to be on that world when they spawn. They don't know the corner where the impling will spawn, but they know the time. If someone is lucky to get it before them, they just reset the timer."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can the Slayer Cape be purchased from an additional slayer master instead of just Duradel? If you wonder why it is because I have a max combat 99 slayer ironman, and I want to buy a slayer cape but can't do Shilo Village. Besides Herblore, it is the only 99 cape locked behind a quest since you need to do a quest before unlocking the skill."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we get some more things for the PoH? Simple stuff like a Square Mahogany Dining Table, Kitchen Table, Mahogany Larders, and maybe a Butter Churn for the kitchen? (Also, Redwood furniture)."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we buff Demonbane spells? Here are some thoughts: \n- Reduce the magic defence of demon bosses \n- Add a way to save runes (perhaps with the drawback of reduced XP) \n- Make Mark of Darkness cast on yourself and last 7x as long (like the charge -spell) \n- Make Kodai wand cast one tick faster with them"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Fishing Trawler was reworked to improve it but somehow did not add mobile into that equation. Can we get an update to make Trawler (especially the top with the Kraken) more mobile friendly? For example, there are no visual indicators on mobile when it's the correct time to attack the Kraken or fix the rail."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Have you guys considered adding a Barley Seed Pack the same way we have Vial of Water packs and Rune Packs? World hopping to buy seeds for Birdhouses isn't fun, and ultimately it's not even the bottleneck since we also need to get logs. It's as QoL as it gets."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Could there be a chance for Herblore to get the Mahogany Homes treatment in the future? There's currently only one way to level Herblore: making potions; I feel it could do with a mini-game, maybe something with a cauldron, perhaps?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "If there are still plans for a mage offhand augment: wouldn't the simple solution be to allow both the Mages Book and the Arcane to be upgraded? Keep the arcane BIS for those that have it, allow an alternative with Mages Book that isn't as good?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Enjoying Nex a lot! However, there is a growing problem with gold farmers/bots making players take way more hits by running away from the boss in the final stage. They don't communicate, and some people intentionally spread viruses to create chaos. A few days ago, two guys jumped from world to world to troll all active masses. What can be done about this, and do we have a way to report it? It's quite annoying."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What does the team think about adding ornament/recolour kits for Nex items? The spiritual rangers/mages/warriors look great, and it would be cool to have the ability to recolour the endgame armour. Bracers are also hard to distinguish atm, and a revamp to make them as clear as ferocious gloves would be cool. What about the ZCB? Or future releases of Pernix/Virtus?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can Bird Nests from Woodcutting just go straight into our inventory? At least the ones with clues. I couldn't tell you how many clues I've lost at Redwoods while doing other stuff. Mining and Fishing already have this."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Twin strikes does not proc on melee-based special attacks. Is this a bug or a feature? Presumably, the same is true for double-tap and chain magic, but I don't have enough data to make that claim."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will Kourend or the River Dougne ever get canoe stations?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will the revenant boss have a pet? It would be cool to have a ghost haunting you around."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you please add a Tempoross teleport to the Games Necklace?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can the Tackle Box have a 'deposit worn items' button added?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When will we have more information for the ARG that resulted in THE FOOL, WHEEL OF FORTUNE, and THE EVIL being found?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What made you select Land of the Goblins to be the next questline to be brought to the game?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "With Land of the Goblins continuing the Dorgeshuun questline, will we be seeing the Chosen Commander after this or something completely new?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Would love to see more quests & lore revolving around the goblins. Can we expect any more in 2022?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Has the team considered adding a raid or Skilling activity to Dorgesh-Kaan to revitalise the city, possibly as part of the eventual finale to the Dorgeshuun storyline?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What was your favourite part of working on this questline?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are there any plans for the goblins located on the Eastern Shore of the River Lum to eventually be \"relocated\" in a future expansion?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "During Death to the Dorgeshuun, we show Zanik around Lumbridge. Can we get some new dialogue for the NPC's that were added since Death to the Dorgeshuun? It'd be nice if Zanik could learn about Ironmen and have some surface-beer."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Dorgesh-Kaan and Keldagrim have started having important political and economic ties to each other. When the Red Axe continues to rise, and as Bandos continues to run amok, can we see how this affects that intergovernmental relationship?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is the higher quality standard for quests the driving reason behind only releasing 1-2 a year?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Have you thought about merging quest lines together? Right now it seems like the number of quests released per year is very minimal compared to how much there is to continue, and merging quest lines would help on both fronts. What are your opinions on this?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Could we have more easy-medium difficulty quests to be part of a questline? Expanding and concluding quest-lines has been cool and all, but I think it would be great if more lower-level quests could be added as a way to build up the lore better. Some of the grandmaster quests in the past just introduce a cast of new characters that could have been introduced in smaller quests, which I think would improve the much-beloved storytelling of RuneScape lore."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are there any ideas or plans being tossed around for a 'climax' of some sort for the overall story? Nothing too huge like a 6th age (unless?), but something that brings the whole of the game together and isn't part of any existing questline."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What are the chances of some quests directly involving some gods, such as Saradomin or Zamorak...? Maybe some rhetoric from Zamorak talking about his fights with Saradomin over the years?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I've heard that the OSRS team has committed to no god-themed quests, which would include goblins and Bandos, the big high war god. Is that true? Can we expect god-themed quests in the future?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Early in OSRS' lifespan, there was talk about adding quests that would explore the backgrounds of iconic RuneScape NPC's, such as the Sandwich Lady. Is this still being considered? This sounds like a fun way to add some smaller quests."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Does the OSRS team have any plans to release Arposandra (home of the Gnomes) in the near future? Would love to see the Glouphrie quest line continued (Hopefully even meeting Glouphrie) and hopefully Arposandra alongside it!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "In relation to the Mahjarrat series, have you thought about how Temple of Ikov and Hazeel Cult will work with an eventual continuation of this series, considering their multiple-choice endings. Will there be a \"canon\" outcome to each or will the choices impact a theoretical sequel?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What's your favourite questline you want to (or are working on secretly) continue on OSRS?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I have a theory that the Temple of the Eye is named that because it takes place in the eye of Hostilius, the giant demon whose body contains the entire abyss, at least in RS3 lore. Without confirming or denying that theory, how much impact does late-RS2 and RS3 era lore have on the direction of content outside of continuing shared questlines?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Lore-wise, how are the Camdozaal golems connected to the essence golems of the Mage Training Arena and the clay golems of Uzer and Elidnis?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Currently, in Leagues, it is solidified that there are alternate dimensions and realities all happening simultaneously within the OSRS and RS3 universe. In fact, we see many different changes to lore between the two games, which solidify that although OSRS lore is similar, it obviously is much different. A major example is Fossil Island vs. Land out of Time, suggesting that The Needle in RS3 is not present in OSRS. My question is: Will there be any solidified lore reasons given within the Goblin Series or other series, as to why this rupture in time has occurred?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "If someone wanted to actually learn the lore within the game, what would be the best way to do so? Is there a library that contains details of the god wars, or is it just little Easter eggs dropped everywhere?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What's up with OSRS quests giving vague combat level recommendations instead of saying \"must be able to defeat a level 184 Goblin\"?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "As new quests like this rollout, are there any intentions of introducing new/more efficient skilling methods like the range right next to the bank in the Myths Guild? It would be cool to see some sort of thematic intention, if so, like a Furnace/Anvil/Bank being near each other for the Dwarves questline."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When, if ever, do you think a Goblin Boss might be added to the game?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Even if we don't see the Chosen Commander questline, I would still love to see Zanik's Crossbow being added. Do you think this might be possible?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Keldagrim is one of my favourite cities. Is that region getting some more love soon? Continuing the Dwarf storyline or introducing something brand new, involving them with other Dwarves. Some more (unique) farming in there. What do you guys think?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Wonder how the Ornament Kit will work with the Degradable Tent Whip. Will it just be unequipped when the charges are used up or be destroyed?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "In a postbag section, the Chaos Elemental was referencing a piece of lore? Can you give us any hints as to this??"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When can we expect the Android Open Beta?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When can we expect the Raids 3 Rewards Blog?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Any timeline for the Group Ironman Post Launch Improvements? These include updates to POH and making specific items tradable within a GIM team?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I’m an Ironman, and this week, I spent a considerable amount of time trying to kill Kalphite Queen, and I’ve found it frustrating that if a main hits it while I am doing it, I don’t get the kill credit. This makes it near impossible to do during peak hours. Do you have any news on possible Iron Man instances?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Have you considered a delayed payout of rewards on a weekly basis? For example, reward points are accumulated throughout the week but paid out after the weekly reset."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you talk a bit about the Amulet of Souls’ design philosophy? Why did you decide this type of reward, and are you going to proceed with the Amulet of Souls in V2 of the PvP Arena blog?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why are tradable PvM based ornament kits tied to PvP based content? Does this not promote illegitimate gameplay the same way it was before? Untradable kits purely for prestige seems a better fit imo - or at least kits for items used in PvP situations."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will the ranking system be an ELO rating system? I noticed nowhere does it say you'll lose ranking by losing, so I'd be afraid the game will confuse players who are really good with players that simply played a lot"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will there be Tournaments with entry fees?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What kind of PKing are you trying to promote with the PvP Arena? The way it's currently proposed is a weird mix of edge-style (no overheads, no mage) PKing and hybrid PKing. Picking stats is a really weird way to approach this."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are there any plans to restrict polling on the PvP Arena to accounts with a history of engaging in PvP content? Are you worried this poll might run into the same \"spite voting\" issues other PvP polls have had in the past?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Clan Wars is notably missing from the list of PVP zones that the rewards work in from the PVP arena. Is this an oversight or intentional? If the latter, could this be reconsidered?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How will you deal with smurfing at different ranks?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can the PvP Arena be expanded on to include edge-style 1v1 and not just nh bridding? Also, the equaliser in stats devalues your account build somewhat. Could there also be a toggle to choose if you want to fight someone at your own CB or stats?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will your F-key presets be carried over from your standard profile in the PvP Arena? If not, can they be remembered after setting them up once so they don't need to be reset every time you enter?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What are your thoughts on doing an OSRS take on the Mining and Smithing rework? Currently, there are major problems in both, such as high-level rocks bring pointless due to MLM in Mining, and the level balance in Smithing."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Once you use the observatory grapple shortcut for the first time, the rope stays forever so you don't need to bring a crossbow & grapple in the future (QoL). Can this be done with all the other grapple shortcuts in the game? Since they are dead content as of right now."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Historically, when the Oldschool team has attempted to propose a new skill, they have handled everything from devising a premise to how to build on it, leaving the community to vote on rewards for the most part. Is it possible that you could try and get the community involved earlier into the making-of process for a new skill, perhaps starting with a blog outlining some brief prompts to see which ones catch players' interest?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Despite the addition of the new slayer monsters to the Wilderness, Thammaron's Sceptre remains underwhelming and undesirable to use. With a focus on PvP updates, does Jagex anticipate making any changes to improve the state of the sceptre?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will there ever be any consideration into improving the multiplayer aspect of older content? Specifically, I'd like to ask about multiplayer bossing. With the inclusion of bosses, these are great activities to do together, as everyone can contribute. Something like a Group Collection log for GIM?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Would it be possible to add Skill cape hoods/capes to be compatible with their respective skilling outfits by using them on each other, like how you can use an Ava’s on the Range Cape? An example would be adding the Spirit Angler set effect for Tempoross to the fishing skill cape hood."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there any talk of updating for some of the older Skilling Guilds to be more in line with the standard current players have for Guilds ala Woodcutting/Farming? If so, can this be prioritised over adding new Guilds to the game?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Skilling bosses have been a massive success. Fishing has a boss (Tempoross), fire making has a boss (wintertodt), and runecrafting is having a fun way to level it up soon. The next in line for an update would be a skill like woodcutting as it’s highly obsolete and boring cutting trees all day. Would love to see a woodcutting boss released in a future update. Maybe in a city that is not used to get more players there such as a desert city. Would this be something you would consider?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Last Man Standing: F2P players can no longer obtain points. This makes the f2p items discontinued for F2P Ironmen. Can you allow F2P Ironmen to earn points in f2p worlds? Requiring a minimum total level, game time, and quests points requirement will make any F2PIM botting impractical, but will benefit the F2PIM community. Note that many people who have F2PIM also have multiple members accounts."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Going off the recent blog Poll 76 about unique hitsplats for your max hit, would it be possible to do something like that for blocked attacks via protection prayers? So you’d have the normal blue 0 for regular misses, and one that’s a different shade to indicate that it missed due to praying correctly."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we get additional books of the dead? Losing it and having to reclaim it before each Wildy outing is annoying!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can task storage be updated/improved? Can it be free to store a task? Currently, if you want to grab a skeleton or lizardman task for CMs but do regular slayer on the side, you need to spend points to store it, then it’s free to unstore, but then when you go back to slayer, it’s more points to store it again. Kind of difficult to use for that purpose. Same idea for storing Vorkath/Hydra/etc. it’d be much more appealing to do a portion of the tasks, then store it without penalty. It’s 1k pts to unlock. It could use a buff."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there any way we could mute Nex so she doesn’t clutter up the chat box?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is the Nex unique drop rate now set in stone? It seems like a lot of people are very unhappy about the time it takes to receive drops from a very resource intensive boss. I know it was briefly brought up in a previous stream but was shot down saying that it would bring too much gp into the game which makes no sense at all. More drops would just decrease the price of the uniques and not bring more gp into the game."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Nex drops loot to all players in the instance as opposed to whoever did the most damage. Will this be the new standard for bosses moving forward?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's an unavoidable death situation on Phosani’s Nightmare where if Nightmare uses husks right when you last hit the last pillar, you won't have enough time to deal with the husks and the sleepwalkers after. This usually means you'll have to teleport or get hit for 99. Would it be possible to change it so that Nightmare cannot summon husks when one tower remains or maybe the husks can despawn during the sleepwalker phase?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can emergency teleport shard functionality be added to Zalcano? Since teammates are there they can save you from disconnect deaths just like TOB."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What do you think of being able to spend slayer points to prefer certain slayer tasks in the same way that we can block specific tasks?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "So there still isn't a consumable, generic, common drop upgrade along the lines of Avernic, raids prayers. Is it too late to ask for an upgrade for a rune pouch of 4 rune slots?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will the non-combat skills needed to make potions, etc. within the raid be the same as Raids 1/2?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "With Masori coming out, does this mean Pernix isn’t in the pipeline?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there a lore reason for the breakdown of Armadyl like we have with Nex/Bandos and Torva?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we get a spot to build a mount for the sceptre that gives it unlimited charges in our POH?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there a planned release date for Tombs of Amascut? I'd like to schedule some time off work for when it comes out."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "With the removal of the 50 damage cap and that this update might still be some time away, would it be possible this part of the update could happen sooner?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Heka's spellbook effects. Historically tridents never cared about your spellbook and it's being said that Heka is meant to be the Twisted Bow/Scythe of ToA. Why does it not hit as hard as the previous then? The previous weapons can hit 80 in a 5t cycle but Heka can't hit 160 in its 10 tick cycle. Raw damage is more appealing than 4 spellbook interactions on which 2 will never be used."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When can we expect to see concept art for Masori armour and the other rewards?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "With the mage shield requiring a sigil, can you rework Corps drops to be similar to Nex, allowing for ironmen to kill Corp with groups?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why does the Ward still have the same defensive stats as a blessed spirit shield? Isn’t the whole concept of this item sacrificing the spirit shield in exchange for more offensive power?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Stat renewal potion seems ok, but what about a prayer renewal potion? This could introduce a new seed drop."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I still don't really understand what the potion is for. Why not just introduce overloads all at once if you're keen on doing so eventually?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How do you feel about the current state of the Harmonized Orb? With the upcoming mage offhand and staff, it will essentially become obsolete since the orb needs a tome of fire to be useful. Are there any plans to buff or make adjustments to this item considering it’s the rarest item from an upper-end boss?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What's the situation with the rest of the Kourend City reworks? Is it likely that we'll see the next one come this year?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What do you think about the ability for players to speak to ghosts without using items at level 90 or 99 Prayer? This could be added as part of Morytania Elite Diaries."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I have a question for Bruno. Has the team had any further discussion about allocating resources to making new early/mid-game bosses and bosses that require the use of Mage? Potentially reusing and adapting existing boss fights."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "For Mod Kieren: In addition to League to League rewards, can music unlocked in a League stay permanently unlocked/carry over to subsequent Leagues?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Could we ever see an update on Skillcape utility? I'm specifically thinking of agility cape perks, but I'm sure there are other capes that are near useless too!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What are your thoughts on if you receive a piece of 3rd Age during leagues, at the start of next league, you get a \"3rd Age ornament kit\" which allows you to cosmetically change a piece of gear?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Now that you're adding a PJ timer this week, many think you're going to kill off team PK'ing. Are you planning on giving a multi-hotspot for teams to PK at?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I heard rumours about making all pets run to keep up with players, like the Nexling. Is this true, and is there an expected release date?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "With talk about reworking some skills, I was wondering what skills are considered on the table and which skills are considered off the table. Also, considering that the only knowledge we have about the rework is additional content presumably (i.e. the new Smithing content that was mentioned in a recent post), what form will these reworks come in?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Given the overwhelmingly positive feedback to backporting select quests, when might we see more backported quests?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you buff some of the daily achievement diary rewards? For example, wilderness elite diary lets you claim 50 free runes per day from Lundail. It's so bad; you can get 50 air runes."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When are the changes from Poll 76 coming? I'm particularly excited to know when the combat achievement changes from Poll 76 are being implemented (Reducing kc tasks, overall reworking). I would like to know if I should hold back on doing them or start grinding if they're not being changed in the near future."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "It takes 20 hours to get a BCP, and 250 hours to get a Torva platebody; Nex and Nightmare provide hugely different gaming experiences to the rest of OSRS. The experience differs enough that it risks alienating those who prefer a less extreme grind/reward. Is this something you consider during the design process, and will we ever see the return of GWD/Slayer boss unique rates? i.e.: bosses whose level/gear reqs and difficulty keep prices high instead of extreme rarity."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "You keep mentioning Corp damage cap being removed. Is this for spears only, or Is it true for all weapons such as Rapier, Twisted Bow and Scythe etc.?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "We’ve seen a roadmap for the Jagex Launcher, which was great, but we have not received a timeframe with dates yet. The PvM Community are curious about whether the Runelite version of the Jagex Launcher will be available in time for Tombs of Amascut’s release?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When is this year's Easter event set to release? Any teasers you'd like to share?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When can we expect the pet reclaim changes and Elite Clue Casket changes from Poll 76 to be implemented?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there an ETA for when we might see another blog for the Equipment Tier rebalancing changes? Or will the changes be as stated in the most recent blog, and if so, are there plans for when this update will go live?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When is the timetable for the re-run of DMM reborn finals and will we ever get DMM 2022 again?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Sometimes players get frustrated that new content takes a long time to come out. Can the developers go into detail what it takes to go from coming up with a new idea to actually releasing it? What steps do they go through in order to make sure the content is enjoyable by everyone?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there any update to the current road map? How are the other projects progressing? Do you have any leaks or WIP pictures?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Depending how far along you are with ToA, have there been any 'giga busted' or funny things that just didn't work out?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I'd like to hear some actual discussion around the J-mods thoughts on the future of OSRS. There are some serious issues around power creep and technical limitations to the game which will eventually lead to some tough choices. What do you think you’ll do for OSRS, will you go in the direction of RS3 or another way?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What does the team consider to be \"acceptable\" power creep in terms of weapons from big PvM releases like Tombs of Amascut? Maybe a hard thing to quantify, but in terms of % DPS increase compared to the previous options?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is power creep in PvM treated differently to power creep in PvP? Do we try to stay away from power creeping PvP?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Would the J-Mod team consider creating new raids every 12-24 months? Are there enough resources to make this happen? I understand that a low % of players interact with the content but I believe if a healthy power creep was introduced with each raid, it would make the previous ones easier over time which should boost average player interaction/interest in that content."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How difficult should PvM content be? What's the philosophy behind it, should everyone be able to somewhat participate on release or close to? or should it be so difficult that you can't participate until you've become \"good enough\" and with that creating something for players to strive towards."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Do you anticipate having to nerf any more items in the next 1-2 years? Or maybe longer term like 3-5 years?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How do you generally go about designing a new boss from beginning to end and how do you decide how click intensive it should be?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are you still planning on introducing Virtus through a piece of content like a standalone boss?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How much do Polls hinder the Old School Team on content development, balance and overall health of the game from a dev POV?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What are your thoughts on Exploration, a new skill for OSRS? You sail to randomly generated islands, loot them, raid them, skill and kill, do the puzzles, and then bring home your loot with your mighty ship you built and customised. This would combine aspects of the Sailing skill and Player-owned ports (from RS3), to bring an exciting skill with plenty of variation."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will you ever consider the possibility of some form of XP lock for PvP?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's been a lot of barking from PKers that want the PJ timer reverted, and that would leave PvMers severely in disadvantage with the boxing mechanic gone. What are your thoughts on that?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I’d love to see a discussion between J-mods of what they think is the best way to get new players into OSRS. How do the team feel we can best boost membership and get newer players engaged with the game?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why is there no portal for Astral, Wrath, or Soul runes in the Temple of the Eye?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How can we breathe and walk around if The Temple of The Eye is located deep underwater?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Was the temple of the Eye always underwater, or did it sink at some point like the Everlight near the Icyene graveyard?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Before there were numerous plot holes regarding Runecrafting. Namely, the burning of the Wizard's Tower timeline with the forgotten Runecrafting art, how fast ZMI found out about Runecrafting post the Rune Mysteries quest, and how Aubury came across a teleportation spell in the first place. It has come to my attention that these plot holes are pretty much resolved. So, could you briefly summarise the change to the Lore, namely from the Rune Mysteries Quest and Abyss related content?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you tell us more about the Guardians and ‘Them’ referenced in the Diary? Perhaps who originally created them?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Considering the Stone of Jas is actually brought up in this quest - can we make the connection that this is confirmation we’re beginning the Elder God & Mahjarrat storyline, finally?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Introducing Stone of Jas to OSRS implies that we can continue the Mahjarrat storyline. Can we see Guthix die once more? How about Fist of Guthix minigame?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Was there a particular reason Saradomin had the Stone of Jas hidden underwater south of the coast of Morytania? Was it because it was closer to Hallowvale at the time?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When exactly did Drakan get the stone in the timeline? Before or after Saradomin took it, or after the God wars even? And can we assume after the Temple of the Eye, they moved the stone to where the fist of Guthix is at?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there a \"Stone of Jas\" related reason the Saradominists included altars to most of the runecrafting altars in the GotR temple, or is it just because of the stone's involvement with runecrafting?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The Justiciar Zachariah was tasked with defending The Eye, but we assumedly killed him during Mage Arena 2 so we could have an imbued cape. Are there any plans to link The Order of Wizards quest line into a future Mage Arena quest, or will this just be an easter egg crossover?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is the Dark Altar another elder artefact? Are the Tasakaal like the Dragonkin in that they are the guardians of an elder artefact?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why is the Dark Altar so unguarded after the events of The Ascent of Arceuus? Is it because Tyss is sufficiently powerful enough to repel potential entities seeking its power for the wrong reasons?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are there going to be further storylines that are spun off from Temple of the Eye? It opens up a very interesting storyline in the Wizard Towers v ZMI, something which hasn’t been explored a lot even in RS3, as well as dropping some hints that are very impactful in regards to other series (Vampyres, Mage Arena, Elder Gods, Zaros, Fremennik, etc)."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The colour of Persten’s skin is a yellow shade similar to the Sea Slugs of Witchhaven, was this an intentional design decision for a potential hint to the Sea Slug quest? Or simply an oversight when designing her to look slightly different to hint that she wasn't who she appeared to be?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Was Mia Persten our first direct interaction with Sliske? Since her name is an anagram for I am Serpent."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How were the entrances to the blood, cosmic, and death altars destroyed? The entrances were destroyed by the Runecrafting Crusades yet it is very implausible that the Fremenniks managed to access the locations of these altars."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What is Mod Ed’s favourite piece of lore or storyline and why?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What did the team think of the quest backport poll which was circulated a month ago? Was there much support for it?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there any specific part of Rs3 lore the OS team is looking to avoid repeating?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will we ever see a major recurring villain in Old School? RS3 had Sliske who featured in many memorable quests. Will we get our own version of Sliske considering he was foreshadowed by Ashulot Reis with the Nex release?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there any desire to expand on the Tasakaal lore in the future? The Elder Gods have been very scarce in OSRS lore, but with the mention of Jas in the Temple of the Eye quest it brings to question if they will start making their way more into the game. In RS3 Ful is based in Karamja, commanding Zuk and the TzekHaar, but since OSRS already has Inferno and Zuk maybe she has additional ties to Kourend? It would be interesting to learn more about the Tasakaal and the Kahlith race, either in how they arrived where they are now, or perhaps they finally receive the further instruction they have been waiting for?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "With the shift of focus to big and small quests starting to happen, do you think we will ever get the Thieves Guild questline from rs3 put into OSRS? (Buyers and Cellars, From Tiny Acorns, Lost Her Marbles, A Guild of our Own)."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will we ever get a bit more Crandor lore? It used to be as huge as Varrock, yet we rarely ever hear about it outside of Dragon Slayer."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I really hope that the Red Axe storyline gets finished eventually. Are there any plans on finishing this storyline or at least expanding on it?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The Shayzien Crypts were built long before the founding of Kourend, yet have Xerician symbolism all around. Why is that? Is Xeric the reason for the tomb being overrun with undead? And what of the bloody tomb found collapsed into the floor across Camorra's tomb? Was that the tomb of King Shayzien VII?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "We know about multiple canon, yet unreleased, areas in the world originally designed by the playerbase; the Avium Savannah, Tepestus, Civita Illa Fortis, to name a few. One particular uncharted region has been a hot topic amongst mapmakers, yet has not been confirmed by any official source to be canonised. Can you give us confirmation that the settlement of Auburnvale exists on Gielinor?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is the Scar ever going to be expanded upon further, and even more, are we, the players, ever going to be able to go there?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What is the Zarosian symbol in the snowy area west of the Wintertodt? Is this hinting at some Zarosian involvement in Kourend? It’s been theorised that the symbol is Skotizo’s point of arrival after he took the Dark Altar from Karamja, hinting he was never a Zamorakian."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "A lesser question concerning the Lesser Gods of the Menaphite Pantheon: one point of divergence between the lore of OSRS and RS3 is the associations given to these Lesser Gods (for example Crondis being revised to be the patron of modesty and resourcefulness in RS3, while still being the protector deity of sensory pleasure in OSRS). Will the Lesser Gods be making an appearance in Beneath Cursed Sands, and if so, will they be reinterpreted in a similar way?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is Zanaris (on) the moon in OSRS? There's only one piece of in-game lore that points that way, and I was wondering if it's canonically so."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "During Dragon Slayer II, Zorgoth perceived the player character as someone who was a close friend of Robert the Strong in their past life. (\"Ah, I see you brought your friend with you. I'm surprised to see you here after all this time. Curious.\") It is only one line, and you're immediately interrupted by Dallas before you can get any sort of clarification. Who was Zorgoth referring to when he spoke to you? Will we ever get that answer in a future quest?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The post seemed a little unclear on how the mechanics would work. Can you talk us through this and how the minigame will work for someone who hasn’t read the blog?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What will the XP per hour roughly look like?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Do you have a particular type of player that exp is aimed at like, is it for more casual or earlier game? Or is it for literally anyone no matter what stage they're at?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How repetitive will the setup and refinement stages be? This is the real factor in deciding if the minigame is actually fun or a grind!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "If this is supposed to be a minigame rather than an alternative training method, then why are the resources for it not provided within the mini-game? For example, you don't need any external resources (besides basic tools/items to make it easier) for GoTR, Tithe Farm, Pyramid Plunder, Agility Arena, etc."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are you taking any measures to ensure that ores/bars as a resource are not devalued? This activity will consume less ores/bars and also reward ore bags, which is odd since Smithing is supposed to sink ore/bars out of the game. Does this go against Smithing's intended design?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Would you consider making the minigame free-to-play? It would be a way to get the ornament kits and gain the smithing experience heaper, without any resource or GP rewards. Given the item sink for low level items and some of the rewards being related to iconic free-to-play items (such as the hill giant club) it could make sense."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There seems to be a general opinion that this minigame, while it might be fun, does nothing to address the actual usefulness or application of Smithing as a skill within the game. Do you intend to continue to rework or address this problem with the skill beyond adding a minigame and what are your current thoughts around how you might address the issue?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "On the blog it was mentioned that Giant’s Foundry being possibly profitable, how much GP/hour can we expect?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will Giant’s Foundry have a reward system similar to Tempoross and Guardians of the Rift?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are you considering improving the rewards? At the moment it seems very underwhelming (particularly for mains) and the cost of bars is quite high per hour against simply smithing the bars into alchables. Is there a chance of a Smithing Skilling Outfit? If not, why didn’t you want one like other minigames?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you explain how the requirements worked? It says 20 wilderness kills or an LMS win. According to my collection log I've only played 8 games of LMS with 3 kills and 0 wins. And I don't think I've even killed a single person in the wilderness. But I was able to vote on all the questions?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There were changes made to these rewards based on community feedback prior to polling, and they still failed the poll. Will you adjust how feedback is collected and used for changes made to these rewards?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Could the arena still be released and have the completed rewards come out separately? This would at least allow for people to play the arena and give adequate feedback on the initial launch as you guys are updating the rewards."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The high barrier to entry of making some sort of PVP account has been brought up before as something that deters people from wanting to get into PVP. However, adding equipment that can only be used in PVP serves to fracture the game, and gives the perception that PVP is a separate game mode. Do you believe that the correct approach involves separating the reward structure of the two communities? Or do you think it will worsen the predator/prey problem, because anyone that's killing wildly bosses, or something non-PK is unable to use the new BIS or near BIS equipment that their stacker is likely to be wearing?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "It seems that players don’t like the idea of restricted polls, will this change you might consider polling in the future?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What is the current status of the wilderness boss rework? We have heard no information since the summer summit on it and the roadmap had it coming out in June/July."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we please poll a buff to Thammarons sceptre, the laughing stock of the Wildy weapons? It's been suggested 20+ times with significant upvotes but never addressed by the team."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "People keep complaining about the wilderness being \"dead\". Why not move risk fights and pking that exist in pvp worlds back into the wilderness by removing pvp worlds?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are there any plans to design any new Wilderness bosses that aren't in Multi combat? It would be nice to try something new but without the risk that a team could jump me. Don't mind the solo PKer interruptions."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you remove the number of players required for a High-Stakes LMS game to start? As it stands, you need 24 players to start a game and they never start anymore. Can you drastically lower it?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will we get to see another Deadman Mode along with the re-run of the finale? The Last iteration was one of the best yet (aside from the finale issues)."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Has there been any discussion about expanding the places we can unlock the wilderness weapons? The rev caves are the only place you can get them and being a 1/20k drop while being risky isn't the greatest. Can we spread the three weapons across the 3 main wilderness bosses with a better drop rate so we have more options?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Do you think we can see a day where people can freely bring items into the wilderness and be safe? They would have to put money in a coffin to increase drop rates, skilling exp or barriers to entry to certain content. That way more people will bring fully geared armour into the wilderness at the cost of what's in a coffin for PvPers to be rewarded with instead of equipment and inventory loot. So we can change the wilderness into a situation where anyone can be prepared for PKing each other."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "New designed areas always have single path tracks that are frustrating and reduce immersion. Darkmeyer, Shayzien, Prifddinas, Necropolis all look nice but are awful to navigate due to a lack of gaps in the obstacles and landscape. Compare this to Misthalin/Ardougne/older areas. Could we consider reducing the object bloat in these areas and freeing up more space to run around?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we remove the dialogue options you added to NPC Contacting the Dark Mage in the abyss to repair pouches? Before you could just hold a spacebar as long as you had gotten the book, now if you have the colossal pouch (and I think even without it) it has options you have to choose. I thought the point was to remove monotony?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Could twisted tales include favour certificates that apply to any house like Client of Kourend does? Small ones would incentivize people to play the quests to avoid doing some of the favour grinds people dislike like mining sulphite, making shayzien armour, healing soldiers, etc., and would make a great quest reward IMO"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Could the team look into improving shooting stars to encourage group participation? Current experience rates right now are fine as is, but in non-total worlds Clans and Discord communities constantly pile every star, penalizing everyone else and solo scouters."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When can we expect endgame mainscapers to get some love again? Aside from raids 3, which is long overdue and was announced ages ago, it's been (and going to be) nothing but content for ironmen, mid game players, and content creators."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Any eta on when the “smaller” rewards will be polled for Raids 3 as per March’s Gazette?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How does the Nex drop chance actually work? There has been a lot of discussion around it. Does everyone who has met the damage threshold have the same chance of getting the drop? Or does it work like this: you deal 400 out of 4000 total hp to Nex, and you have a 10% chance of getting the unique? Does contribution% actually matter? Because I feel it should be the second option. If you deal 10% total damage then you should have a 10% chance of getting a unique."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How do we shift from the reliance on Dragon Warhammer/Bandos God Sword for bosses and incorporate the magic spells for reducing attack/strength/defence as a way to kill bosses?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The recent addition to the Level 65 attack Tier, the Keris Partisan, is super nice and very welcome! Could we see some additional T65 weapons in the future?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Has there been any discussion for a new higher level slayer boss yet? Maybe a level 97 unlock?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I love the way the current meta for high-end items is to dismantle Bandos/Armadyl parts for the new tier 80 armour. Do you think we can see this concept return for lower-tier items to create much-needed item sinks for new items?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Arcane, do you want to talk about some of the new changes we proposed in the blog that just went live?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will the accuracy and damage triple passive only work with the inbuilt spell or with all spells casted while wielding the staff?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I liked the Heka, can we still have it?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "We can’t equip the ward at the same time, is this a problem?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Magic is still kind of broken, why not fix magic as a whole?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Weapon doesn’t have any strict drawbacks like scythe/tbow, is it too strong?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can Harmonised staff be buffed? Can you fix the autocast on it?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Lots of MMOs and other popular games use events to boost engagement. One great thing about Old School is how conservatively this is applied. What can you do to reassure players that OSRS won't lean too far into events and other limited releases?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How will the raffle tickets affect your chance of winning? Because it works as a raffle? Right? It's not like the most amount of people, the most amount of points wins. So can you explain a bit more about that side of things?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are we planning or looking at implementing the raffle system for other types of accounts?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will there be Free to Play bosses added to the Boss Bash?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will there be a penalty for Group Ironmen who joined a team just to win the raffle and then leave straight away?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What are our plans to stop cheaters from winning the raffle?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can the raffle be broken down by team size? For example, a five-man team might have better odds at winning against a two-man or three-man team."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Where is the negative feedback on GIM tradable untradeables? Most feedback appears in favour. Why wasn't it polled and would we be open to Polling it as most GIM players seem to feel in favour of this change?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "We’ve seen a fair amount of feedback asking about raising GIM Group Numbers. Could we raise the player cap for (Unranked) Group Ironmen?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Could we allow regular ironmen to join Unranked GIM Groups? If there are no HiScores and the goal is to have fun with friends, this is something that might increase player accessibility."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Do we plan to allow GIM to change to regular ironmen?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "We saw some questions about future GIM Group content. A lot of players seem to want things like partner slayer. Can players expect to see this return in any capacity?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When can GIM display their prestige status on HiScores?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "We've had players really express their interest at seeing their boss HiScores on the HiScores. I know that this has proven to be technically difficult. Would you mind giving an explanation as to why this is so difficult?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are incorrect group sizes going to be fixed on the HiScores?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Do unranked Group Ironman accounts appear individually on the main HiScores?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Would we ever consider allowing them to appear individually on the main HiScores?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "We saw some questions and concerns of the Unranked Mode from those who might see them not as players who achieved their items, but rather paid for high level unranked GIM to sell you items via black market concerns. In light of this, would we consider removing/changing the GIM symbol or armour for these new unranked GIMs. The main reason for this is the issue where, in-game, Unranked GIMS would be pretty indistinguishable from actual GIMs which doesn't seem right to some players. Should we look at giving unranked GIMs a different symbol/armour or something like that?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What is the main difference between an Unranked GIM and a main account?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How do groups deal with items when becoming unranked? Do you still lose all tradable items?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Have we considered reworking the group storage functionality to protect groups? A player has got in touch saying that removing the trade restrictions entirely means people can jump into groups, steal all items from the group storage and run off."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Would we make solo bosses available to group irons as well with unranked mode? Group Jad, Zulrah, Inferno, etc."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will there be restrictions on how often unranked GIMs can join other teams?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will we be looking at Player Owned Houses again? Players have requested a single house to use together, or a house which members may access while their owner is offline. It could be locked specifically to the group's home world."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What is the real explanation or lore for where the smithing gear came from? I'm not buying that Kovac got it from just \"somewhere\"..."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The Sleeping Giants quest ends very suddenly. Could you perhaps add a bit of post-quest dialogue to Kovac?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there a possibility for us to see a new questline coming along with the Giants or having the Giants tied to another questline - like the trolls were for the dwarven questline in RS3? I really would like to see more of Kovac, Obor, the hill Giants and the other ones."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Pet when?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How do you actually calculate alloy quality?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will it be possible for future quest rewards or other content rewards benefit Giants' Foundry. Stuff like more moulds, or something to make the game feel more ingrained into the world?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Could we have the ability to store bars in the crucible and select an alloy ratio? For example 400 mith bars and 600 addy bars stored, smith a preform with a 14 addy, 14 mith alloy."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What are some memorable bloopers or bugs during the production of this activity?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The colours on the HUD seem too vibrant. Is there any way of changing this by turning the colours down slightly?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "For Giants' Foundry what level do you need to have to use different bars? Like is it based on your ability to smelt them? Like if I can smelt adamant but not rune I can only do up to adamant? Or can you just use rune stuff at any level?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are the commissions we get purely random, or are there weights on which can show up?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you make the Foundry UI smaller in fixed mode? Right now it takes up 1/3 of the screen."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Could we get a better indication of when states are changing, with maybe a bit of leeway? Currently it feels very punishing, you can’t look away for even a second because you have to click on basically the exact tick where it goes over or you’ll get damage. It’s fine while this is a fun novel activity but it’s gonna get old fast."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why is there a penalty for perfectly positioning the preform right before the sword transitions temperatures? Currently, if you are about to swap from one temperature to another, and the yellow box appears to gain double completion, if it ticks over into the next temperature, you will lower the quality of your blade."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Whether it be via variable gameplay (i.e. spiked swords requiring an extra step in their creation) or via visual design (i.e. having a different preform shapes based on your mould), was there a point in development when there was more to the mould mechanic? If not, would you like to expand upon it in such ways?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Any chance we can get rid of the animation at the end of smithing the sword? It's a little annoying having to wait on that to finish before you can turn in the sword."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Right now, some moulds are just straight upgrades from others - I obtained the Defenders’ Tip for example, which is just better than the Saw Tip I had. Could the upgraded moulds replace the existing one, instead of having them both show in the list?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why was the bar bag that holds 27 bars scrapped as a reward idea? Any chance it'll be added later or to different content?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "As costed at one catalyst per bar, it's just too expensive to go out of your way for. Is the team considering buffing the Catalyst or are they happy with where it sits?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we please get the ability to trouver parchment the Colossal Blade, or the ability to buy it back from Perdu?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Could we give the Colossal Blade an extra tile range like a halberd? Right now it doesn't feel all that \"colossal\"."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Where does the team believe that the Colossal Blade is worth using?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "It feels like spending 4000+ points on all the moulds is redundant when you can just spend those points on rewards instead (as far as I understand it's about 15% more points with the best moulds?). How were the mould prices decided on?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we get clarification on how the smith set works inside the minigame? I have 2/4 pieces and it doesn't seem to do anything."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there any possibility to add more rewards in the upcoming weeks? Right now I have 8k points on the day of release, I'm gonna get my outfit and cannon mould tomorrow likely and then I have no reason to ever come back to play that minigame because there aren't any rewards and I get better XP doing other methods of training."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Could ore packs scale with your miner level and give ores accordingly? There's already tons of ways to get coal, would be nice if the ore packs were a bit more rewarding."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Could the Colossal Blade be made tradeable?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Could you please add the moulds to the Collection Log? Feels weird they aren't in there but purchasable in the shop."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "At the last Giant's Foundry Q&A, Mod Oasis mentioned that this was the smaller of two skilling updates planned for the year, and how Giants' Foundry helped the dev team consider ways to rework Smithing. Is there anything you can share about the potential larger update, and possibly your plans to address Smithing on a larger scale?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is the team still reviewing the recycle mechanic to allow for some items to be more efficient to melt than to alch (for mains or irons)?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Do the devs ever consider creating a new method for skilling that actually ends up as best XP per hour? We've seen PvM introduce new best in slot gear, but skills get mini games (some very fun) that are never meta-defining outside of Hallowed Sepulchre."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is it possible if, when putting platebodies and other stuff into the crucible, the all option could maybe be replaced with a \"fill\" option, or the \"x\" option would remember your previous amount?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Since the collection log was added to the clan broadcast system, I've noticed a lot more people have been interested in collection log hunting. Can collection log slots be added to the hiscores?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "With how frequent use of prossy armour is, are there any plans to add another tier or perhaps to continue the Slug Menace storyline?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why did Jagex change the Polling process to become more about validation at the end of development, rather than greenlighting at the beginning of development? Updates fail polls when not communicated properly. Can you go into more detail about why updates are being polled so late into their development?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What does the future of restricted polls look like? There was some pretty significant backlash after this last one, and people (myself included) have some very valid concerns about them."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Could we possibly see a Fossil Island expansion in the form of a new island in the vicinity, where we're able to fight Skeletal Dinosaurs/Dragonkin Experiments? Would be interested in a combat-agility hybrid."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Currently, dungeons are basically just another field with a bunch of grouped mobs. Have you considered adding some form of linear dungeon to the game? Linear dungeons could generate group play and interesting dungeon content."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is the team happy with the place that the ancient crystal sits in the rev caves? Wildy Slayer might be a good place to have this drop in my opinion, either in the Larran's chest or a rare drop from Slayer monsters."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Any possibilities of adding something to do with extra Hespori seeds? I do Hespori on a regular basis but still have years worth of seeds."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "In Giants’ Foundry, when adding items to the crucible, can the “Add 5” and “Add 10” options always appear instead of only when that number of items are in your inventory? Currently, the “Add all” and “Add X” options use different keyboard numbers depending on how many items are in your inventory, which is quite annoying."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Could we use clue scroll reward rewards for the Giant’s Foundry? Like trimmed and Heraldic? This would allow for a sink for these items other than Alching."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Any thoughts on making crystal tools corruptible? I've been playing a lot of GOTR lately and it's just sad seeing my crystal pickaxe go unused because of how fast the charges go."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I think the community understands that you think reinforcing the predator vs prey dynamic is good. Can you tell us why? Clearly, a lot of the community doesn't it, and fundamentally a lot of the community votes no to content they don't like, which is the reason the polls exist. Why not, for instance, replace non-PvP incentives in the Wilderness with PvP incentives so that you still get the predator vs prey dynamic, but all parties involved are there because they like PvP?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Where do you see Old School in 5 years? What would be some major long-term goals for the game as a whole moving forward?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When do you anticipate Ironmen will be able to convert to unranked GIM?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "With Tombs of Amascut having an invocation system and the game jam blue inferno having modifiers, where does the team see these types of modifiers fitting into the future of Old School RuneScape?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Would it be possible to make stuffed heads function like boss lair jars, and not be lost when switching them out? For how rare they are, most of them sit in the bank since you lose them if you ever get a new one you want to display."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Now that other players can enter the POH of an iron, can you enable the feature to allow us to post bulletin advertisements so we can host?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are there any plans to expand the history or lore of the werewolves in Canifis? Possibly a quest line to \"cure\" them?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are there any plans to add birdhouse seeds in packs to the game, so Ironmen don't have to hop-scape to get them?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What is the status of quest porting? Would love to see While Guthix Sleeps and the Mahjarrat storyline."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can Abyssal Sire and Cerberus have one central 'peek' option that checks all the areas at once, or even be given optional instances, since they are solo bosses? I realise some people may want to keep the non-instanced versions for alt methods. GGs, Kraken and Hydra all are instanced by default or have the option."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can the mounted dig site pendant be made to work like the mounted glory? Right-click menu currently shows only your selected left-click, whereas glory shows all 5 locations. Would be nice to have that unified!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Now that RuneLite-esque features have been implemented into the mobile version of the game, are there any plans to implement them in the desktop version?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "With the release of the new mobile app, how will further changes to the app be managed? There's obviously a long list of plugins used for clients such as RuneLite. Will you choose what you feel is appropriate for the app or will there be another method of customisation? I personally would love to see ground items as that's my biggest drawback with playing on mobile."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "With the recent update bringing some much-needed QoL to the mobile client, I’m curious to hear where the developers stand on integrating a feature similar to the Menu Entry Swapper plugin on RuneLite."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Does the team ever plan to collate all the areas of the games with counters / kill counts / timers etc. into the one menu? I would love to see these get some TLC and be trackable without having to run to a heap of different game areas to create screenshots."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Now that the PvP arena rewards have been settled, what is the general goal behind the Wilderness boss rework?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why was the exit to the rev caves moved even farther from the entrance?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Gaining Wines of Zamorak by planting the grapes, harvesting them with the blessing and finally making them with Jugs of Water is a great addition to the Ironman way. But the fail rate is way too high and really demotivating. Could the success rate be boosted, so it's a viable alternative to tele-grabbing them? Maybe lower the XP rates to balance it."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What progress has been made against the upcoming Wilderness Boss Rework? Are you able to share any information regarding the scope of the project?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will there be more calquat patches/uses for the seed saplings? Calquat is so underrated and unused for such a lovely plant!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Now that NPC pathing was added with Nex, can we see that technology implemented to thralls?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can Abyssal Bracelets be buffed to prevent Prayer points from draining when you enter the Abyss?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we please look to extend the 5 min AFK logout timer? For many that feels far too short."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What are the developers' opinions on adding content to otherwise useless quest areas in the game once their quests are done, such as adding high-level mining spots inside the underground pass or a high-level agility course in Meiyerditch?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will the team look at the Corp drop system, especially now since with Raids 3 the shields represent a progression item? Corp is very clearly intended to be a group boss. Can we shift the drop system to be like the other bosses of its calibre - Phosani’s and Nex - so that irons and solo players can find small teams to do the content with as intended?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "In the January Gielinor Gazette, there was the mention of a Corrupted Rat boss for f2p. Has there since been any further development on that project?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will the toggleable blood fury ever be polled? It was brought up on a Q&A last year and had lots of support from players and jmods at the time."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Would you be open to reworking the Shades of Morton coffin? It’s currently one of the clunkiest items in the game to use."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are there any plans for a clue scroll expansion? Either new clue steps are a whole new clue tier above master? Grandmaster maybe? It would be fun to have some ridiculous clue steps from an even rarer tier of clues."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Wildy Boss Rework news? It wasn’t mentioned in the Gazette and has been delayed. Do you have any updates on this?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "As someone who hasn't been involved in any kind of PvP in OSRS, do you think I should try out the PvP Arena? Does it cater to people just starting, and what incentives are there for me to try if so?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Do Jagex have any future plans of hosting their own events/tournaments? There’s no doubt players like Oda will be hosting community-run events, but I feel monthly or maybe even weekly “official tournaments” with ladder ranks & similar flex prizes would be huge for PvP."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Could the PvPA be more made like the WoW arenas? I want to be able to play the main game. Get a queue pop, jump in the PvP action with a maximum of a 1 min timer to make little changes to my gear/setup and then jump right in the action."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Have you thought about adding a “copy opponents gear setup” option?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why don’t you guys just update Bounty Hunter instead?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "We ever getting noob-friendly setups/rules? Could be fun only with no rewards. BH style PKing I mean."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "With the PvP Arena making Pures an official character type, is it possible that we could make removing defensive attack styles possible through the main client rather than a 3rd party client? Could we get the same type of support that we get for Ironmen for niche account builds that limit their stats to certain levels?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will Prayer Reorder ever get added to RuneLite? It failed a poll by 2% previously and with differing loadouts in PvP Arena main/pure it's annoying as someone who solely PKs as a main to use 15% prays."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we just have multiple different presets players can choose from, or a \"copy opponent option\"?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are there any plans to expand the PvPA to include a 2v2 mode?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you put a big arrow over the heads of people who haven't readied up for tournament fights so everyone else can flame them?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "With the new PvP updates, have you ever considered a PvP minigame which is purely based on skilling? I understand this sounds daft but what I mean is Something similar to Wintertodt or Zalcano which pits teams against each other for a reward?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Have the rewards that failed been entirely scrapped, or is the team looking at polling a new way to introduce them into the game, and considering whether it would be through PvP or non-PvP related content?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The PvP Arena needs some better rewards, untradeable and tradeable rewards. How are you gonna tackle this?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why invest so much time into a piece of Game Mode when there are essentially no rewards to it, which will mean the Game Mode will die because there is no actual reason for good players to consistently go there."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will there be any plans to add the failed cosmetic rewards to content in the future? They look super cool and it would be a shame to let them go to waste."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Have you considered adding rewards that would be useful for players trying to skill/PvM in the Wilderness? Items that may only work while unskulled."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can Wintertodt damage be changed to scale based on your current hp, instead of hp lvl? So at 10hp left you'd be hit the same as current players with lvl 10hp get hit. This doesn't punish players for not rushing Wintertodt on a new account."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why do so many PvP minigames/modes use the NH format? Wasn't the minigame supposed to have a diversity of builds?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Now that we can get back pets if we have a place holder in the bank, can the same be done with an untrimmed skill cape that also has a placeholder in our bank?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we get a nerf to Chambers of Xeric and Theatre of Blood after Tombs of Amascut release? OSRS recently got an influx of new player. Jagex can't expect a new generation of player to perform like the older players. People like doing easier content than doing difficult content, for example WoW Classic raid vs WoW Retail raid. The skilled player can do Tombs of Amascut or Nex. Chambers of Xeric and Theatre of Blood can cater to people with lower skill sets."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is it possible in the future for f2p players to sell members items they held previously?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "In a past Q&A, Mod Kieren talked about his intention to give to run energy a proper QoL update e.g. make it restore 5x-10x faster when we're idle or making pots give a much better restore ratio/ longer effect...Are those plans/ideas still in development?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we please rework/revisit coin pouches? Methods for cheaters to circumvent this mechanic are already prevalent through bot scripts and other macros, meaning that the only players punished are the innocent."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can the Redwood abyssal lantern prevent pouch degradation outside of Guardians of the rift."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "For placement of spells, can we get the option to decide what runes are in the pouch?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Any chance the hit box for the top of the agility pyramid can be expanded on mobile? It's so hard to actually climb on mobile without clicking to walk somewhere else."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Thoughts on a 1-use potion that would remove freeze/root?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Once a human warrior, Akkha made the mistake of joining a cult dedicated to the original form of Amascut, before she was corrupted into the Devourer. This cult had one desire: to be reborn in a perfected form. They performed a ritual and called upon Amascut, sacrificing themselves in her name. However, the poison used by Akkha failed to work correctly. He survived, trapped on the brink of death, becoming a perfect servant to the Devourer."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Ba-Ba was once the matriarch of a large troop of baboons. As she grew old, she feared for the future of her family, considering her heir to be incompetent. Amascut promised her immortality so that she could rule her family forever. However, in return, she demanded both Ba-Ba and her family serve her. Ba-Ba agreed, and was willingly corrupted by Amascut. This corruption granted her the immortality she desired, but bound her to Amascut."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Kephri is the last of an ancient race of long-lived scarabs. She lived in isolation for years, watching the desert from afar, gathering knowledge as she did. While initially content, over time, she started to desire children to pass her knowledge on to. Amascut claimed to have a way to give Kephri the children she desired, promising to make her a mother of scarabs even smarter than she was. However, Amascut twisted these words, destroying Kephri’s intelligence, making her nothing more than a mindless thrall."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Zebak was part of a large group of crocodiles living in the Elid. With so little food available, the group had to rely on their resourcefulness. However, Zebak was weak, and was unable to compete with the others. To survive, he used his resourcefulness in another way, luring the other crocodiles into traps so he could kill them and take their food. Before long, he was the only crocodile left. With nothing left to eat, Amascut promised him a lifetime supply of food in return for his service. He willingly agreed."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The Masori were powerful ranged weapon-wielders active during an ancient Kharidian war. They focused primarily on defending ordinary people from the violent thieves and murderers who sought to take advantage of the wartime chaos. This mighty clan has been long since disbanded, but their weapons can still be found in the palaces of wealthy Menaphites, and among the treasures of long-dead Pharaohs."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When forces of the Ruinous Powers arrived in their lands, Tumeken and his people found themselves facing an enemy unlike any other. While his children, Amascut and Icthlarin, sought powerful allies to aid them, Tumeken hunted down a weapon of great power to use against this new threat. However, rather than claiming this weapon for himself, he instead used it to create the Shadow of Tumeken. This staff is powered by the sun itself, and with that brightest light comes the darkest of shadows..."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Elidinis was the Goddess of Fertility and alongside her husband Tumeken, they were the joint leaders of the Menaphite Pantheon. But while Tumeken and Elidinis steered the people of the Kharidian Desert spiritually, it was the responsibility of the human Pharaoh to rule in practical matters. Osmumten was the last Pharaoh before the end of the ancient war, and he fought alongside Tumeken against enemy forces until the noble God sacrificed himself to end the conflict. After her husband’s death, Elidinis fled to mourn the loss of her family. Before she left, the Goddess gifted Osmumten with Tumeken's Heka and her own broken Ward."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Known to his people as Osmumten the Hunter, he was renowned for bringing down many of the land's deadliest beasts. During his hunts, he wore armour and weapons crafted by the region's finest artisans. One such weapon was his Fang, with which he was eventually buried."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Ahmek was a formidable warrior who sought to capitalise on the political instability at the end of the war. He crafted a powerful ring which he imbued with the unstable energy left behind from Tumekin's sacrifice. Ahmek sought to use this ring to emerge as a new power in the region; by forcibly uniting thieves and mercenaries under his command, he would overthrow Osmumten. His scheming proved fruitless, however, when the ring was stolen, and he was murdered in his sleep. The Menaphite Guards claimed the ring from the body of the murderous thief and dutifully presented it to the Pharaoh."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What do you currently work on at Jagex?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What has been the favourite piece of content that you’ve worked on so far?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Mod Daizong, you worked on Leagues, and a player mentioned that the Activity Adviser looks similar to the Leagues tasklist. Is that where you found inspiration for this system?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "For players who have not gotten into the A/B testing period, is there a way that they can get in? When do you expect them to be able to try using it?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can the Activity Adviser be toggled OFF, especially as it is close to the Special Action button, which is clicked many times?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why did we decide to put the Activity Adviser underneath the Special Action button, and are we open to feedback about changing the location if players prefer it to be somewhere else?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can returning players who have completed all of the Quests expect to see more Activities recommended to them? Players are curious to know whether we would develop the Activity Adviser to Bosses, or money-making, equipment, achievement diaries, etc. What are your thoughts on this?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Many players like to set their own goals in their gameplay. Will the Activity Adviser include the ability to create specific tasks or add a ‘reverse feature’ which allows a player to set their own goal so they can be advised on how to achieve it?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can Activities be queued up, or can only one activity be advised at a time? Can players expect to see a running list of tasks, or do they disappear depending on what new activity the player is doing?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can the Activity Adviser be customisable per account type? So, for example, a 10 HP account or Skiller."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will there be an option for grouping involved? For example, having an option to find a group before embarking on a minigame or quest."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will the Activity Adviser differ in F2P? If so, how?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will the Activity Adviser be linked to the existing Adventure Path interface/NPC?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Have we looked into adding rewards to the Activity Adviser to encourage more retention?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "With the feedback seen about the Activity Adviser, is there anything extra that you wanted to add in?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Lots of players are asking us about any plans to revitalise F2P following this update. Is there any thought of potentially opening up some of the achievement diary tasks to F2P, or adding a F2P Boss such as a Giant Rat or a Giant Goblin (which would perhaps fill a gap in having early to mid-game group content)? What are the panel’s thoughts on this?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What considerations would we need to keep in mind if we made changes to F2P?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What made you subscribe to OSRS?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How do we go about getting feedback from newer players, particularly from those who might not be interacting with the community on places like Reddit and Twitter?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How do we encourage new players to care enough about the world of Gielinor to stick around?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "A lot of new players struggle with getting around as they are not as familiar with teleports and may not have access to Agility. What are the panel’s thoughts on this? Do you think Agility would ever become F2P?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you tell us a little bit about yourself? What do you do on the team and who you are?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What's your role? What are some of the things you've worked on in terms of RuneScape 3 and Old School?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What is your experience with Old School?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What's your most favourite thing about the game? And what's your least favourite thing about the game?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "If you could add one thing without a poll, what would it be? And if you could remove one thing without a poll, what would it be?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Do you recall the tallest person you've ever met?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What were some of the biggest challenges you guys faced in creating the Clue Scroll Helper?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What was the reason behind adding the Clue Scroll Helper in the way that we did? Have there been any considerations to changing clue scrolls themselves?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are there plans to add a puzzle box Helper to the new Clue Scroll Helper?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How will the inclusion of the Clue Helper inform the design of future clue puzzles? Will there be more puzzles that are not solvable by a Helper plugin? Will the puzzle design remain mostly unchanged?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "For Bruno specifically, what was it like QA’ing this work? Any fun bugs that you found?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "We have 5 different tiers of clues, and because they were made at different times, they work in different ways. There isn’t a full consistency across all the tiers. Have we looked at addressing inconsistency in this area, for example with the NPC behaviour between different tiers of Clue Scrolls?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will stackable clues ever be coming for Old School? They are in Leagues and RS3 but is this something that players could ever expect to see in OSRS?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Thanks for adding the Blast Furnace pipe-highlighting on mobile, it helps with Irons who craft there. What inspired this change?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are you still planning to change the Mobile UI? Are you looking to address the player feedback from the initial Mobile UI Blog?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What are you guys working on next for the enhanced client?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I’m always prompted to use 2FA every time I log in even when I click ‘remember me’. Is this a known issue and what is causing this for so many mobile players?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "In regards to new client features, can we turn off other players’ action noises such as mining, woodcutting, etc? Sometimes when I AFK I rely on the noises of my character, but other players doing the same activity can throw this off."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we add a warning message on Steam to the ‘X’ (close window) in the top right? It’s a nice feature to create to avoid accidentally closing your window while playing."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we see left-click reset box traps on mobile?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I know a lot of people have asked about the NPC highlighters, so I don't know if any of you could go into why it wasn't featured on mobile."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Would it be possible to save your minimap zoom level? It’s annoying when you log in and it’s reset."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are we getting skybox and maybe fog on the mobile client? Also, can we have an option to unlock zoom and viewing angle on the camera on mobile?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "With regards to ground items, would it be possible to only display your own ground items as ironman?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why are you implementing Fresh Start Servers, who are they for, and how does it benefit the game and the playerbase?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Additional game modes can segment the Old School community whilst also taking up valuable dev resources away from the main game. Are Fresh Start Servers going to take up a lot of dev resources from the main game? Is leadership concerned about the number of game modes that are in OSRS?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How much of the player survey that was run a few months ago, or RS3’s plans to introduce Fresh Start Worlds, influenced your decision to proceed with the idea of Fresh Start Servers on Old School?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are Fresh Start Servers a complete replacement for Leagues?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When is Leagues 4 coming - can we have any information about it?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why do players need a brand new account to play on the Fresh Start Worlds? Players do not require new accounts for other game modes like DMM and Leagues. Is this a way to entice members to pay for more subscriptions?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why did you decide to implement Fresh Start Servers without polling how the current community feels about it?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How is this going to affect the economy once FSW is over and all the accounts are migrated over to the main servers? Is this something that has been taken into consideration?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Fresh Start Worlds do not provide a new experience to the existing player base. Have you considered releasing 2011scape or RS Classic instead of Fresh Start Worlds to provide a new and unique experience?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What can you do to improve the current server quality and stability? There are slow logins/hopping, world lag after 400 population and 2200 total world lag. When the servers become highly populated, and when players do activities that are more server-intensive activities, servers seem to run poorly, which causes issues."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will the release of ToA have a negative impact on server performance?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you address recent world crashes? Is anything being done to restore lost items in GIM Storage for those affected by a world crash?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you explain where the roadmap is to players? Will there be a Summer Summit? What can players expect to see in the next 6-12 months?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Typically Jagex used to share important upcoming news via Runefest. Will there be a Runefest happening this year? If not, when? Mod Pips confirmed it hasn’t been scrapped on Twitter, but we have heard nothing since. Can you give any more details about Runefest, please?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Players will often equate the number of devs on the Old School team to the frequency and the quality of game updates. Players are looking for more main game content to be added. Are you hiring more developers to give content to players faster than what’s currently available?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "We have had one poll this year, which has taken a long time to release; it was blogged in February and still has yet to have some items to come out, such as Poison Dynamite. Why have the Poll 76 changes taken over 6 months to release? Additionally, do you have information about Poll 77?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What are your future plans with DMM and Bounty Hunter?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Do you have more news on the Wilderness Boss rework project? Why has this project taken a longer time than expected to release?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you give some information about the future of the mobile client and what changes might be upcoming?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will there be more 3rd party client bans, or was it a one-time thing?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you give updates on Account Security and Jagex Launcher progress since the last leadership livestream in March?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are you planning to do anything about GE spam bots?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There are many places online to buy gold and sell account services. What is Jagex doing to combat this?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Firstly, tell us about yourself! Who are you, and what do you do?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What is your experience with OSRS?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What's your most favourite thing about the game? And what's your least favourite thing about the game?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I hear you might be moving away from QA soon?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Lastly, Did you come across any bugs that you caught before ToA’s release?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How has the release been for everyone so far?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are you happy with the outcome now?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "We’ve passed 1.5 million completions of ToA. Did you think the uptake would be this massive?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Raids 4 when?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "We’ve seen a lot of questions about Ornament Kits. When can players expect to see the Ornament Kits for Ava’s, Osmumten’s Fang and the Ward of Elidinis?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How about pet transmogs?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What is being done to address widespread reports of inconsistent server stability/lag after Tombs of Amascut?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What is the point of making logouts count as a death in ToA?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are you currently working on giving players the ability to make presets for invocations? If so, when can players expect them?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is it more profitable to do ToA solo than in a group?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are you going to release the drop rates for ToA?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Shadow is awesome outside of ToA but average inside the raid. At the moment, I think it’s an improvement for 1/3 of Akkha, P1 Warden, and half of P2 Warden. Was there any intention for it to be used as much as Twisted Bow in CoX, and Scythe in ToB, or was it meant for outside of ToA?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I’d love it if logging out paused the raid instead of completely resetting it. Sometimes it’s hard to get it all done in one sitting, and I would love to be able to do it one path at a time. What do you think about this?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Many players did not realise the upgraded Ward of Elidinis would not be tradeable, why was this made untradeable?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Does dying affect chances for purple drops?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Would it be possible to save invocation setups?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Would it be possible in future to have an option to remove unnecessary dialogue to speed up our runs?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What did you learn from Chambers of Xeric and Theatre of Blood that you used for the design of Tombs of Amascut?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What mechanics are you the happiest with across the whole raid?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "A long time ago, there was a person who went by the name of Mod Mat K, \nWhile working on the game, he had an idea one day. \n\nHe wanted to create a treasure hunt harder than anyone knew, \nSo he decided to create Crack the Clue I and II. \n\nThe first one was released and ended in a success, \nIt took longer to solve than anyone would guess. \n\nThe second one went by a bit too quick, \nAs players realised they could just use the brute force trick. \n\nBut now, Jagex wants to create something even more difficult, \nSo the search started to find someone else to consult.\n\nFinally, they found the one after looking far across the sea, \nMy name is Woox, and I'm the designer behind Crack the Clue III!",
      "Woox narrating the announcement video"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Get ready for the 12 days of #DragonSleigher!\n\nEach day we'll be posting dragon-related clues to our Twiter, Facebook & Instagram which can be solved in game. Solve the clue and you'll start a christmas loot explosion!\n\nThe first clue will be released tomorrow. Good luck!",
      "From the official Old School RuneScape Twitter account"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Now that Raids 3 has been released, when will we find out about future updates? We’d love to see what the roadmap has in store next!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When can we start storing multiple accounts on Jagex Launcher?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you tell us a bit more about the projects which were presented in your last Game Jam? We’d love to know which if any were green-lighted to go further. Also, were there any that didn’t get a response you had hoped for, but you think would be a significant contribution to the main game?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can the Jar of Darkness drop rate be looked at again? The previous poll failed by 3%, presumably partly because the 1/500 rate that was polled was still too rare for some voters. Also, when is the next content Poll coming out?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What new ideas or pieces of content would you love to see in the game, or what changes would you love to see implemented for existing content?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There has been a lot of concern from the PvP community about the way that PvP rewards get polled. Players are worried that perfectly legitimate items will fail the poll due to spite voting. What are your thoughts on this in light of the recent Wildy Boss Rewards? Can we restrict all PvP questions in the future, or even put them into the game without pulling them at all? You already have a PvP discord for legit feedback."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are there any plans to address Phosani's Nightmare? It's one of the toughest bosses in the game, but GP/hr is now lower than far easier content. Why would mains kill this boss rather than the Giant Mole?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Any chance the team would revisit the idea of changing Shopscape for irons? One of the most tedious and pointless things in the game is having to hop a 100 worlds so you can stock up on runes."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will the ToA design philosophy be used for most/all future content? That is, the concept of having a boss that is easy at its core, but which can be made more difficult by turning on optional mechanics? Will we ever see something like the inferno or ToB again?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When are the ToA Combat Achievements expected to come out?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There has been a somewhat unwelcome trend creeping in new content releases where untradeable random drops are mandatory for doing the activity efficiently. Going dry on these items feels terrible and there is literally nothing that a player can do to control it. Would you be open to adding \"bad luck protection\" to these items, or better yet making obtaining them guaranteed by some alternative means?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When will the diversity and inclusion changes be made? June's Gazette predicted it would be the end of September, yet many (if not all) have not been made."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How does the drop rate/items get chosen for new content? Some newer bosses have hideously long grinds."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are there plans for more updates to Slayer? I'm itching for new monsters to fight!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Newer skilling activities like Foundry, Guardians of the Rift, and Sepulchre are really engaging, but they're usually smaller in scope. If you made a skilling activity that was larger and more comprehensive, like raids, what might it look like?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What's the rationale for what items can and can't be added to the costume room storage in the POH? Obviously you don't want it to just be a bank replacement and have every useful armor, but what is the distinction between Dagganoth armor and Granite armor for example?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What made you decide to put the Dragon Pickaxe source to a vote?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are any mini-games that aren't as active anymore being revived with new ideas, content or rewards? What are your thoughts on reviving some mini-games that aren't as active anymore?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What are the main struggles for OSRS developers? The devs' perspective on opportunities, struggles, priorities etc."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can Jagex explain the rules on Community Chucking?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are the ToA drop rates going to be released?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When is the Poison Dynamite release date?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "This is an honest question without the intention of hating on the team, but how did the idea for Quests Speedrunning come about? I feel like this is a game mode which appeals to a very niche set of players and I'd love to see where the Game Jam projects are at. Could you explain more about why the decision was made to implement Quest Speedrunning above other projects which might have more appeal to main game players? Also can you compare how much effort it is to implement this game mode in comparison to a League?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I've always loved watching Speedruns of games I love and am super excited to see that play style officially added into OSRS, so a big thank you for that! From a development standpoint, what was the thought process on which quests to use for Speedrunning? Are there any quests that got vetoed upon discussion?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there a quest you are looking forward to adding in particular?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why did we decide to make the Graceful Outfit unobtainable on launch month? It can be obtained in the months following release, but the maximum points you can gain in the first month of launch is 1600 and the Tier 3 Outfit is 1800. What is the reasoning behind this decision?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you see Speedrunning Worlds encompass PvM activities such as Bossing in future? Other great ideas include Speedruns to Tutorial Island or Champion's Guild - perhaps even a mode for Clue Scrolls?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there going to be a leaderboard for each quest? Is it possible to see time-based HiScores?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why is Speedrun gear set with basic stats and items? Could we see the ability to pick anything we like so we can test the absolute fastest time that quests can be completed?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there a reason why NPC locations aren't static? A single person might keep them in the wrong spot which could mean the difference between one or two seconds on my personal best."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The Dark Wizard aggression in the Delrith fight is causing frustration for some players as the area is single way combat so it prevents players attacking Delrith himself. What's your thought process around changing legacy quests in Quest Speedrunning? Generally, would you look to change this or keep it the same?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "If a plugin comes out that shows an ideal path for Speedrunning the quests would it be banned or allowed? Assume it would highlight in blue all menu options and what items to buy out of shops then a line on the ground of where to go to get to the next step of the quest fastest."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will there be a Practice Mode that will allow me to practice some of the more difficult quests without starting a timer? Or will the Speedrun mode itself be its own practice tool?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you explain more about why replaying quests on our main account is technically not practical to do?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will Melzars Maze be instanced?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we add trophies to the quest list so we know which quests we have already achieved Platinum on?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Has there been any discussion about adjusting the fang droprate, or are we happy with its current state?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Players have pointed out the Fang accuracy calculation was never \"bugged\", and it worked exactly the way it was polled. Why did we change it now?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why was this the fix that was chosen over adjusting NPCs within the Tombs or reworking the special effect?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What do you think of these changes? In particular, how much does the new approach with More Player Power impact the dev team?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What does the future of Restricted voting look like?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I’ve seen a few comments where players are concerned the Polling Charter is just an excuse to add in content without being polled under the guise of “Game integrity updates”. Is this true?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there potential for revisiting past polls that failed by a small margin?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will designs be Polled before they are added to the game? And if not, what process will you take regarding community feedback on designs?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Following the previous question, just in case we got it wrong. Let’s take a moment to talk about visual changes, as that was discussed a fair amount over the last few days. What will these changes mean for new rewards, changes to old areas and such?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will ideas that are very popular within the community - for example, player suggestions on Reddit - be Polled for inclusion in the future?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are there any plans to increase the voting requirements?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will there ever be a poll that asks ‘’What kind of content do you want to see’’ or “How do you feel about this” rather than a straight Yes/No option? Another popular suggestion from the community was to have questions that offered “Yes/No to proposed content/change” and “Yes/No to proposed execution”."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are there any plans to increase the 6% voting rate, perhaps by adding an incentive to voting or making polling more accessible?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why wasn’t the ‘no Divine effect’ on Saturated Heart voted?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you explain the process of feedback reaching the dev team? Does the community feedback fail to reach the devs?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you explain the Bloodletter’s ‘Bounce’ effect in detail?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why is the Bow a combination of single target and AoE? And are there any plans to just pick one and own it?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Could there be an alternative solution other than every boss having a unique currency that players need to farm to use the unique it drops?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why is Soulblight stuff untradable? It's good to be able to buy and sell on a Main account, or else we play on an Ironman account."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will Soulblight be better than Trident?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When do we get the Game Jam blog/stream?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is the Wilderness Expansion still in the works? And is Menaphos or Varlamore below Kebos/The new \"Garden of Death\" Quest being worked on?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will all future design blogs be like this Mysterious Quest blog?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When will the new quest be released?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will we be receiving any hints about Varlamore, Menaphos, the Wildy Expansion, Vulcu, Rat Enclave, etc., during the summit next month?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "If there are no targets in range for the Bow to bounce to, does it still consume a charge even though its effect doesn't trigger?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What is your perfect Sunday?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Do you think the amount of detail & images required to explain how the Bloodletter Bow works are too complicated/confusing? Any thoughts on having a simpler weapon design that may achieve the same niche/design goal?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you explain what Premier Club Membership is? I can't find any information on what you get for Premier Club vs just paying month-on-month for OSRS."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will Deadman Mode return?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why don't you do anything about the scam streams? You're the creator of the game and second most viewed to Scammer."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Hello! I didn't think I'd be saying this for a long time (if ever!), but I have decided to leave the Old School team to pursue another opportunity. I have loved every minute of working on Old School, it really is as cool as it sounds. I've only been here for a year and a half, but I've done quite a bit in that time, and have learned so many things about game design and game development that I'll keep with me forever.\n\nIt's been an absolute pleasure making content for you all, and I'm proud that I can always say I've worked on such an iconic game, if only for a short while!\n\nWho knows what the future holds, maybe I'll see you again one day. But for now - goodbye! May your drop luck be high and your server lag be low, and of course, happy 'scaping! <3"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Hi there! I’m Mod Other, a new Junior Content Developer on the Old School team! They say you never truly quit playing RuneScape, and at this point, it feels like I’m taking it a step further by being able to give back to a game and community that has been a stalwart in my life for so long.\n\nI’m new to the games industry, so I consider myself very fortunate to be working on OSRS and hopefully I will help bring fresh and exciting content to the game in the future!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I'm Mod Shroom and have recently joined Jagex as a Junior Artist after graduating from university where I studied Game Art. I'm new to Old School Runescape, but it has been brilliant to contribute to the game with the recent Halloween decorations. I look forward to working with the Old School Art Team to produce more exciting content for players to experience!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Hey everyone! Since joining Jagex, I have found the whole team to be so supportive and friendly. Animating for Old School RuneScape has been my first job in the industry, and it was very daunting going from being a student to animating for such a large company. However, the team at Jagex have done so much to make me feel welcome within the community and I have already learnt so much in the short time I’ve been here. It has been so gratifying to work for a company where my ideas and creativity are appreciated, and the feeling of watching my work be implemented into a game I care so deeply about has been like no other."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Our task is simple. Make a new Prayer book that doesn't outright overpower the Prayers we all know and love, bake in the common themes from hundreds of community suggestions, make something that feels rewarding for skilling-focused and combat-focused content, and deliver on some elements of high-risk vs. high-reward without making the new set of Prayers inapproachable. Simple, really.",
      "Jagex"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Love the teleport effect Hazeel and Khazard have! Will we be seeing more unique effects implemented? There are a bunch of teleport items that would benefit from having their own unique animations."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What was your favourite part to design?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Mod Arcane, congratulations on such a successful release! This first one is for you. Talk us through your decisions when creating the new solo boss for Secrets of the North. Tell us about some of your favourite mechanics. Are there any which are totally new and unique, or are some of them taken from other encounters like a raid for example?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Mod Bruno, do you want to share any complicated or interesting bugs/problems that arose in testing the new boss?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there a hidden mechanic when it comes to the \"Prayer Shield\" phase of the fight? Even if you use Sapphire Bolts, Smite, Ancient mace, etc, you are still met with the chat message \"The Phantom Muspah's prayer shield mitigates regular damage\". You still do massively reduced damage with your weapon, so it's weird to assume that Sapphire bolts are the only way that you can deal high damage to this phase. Can this be explained?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you explain why the Saturated Heart is untradeable? If the Imbued Heart and Ancient Essence is tradeable, what is the reason for making this untradeable beyond making it unbaggable for UIM?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Today’s hotfixes addressed a bug with the Phantom Muspah’s melee attack. The ‘step back’ method to mitigate damage from this phase was a fun mechanic to engage with, could the team explain why it was removed and whether or not they’d consider reverting this change?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Does the Old School team plan on making Smite relevant for future PvM? It was awesome to see this mechanic for the new boss!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Venator Bow was very good in Barbarian Assault. Can we get more insight for why this area is restricted?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Mod Arcane, when designing the mechanics of the boss, did you feel limited knowing that there are meant to be four bosses in Desert Treasure II, so you had to keep some mechanics saved for those bosses rather than using them here?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What player stage do you think this boss most appeals to? Does this match what you envisioned when you first tested the boss?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What is your reasoning behind dropping the Venator Shards more often and needing 5 to create the bow than just making the bow a drop that's 5 times as rare?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Regarding SOTN, will the boss be Slayer task eligible?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Right now in SOTN, killing the boss before the Smite phase causes it to bug out. Will this bug be addressed?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Damage is currently nulled between phase transitions near the end of the fight. Can this be fixed?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can the devs give any insight into what goes into designing drop tables for bosses? Why so many skilling supplies?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we get a quick start option to instantly spawn the boss, similar to Vorkath? The 30-second respawn timer feels a bit too much since this is a solo boss."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Could we get the possibility to break down Ancient Icons into Essence? Just like the Venator Shards."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Would the J-Mods be interested in adding more Item Clue steps and stashes? Maybe one with the upgraded Ancient Staff and another one where you have to equip a Sun Keris outside of ToA?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "First of all, lovely work with the new boss and congratulations! However, after trying the boss, there was a missed opportunity for it to be a Tribrid fight, was this intentional, or discovered after players experimented a bit?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "You once said that once we saw the boss, we would understand why the ranged weapon had to be a bow. Could you elaborate?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you mention if the pathing on the way to the boss can be fixed? A lot of us click the \"Squeeze through fence\" but get directed slightly differently."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Was the Muspah’s orb phase intended to have a safe spot?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Would you consider making the Phantom Muspah weak to Salve Amulet, or possibly even to ancient magicks?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What is the point of the Frozen Cache? What does it do?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will this boss get Combat Achievements?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you explain Frozen Cache a bit further?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "the key lies\n\nat the end\n\nof the path",
      "From the Twitter accounts of Mod Brow, Lenny, and Nin."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I’ve really enjoyed SOTN! What was your inspiration when creating SOTN?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Which quests have been your favourite to work on? Is SOTN one of your favourites?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How long did you spend creating SOTN?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I really like that Jhallan is having a nightmare and that’s how Phantom Muspah manifests. Can you tell us more about how you approached this storytelling?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "SOTN is essentially a tangent to Tale of the Muspah from RS3. Are there future plans to follow the Mahjarrat story but with an Old School spin to it? Especially While Guthix Sleeps and Ritual of the Mahjarrat."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "SOTN is very fun and has awesome lore with a great set-up to DT2. Can you explain the brainstorming processes for this awesome lore to tie it into DT2 and continue Devious Minds and Hazeel Cult?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there a lore reason why the Phantom Muspah uses Corruption (which is otherwise associated with Arceuus magic), or is that coincidental?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will we be seeing more Mahjarrat in the future that haven’t yet appeared in Old School (like how Jhallan was introduced in this quest)?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there a plan at the moment for where the Mahjarrat storyline is going? I'm wondering if you have a plan beyond DT2, or the Ritual of Rejuvenation if those are different things, for where you'll take it."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we discuss the bow/sword-wielding ninja assassin who not only kills monks on Entrana but also is messing up followers of Zamorak? Is this a Rambo Guthix agent? A Zarosian general? Three Gnome children in a trenchcoat? Sliske in disguise?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What's with the plot armour for assassins in OSRS? First AKD and now SOTN. Why do they keep killing people AFTER being clapped by the player?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Who is your favourite Mahjarrat?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will the Easter Egg connections between Kourend/Xeric and Zaros pay off at Desert Treasure 2?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "One of the new NPCs in Uzer Oasis at SOTN mentions Hosidius. Are these new areas Desert Treasure 2 related?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When creating the lore for a quest, what is the process like between you and other developers?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is the world of OSRS actually going to step forward and progress? Storylines are \"progressing\" but they don't seem to matter in the grand scheme of things other than end-game rewards. Quests seem to have no implications on the world as if they're all in their own self-contained bubble."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I'd like to ask about Quest Backporting which was surveyed with high success: How is it planned to incorporate the quests into OSRS, having noted that the OSRS devs are trying to incorporate their own spin on the story?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I’d like to know more about how the balance of Wildy Boss Rewards was decided and the ‘high-risk high reward’ concept was approached. For example, Phantom Muspah gives 225K GP/kill, but Wildy Bosses give 25K. Is this because the new uniques of the Wildy Bosses are more valuable?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Hi guys, congrats on the reworked bosses, the arenas and models look fantastic. Now that we have added in the “group loot” mechanic to these bosses, are there any plans to go back and retroactively do the same for other bosses that could benefit from it? Corp beast comes to mind!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Do the new lower-level bosses count towards the Achievement Diary? Do both versions of the bosses count towards the Elite Diary?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Any reason why Veti’on Reborn’s sword changes colour? Can we make it so his sword stays blue? The orange/blue contrast looks really nice. The old version's sword never changed."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I saw in a video that Artio can switch aggro if there are several people in the cave, interrupting the flow of this Single fight. I assume that Spindel and Calvar’ion behave similarly. Is this intended, or an oversight?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is it intentional that the boss cave entry fee is lost on death even if you die elsewhere in the wilderness?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there a reason why the reworked bosses aren’t similar GP an hour to Vorkath and Hydra? This isn’t the case unless you get lucky on uniques."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Do the lower-risk versions of the Wildy Bosses drop the upgrades to the weapons also?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is the Voidwaker Korasi?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will there be any change to the Voidwaker's special attack animation? The other weapons got some really unique and cool special attack animations but the Voidwaker's is a bit underwhelming."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will the Voidwaker have useful applications in PvM?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "As an Ironman, is my only option the lower-level bosses? Or are the harder ones also possibly solo-able?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will you guys look into the way the minibosses work for Ironman? Currently, we don't get kill credit as soon as someone enters the instance and gets hit, even though it's supposed to be singles."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Though it wasn't mentioned at the time of the blog, or poll but could we maybe see the new upgrades to the wilderness weapons be BIS at each of the specific bosses?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Though it wasn't mentioned at the time of the blog, or poll but could we maybe see the new upgrades to the wilderness weapons be BIS at each of the specific bosses?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will there be any changes to the Iron-only Kalphite Queen lair itself? It's gonna get super busy and right now, an Iron's kill can be accidentally or intentionally griefed just by another stepping into the lair. Paid private instances perhaps?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why weren’t the drop rates of Dragon Pickaxe from Volcanic Mine revealed yet? Is it because this info will be provided in the upcoming weeks?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is the team investigating Broken Dragon Pickaxe not being visible at the Collection Log?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Could Krystilia receive her own block list for Slayer? I wanted to try Wildy Slayer with the new updates but to do it properly I would have to get completely new blocks. It incentives not to switch between Krystilia and other masters. Not being able to block certain tasks is troubling for Wildy Slayer."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The New Wildy Boss fights, areas are great, better than the old ones! Thanks for an awesome update. Can we expect any more Wildy updates in the future?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "It was honestly absolutely brilliant to have Content Creators describe the content. Are there any plans to do the same for other content? I hope you guys do this more because it was great!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Do you think we would ever see a blanket Wilderness fee, one that is 200k? It would combat the ragging mentality which is mainly for harassment purposes and is a root of toxicity in PvP. Having a 50k entry fee for Multi Caves did not solve it, as it was too low to impact anyone and was irrelevant because they could wait outside in rags avoiding that penalty."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there any possibility that the cannon can be allowed at least in the lesser variant caves? We were able to use cannons before, but not anymore!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is Artio KC going to be counted in high scores for Callisto?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is the Forester’s Outfit a Transmog of the Lumberjack outfit? Or are there going to be two different Woodcutting outfits now?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I'm worried about inventory space for all the tools as a UIM. Will the tools be stored, or easily re-obtained?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there any info on what rewards would be F2P and which would not be?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What slot will the Forestry Kit go in?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Does the scaling Group Chopping bonus mean that team (9 alts) Woodcutting will just be objectively better WC exp from now on? Would this scale past 99?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How will this group bonus interact with Farming Trees and the WC Guild?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Currently, Tree Leaves are obtained from curing a planted tree if it's diseased. Will the new leaves be different or will the old leaves gain the new functionality and be the same item? I have been collecting them over the years as a farmer, while it would be sad that my collection would be \"easier\" to obtain after this update I would also just be glad to get more leaves."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I'm confused about campfires, teas and combat. Do they add their bonuses on top of current bonuses? This would mean we'd be bringing teas for most PvM encounters to min/max now, changing the meta."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Do the teas give their bonuses the same way potions do? Or will they have less doses per inventory slot?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "If we are getting Teas, could you please consider making the Tea Flask useful for this? It would be perfectly fitting!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "In the newspost, there isn’t a way to speed up the RNG of chopping the tree once, vs inventories of logs needing to be dropped or banked before obtaining the roots. When you pay the farmer could there be an option to just leave the stump?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "If the cut time is longer but the XP drops are higher, are the two-handed axes and normal axes going to be on par at first, but as you train your WC up the two-handed will become more useful to train with? Would make sense as the road from 1-99 includes some logs that aren’t useful. If they are OP then hopefully the two-handed axes are untradeable. Most OP items should be behind some kind of grind."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How will two-handed axes work with tick manipulation methods?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can two-handed axes give more logs per successful chop? It’s much better to obtain logs via PvM drops or even Kingdom of Misc rather than cutting trees. Or this could be done with a consumable like Spirit Flakes for fishing - hold a stack of Enchanted Leaves that give you a chance for an extra log."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are there any thoughts on two-handed axes in combat?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will the Anima Infused Bark allow for another variety of Splitbark Armour or another source for crafting it?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Having the option to use either logs or Anima Infused Bark for a currency seems weird - what's the point of a brand new currency if we can just buy logs and use them instead?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I’m curious, will 2-tick woodcutting cause the tree to stay up forever with the new, proposed depletion mechanic? Is this intended?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is Forestry being considered as revitalising to Firemaking as well, besides Woodcutting, as these two are in sync with each other?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Could Woodcutting be just one way of doing Forestry? It would be great to have a more engaging activity that you can jump right into. Perhaps have the different forests of Gielinor as hotspots where these events and others could spawn, with multiple possibly active at a time and one guaranteed? These could be things like stopping wildfires, slash and burn to fertilise the ground, removing invasive species etc. Tougher events but more rewarding."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you give us some cool POH themes with this as a reward please? Like a fall-themed house with leaves everywhere."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will we see the Tea Brewing system requiring Flowers, Tree Roots, Less Valuable Herbs, Tree Sap etc to repurpose old game components?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will Clothes Pouch work with all skilling outfits? Would love to be able to flex some FashionScape across Gielinor."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Great work with Forestry! Not to put any more work on y'all, but can we also have a Tea Shop/Cafe to socialise, and possibly sell made teas?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is a Beaver Transmog in the works? Other skilling pets have options, I’d love to have that option here as well."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I think having most things untradeable would make Woodcutting feel more useful for account progression. What are your thoughts on this?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Multiple people not making a tree despawn faster was a dream of my 12-year-old self! Will this be across other skills as well, like fishing, mining etc?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Forestry seems to want to push players into the forests of the Runescape game world again. However, as you still generally want to bank the logs, most people want to stick close to a bank. Can you elaborate on this?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "When do you think the Forestry update will be released?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will my Skilling Pure get ranged XP during any of the events in Forestry?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we see a Dragon Axe sink from Forestry? Seems like a good opportunity to make DKS more worthwhile."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Shooting Stars could use a group benefit as well. Is the team considering it?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you use the tools inside the Forestry Kit unlike the Tacklebox where you have to remove the items from it?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "High-level players that can cut Redwoods can’t spawn the Woodcutting event. Might I suggest introducing another Redwood? Because they only exist in the Woodcutting Guild and no alternatives or does the Redwood that you can grow in the Farming Guild spawn events?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "If we are wearing the Forestry Kit, what happens about the Woodcutting Cape boost of 10% extra chance for Bird Nests?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we use Dharok's axe as a two-handed axe??"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What was it like designing your first project?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Have you encountered any fun bugs yet?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How hard was it to try and capture the essence of ten years of OSRS in a limited-timed birthday event?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Any teasers you can share about the theme for the event?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is Virtus designed in a way not to devalue Ancestral, unlike BIS mage? Will the Ancestral be broken down to make the upgraded Virtus? If that’s the case, what will happen with the Twisted Ancestral Kits?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Mod Roq, are there any interesting or unique polls, past or future, that you really wish would make their way into the game?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are you guys looking into the possibility to use the old DK rings as an ingredient to the new BiS ring upgrades?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you clarify the Freeze and Poison Penetration and whether each stat would extend to the player?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What is your opinion on making some big item grinds less dependent on RNG by dividing the item into smaller pieces like the Venator bow?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "With the upcoming change to the Abyssal Dagger special attack, was removing the damage reduction considered to make it better than the Dragon Dagger’s special attack?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Does the Magic Secateurs update apply to Herbiboar, too? And if not, could it be?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What is the general design philosophy the team is using when coming up with new prayer ideas for the new prayer book? What sort of direction/feel do you all want the new pray book to bring to the game?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How are the prayers meant to be unlocked? As a reward from completing the quest? As drops from bosses? A combination of the two?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How are the prayers meant to be unlocked? As a reward from completing the quest? As drops from bosses? A combination of the two?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Any thoughts on making any of the post-quest boss variants available to be killed as a group? Appreciate that some mechanics may become trivial in a group setting."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Any plans to fix the healer poison mechanics at Barbarian Assault in the near future?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will the resources dropped from the new repeatable bosses be as abundant as Phantom Muspah? Following the release of Secrets of the North and the drop rate changes, it seems that there is a lot of incentive to fight the boss purely for the resources and not as much for the unique items."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will there be a defence req to complete DT2? If not, are you envisioning many def reqs for the Ruinous Powers?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Would it be possible to reorder 200m ranks on the Account Build HiScores based on the ranks on the normal HiScores, this way people are ranked in the order they achieved 200m?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are there plans to make at least one of the 4 bosses really difficult? People may struggle a bit on DS2's final boss, or SOTE's, but I'm talking about SOTF-level boss difficulty here. This is a new Prayer Book so we should be made to really work for it!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why is Dragon Scale Dust still unbuyable from NMZ for Ironmen?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What can we expect when it comes to player suggestions for the future?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What are your thoughts on repolling Amylase Packs or Marks of Grace to Hallowed Sepulchre?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "'We're pushing to try and make the necessary changes where we could offer this kind of a reward feature, though we can't confirm yet that it would be possible. We also need to discuss with you how such a feature would work in-game, what kind of restrictions it should have, how much XP a Minus XP Lamp should remove, etc.'"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What happens if a player doesn’t like any of the skills proposed? Or if they like all of them? Can they vote for more than one Skill?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there a chance we’ll bring out new concepts for brand-new Skill Pitches?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why are some of the Skills missing details?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Let’s talk about Taming! Can we talk about why it’s awesome and why should you vote for it?! What kind of content would be available for players and what does the skill offer? We’ve seen some creators talk about the fact that Sailing and Shamanism have the edge by offering more ‘new areas to explore’ but let’s talk about what new areas could come with Taming as a Skill and why they would want it!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How are we focusing on making this fun to train?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Do companions need to follow a player? We’ve seen concerns about the map potentially looking overpopulated with the amount of Companions involved."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you give some top-level examples of the type of QoL opportunities here? I think players may have felt we were too vague with details."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How will players’ existing pets work? Would they become skins for tamed creatures?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Were mounts an option for us in Taming?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Was Taming in any way inspired by Ranching - like is there a possibility of breeding them and getting resources from them?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Let’s talk about Sailing! Can we talk about why is it awesome and why should you vote for it?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is this going to be instanced content? Are islands permanent locations, procedurally generated, or a mix?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How is this NOT a mini-game?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a concern about whether we can actually pull the dream off of Sailing on the sea. How much development time is involved in making this fun content at sea? Players might be tempted to opt for a safer skill in case they feel let down."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Let’s talk about Shamanism! Can we talk about why is it awesome and why should you vote for it?!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Let’s quickly touch on the name - why Shamanism, are we open to changing it?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are item augments going to cause a lot of power-creep and how are we managing that? How can we avoid FOMO with the skill?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "We’ve said we want it to be largely a non-buyable skill. We’ve seen lots of interest to make resources from Hunter/Slayer useful for Shamanism. Are resources from the real world something we can incorporate and instead make the untradeable parts of the skill come from the Spirit Realm?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is the Spirit Realm going to be instanced, and what are your goals with the scope of the spirit realm right now? Are you going to access it anywhere or only at hotspots that are basically “dungeons”, that are separate areas accessed at specific locations?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will there be PvP with Sailing potentially?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will there be quests on release for the new skill?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we get all 3 skills?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why didn’t we poll Sailing and Shamanism against each other since they’re so close? Why aren’t we looking to refine both skills?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "None of the Skills got to 70% in the “Which Concepts Do You Like?” question. What does this mean for the potential future of it being polled as a skill during ‘Lock-In’?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Do you have a rough plan for how you’ll be approaching the refinement stage? What level of community collaboration will you be looking for here?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "You’ve mentioned before that this is the first of the new skills. Does this mean for future pitches, there’s a chance for Shamanism to be pitched again? If so, would you offer it in the next pitch, or would you prefer to offer three brand-new pitches instead?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Taming wasn’t very popular compared to Shamanism and Sailing, but some of us did like this pitch! Could it be considered for an expansion of Hunter, instead of as an entirely new skill, like Forestry is for Woodcutting?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How are we looking to unite the community around Sailing?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "One of the biggest issues we’ve seen players talk about in regard to Sailing is the core gameplay loop. With Shamanism it was a lot easier to highlight potential core-gameplay loops, whereas with Sailing it's not as easy. What are we doing about this?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "It feels as if people are more excited about the parts of Sailing that aren’t the actual Sailing parts but rather Islands and the potential for more area expansion. What are we going to do to convince players that it’s fun to Sail?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is all new content going to be locked behind Sailing?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are you concerned about the scope of Sailing?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "One of the main issues players had with Taming was the potential for screen clutter. Do you have any ideas for how you would prevent this for ships out at sea?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there a plan to release tradable/GP rewards for BH?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why is there no F2P Bounty Hunter world? The original craters were F2P, and in the spirit of unifying the PVP vision, I think it makes sense to include this group of players. The entrance fees are great."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The minimum deposit fees are really low, new players don't tend to PK Unskulled. What are your thoughts on increasing these fees?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Would you consider letting Unskulled targets be a 'free' skip, as in previous iterations of BH? If Unskulled costs are adjusted, we'll see more Unskullers, a lot of us players aren't super keen on fighting them."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Bounty Hunter rewards seem a bit expensive for only being able to have 1 emblem at a time. Is there a plan to reduce these prices?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Would you be able to add an armour stand to the Bounty Hunter hub? It's inconvenient to have to leave BH to have Perdu repair your stuff and then come back to fight."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we get an AUS BH world?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Could you consider a US East world for us players who can't play 'on-ping'?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There needs to be more of a penalty for rogues that double Voidwaker off spawn and run to safe and repeat. Becoming hard to be ready to triple eat when spawning into the crater. What do you think about this?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why did you make the decision to allow no teleporting whatsoever? This changes the nature of the fight, making it more about longevity rather than KOing your opponent. That gives builds like voiders with dragon knives a massive advantage, since they can consistently deal out high DPS and quickly nuke anyone who attempts to run away because they ran out of food."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are there any plans to add a separate No Honour crater with overhead prayers and freezes enabled?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Thoughts on allowing people to use the buffed D long, D bow etc. in PvP outside of Bounty Hunter?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why is there hesitance in bringing BH certain buffs like the one to Abyssal Dagger outside of BH?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What's the reason for not making Statius’s Warhammer usable everywhere including outside of Bounty Hunter and the Wilderness? It has a very niche use and will more than likely only be used by pures in Bounty Hunter. This could’ve been a nice upgrade to the Dragon Warhammer."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why do I get a 30 minute timer after skipping a looter and having 5 fights with someone and running out of time in the safe? Are there any plans to fix this?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "In traditional PKing, XP has always been gained. Why does this act like LMS to where you can’t level up during combat?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What happened to being able to watch other players PvP from the lobby? I see a ladder that goes to the 2nd floor, but it doesn't work."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can you please make it possible for Irons to get emblem drops from targets? Back in BH v1 Irons could get emblem drops from targets, currently it's significantly harder to profit points on an Iron than a main because you have to buy the emblem every time you die. It would also be nice for Irons to get bonus points for killing targets with emblems, like mains do."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "With no protection prayers, the introduction of Ancient Warrior's Weapons, and the convenient spec-restoring pool, do you feel that BH has become a rusher’s dream? Are there any plans to combat rushing further than the 30-second leave penalty?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we have ornament kits for the infernal and fire capes that evolve based on kill count, similar to the BH hat for veteran player retention please?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Since there is a BH ornament kit for the Neitiznot Helmet, could we possibly see one for the Faceguard? Also, would the team be open to adding more ornament kits, or is the shop already overloaded with cosmetics?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there any chance we will see corrupted versions of the weapons in the future? With or without special attacks?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are there any plans to expand the Bounty Hunter Castle to make it more spacious for players?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How does the new tree spawning system work?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How did you get to the despawn times in the newspost?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are Blisterwood Trees affected by the new timers?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Do Group Boosts work with Redwood Trees?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What’s the use of the Forestry Kit?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What pieces of the kit are tradeable and stackable?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How do the new items work with the Forestry Kit?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How are the new items collected? Especially leaves."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What are the events we’ll be seeing in Part 1?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How do Events spawn?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What events need items?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "So there's no way to make a certain event always spawn and be the only one that spawns?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What are the rewards we're going to see in the Forestry shop with Part 1?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we use normal logs alongside noted logs in the store?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How do you get a 2-Handed Axe?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How do 2-Handed Axes work?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why do 2-Handed Axes give more experience for less logs?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What was the reason for using run energy to drain?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What happens when you don’t have any run energy left and no Forester's Rations?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will Forestry Rations be useable anywhere?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there an option to turn it off then?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What was the decision behind 2-Handed Axes being irreversible and tradeable?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What parts of this will be F2P? Because the tree chop mechanics especially will affect everybody, but are there any other parts that will?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Any plans or possibility of making Dragon Axes obtainable through Woodcutting? Having them only from Wintertodt and DKs is kind of weird and lacks flavour. (Like Dragon Pick from Volcanic Mine)"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will it now be impossible to chop down a tree by yourself in a single chop?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are the tree roots still going to be given? Not mentioned in the blog, if that's in Part 1 or Part 2?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are Maple logs going to have a use? They’re cheap and useless right now."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are Ironmen able to participate in Forestry? And if so, are there any exclusions to Ironmen?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will Forestry be useful at high skill levels?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can I give my Woodcutting pet an axe so they can Woodcut as well?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we use the kit on Max Cape?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will there be a video explaining Forestry like Bounty Hunter?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How long will it take to get the full Lumberjack Outfit, for example?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will there be a Forestry pet?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will you guys be standardising tree art across the game? I remember one mod/artist saying they wanted to make all trees look like the ones in Kourend (Shayzien) and Priff."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why has Sailing been designed as a skill rather than a content expansion or a mini-game?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "In the blog, we categorised training methods into 3 types - either “Primary, Secondary or Tertiary” methods. Primary gameplay ONLY gives Sailing XP, so does this mean that the Primary methods will be the best way of training the skill? There is a concern generally that the ‘best’ method will be something that certain players aren’t a fan of. How do we balance them so that other methods are not obsolete and are worth doing?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There is so much content on offer in our latest blog. We’ve had to strike a really hard balance between showing what Sailing could become, versus not over-promising which would be extending the length of development too far. Could you outline what training methods players can expect to have on launch and what type of content is to come post-launch?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "With Sailing, we decided that using any facility on your Ship gets Sailing XP. At a surface level, this is quite simple. We gave the example of fastening Sails as one of the easiest ways to visualise training the core gameplay for players. For some players, it can feel simplistic or a bit boring. Can you explain a bit more about how we intend to layer the gameplay mechanics for the skill, with NPCs etc, so that the gameplay from 1-99 is not about luffing the sails?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Do you imagine that there will be something for the really high-level and competitive community to sink their teeth into, like tick manipulation, to make the gameplay feel really quite engaging?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will Ship Racing be group instanced like Hallowed Sepulchre, where others can see you do your time trial, or personal instanced, where it's just you and the NPCs? Are we concerned about Agility references?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I’ve seen a lot of people make comparisons to Agility courses at Sea. What is your response to this - how does it differ?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "For some players, Ship Racing will absolutely satisfy the ‘need for speed’ and highly engaging content. But for others, RNG elements can spook them, and they might immediately get worried that it is too challenging, they don’t want to be timed, etc. - it’s not relevant or fun for some types of players. Can you expand upon how Ship Racing can have more mass appeal to multiple types of players? Also, are you racing against other players or other NPCs?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Does Ship Racing need to be a Primary training method? There are some concerns that a competitive activity should not form part of the Primary way to train a skill. How would you respond to that?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "In the blog, we touched on the idea that Ships would have their own Combat system, but we didn’t expand it other than explaining it would give Sailing XP and not Combat XP. Some players have asked for more detail on Ship Combat. Additionally, they were wondering what the appeal of Ship Combat is when they already have Combat as a player in-game. Thoughts?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There were a few discussions in various threads about XP/hr and comparing the different methods we presented in the blog. It’s fair to say that ‘Low’, ‘Medium’ or ‘High’ rates vary between different skills - Low for Mining is very different from Low for Construction. Can we talk a little bit about the XP ballparks we gave a bit more? How long do you expect 1-99 to take for an average player? What would you want players to keep in mind when considering and comparing XP rates at this early stage of development?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "We’ve had some questions come in around Ship “Sinking” mechanics. Can you explain our approach to Sinking and whether you’ve considered it to be a ‘Safe’ death for HCIM? Do you think players will lose their items or potentially even lose their ship?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is PvP completely optional and avoidable for those who don’t want to engage in it?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What would be an idea for the Sailing skillcape perk?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will Sailing include a skilling pet in its rewards?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "A question about the use of cannonballs: Would it be a separate cannonball from the one used by the Dwarf Multicannon? I would prefer a different cannonball type, which would give another item for the Slayer monsters/bosses drop table."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can the Hand Cannon from back in the day be a reward attainable from Sailing?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will players be able to attack monsters from their boats with ranged or mage in addition to using cannons that are on the ship?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How will XP work for all activities at sea? If we're doing trawler fishing, but there's only one trawler net facility, does only the one player using that facility get fishing XP? Or is all XP shared equally with everyone on board?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "If we're hunting Slayer monsters at sea, does everyone on the boat get Slayer experience? Will some form of Slayer Partnering come back?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will the bosses that come with this new skill have a Slayer requirement? Will those bosses be Slayer task only, like Kraken, for instance?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "If a Magical Ship in a Bottle is added, can we get a display to place it within our POHs?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "If we have the \"Ship in a Bottle\" item form, would we be able to board anywhere, or would it be limited to ports?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Some of the rewards, like the 'Magical Ship in a Bottle' - while cool - seem odd to just be immediately available to players and would fit more naturally (in my opinion) as a Quest reward. Is the team open to taking some of the more outlandish rewards (certain crewmembers, Ship-in-bottle, maybe Mako's Sail) and adding them later as Quest rewards?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How do you plan on keeping the new resources valuable as time passes? It is not uncommon for supply/crafting items to crash in price over time. Is there a plan to avoid this problem and maintain this space in sailing for profitable gathering?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can the new (choppable) woods be burned or fletched into Arrow Shafts?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will there be a design space for unique crew members, where different crew members (that you got as rewards from different content) are more or less useful for different encounters? So long as all the available crew members feel unique and useful, I don't care much about the complexity of the crew system."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How detailed will the polling be? Will it be \"Do you want Sailing?\" or \"Do you want boat races, do you want mining reso, etc?\""
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What does ‘aspirational content’ mean to you? Who are these Awakened bosses targeted at, and what can we expect from them in terms of difficulty?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I love the ideas, but why are the Orbs tradeable? It feels quite odd; if the boss is going to be locked behind something, it shouldn't be buyable on the GE."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why are these harder versions not efficient for uniques? I think it would be awesome if a rare Orb drop from the normal version of the boss translated to a very high unique chance for those players willing to fight the significantly harder variant."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Pet?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will these be post-launch content or available on release?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are the four new bosses also instanced solo only like Zulrah, Vorkath, Muspah, Gauntlet, Sire, GG, Hydra etc? Or GWD style where you can play with friends/GIM?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I love the idea of Blood Torva, but why is it from this quest and not a future GWD expansion?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "For the Ancient Sceptre, will the imbued versions be tradeable or can we do something with the extra icons?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will the Blood Torva drop be guaranteed or RNG-based with a high drop chance?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "My only concern is after a while, high-level players may want to just farm the harder bosses for enjoyment but would be gated behind Orb drops. What are your thoughts on this?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "For the Virtus Robes, each of the bosses has a chance to drop ‘a’ piece or ‘each’ piece? Each boss has a chance to drop all three pieces, correct?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Would we be able to swap out the sigils on the Ancient Sceptre like how you could swap out handles on the Godsword, or is it like a permanent upgrade thing like fortifying Masori?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "So what happens to the imbue on the rings after you break them down? Is that time in NMZ wasted, and are those points lost?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will you release drop rates on release this time or are they delayed?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are the quest versions still doable for questers/non-aspirational gamers?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are there one-shot mechanics in the new bosses?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What does the loot table look like? Is it more like God Wars or Muspah?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How long will the quest take?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How do the Ring Upgrades work? Is it 1 to 1? Do they need to be imbued?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will there be Awakened Pet Transmogs?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are the Orbs to fight the Awakened bosses going to be unique for each boss or can you use one Orb for any of them?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will the harder versions have a higher pet chance?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How long is each boss fight on average?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What combat stats would you recommend for these bosses?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What would be the ETA for Combat Achievements on new bosses?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we get Clue Scroll drop rates confirmed along with the unique drop rates?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Do you think the new rings will be able to compete with the Lightbearer?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are the bosses in the quest easier than the bosses after the quest?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why did you decide to remove Hunter’s Bolas?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How will the Hunter’s Spear be useful without the Bola’s special?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are rumours one and done tracks or are they more akin to Slayer tasks, where you would have to hunt a certain amount of creatures?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "For what content do you see the Hunter's Sunlight Crossbow being used?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How much of the feedback changes were due to PvP feedback?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we have a different use for Fennec Foxes than killing them? They’re too cute to kill."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What would you think of allowing players to eat again during the Hunter meat heal over time - forfeiting any remaining healing from that meat?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What other effects did you consider for Hunter meats?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are you wary of invalidating fish by adding Hunter meats?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "A lot of Hunter meats aren't worth keeping or cooking because they're only mediocre foods. What would you think about allowing for skewered beast meats (and other such cooked Hunter meats) to be used with leaves to craft Forester's Rations?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Are you concerned about giving the Hunter skill a 3rd pet, when some others only have 1, if any?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we get pets that we trap around the world we can keep and breed at the Hunters Guild?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Is there a way to make existing Hunter outfits relevant with this update?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we please craft the Hunter outfits ourselves instead of paying to have someone else do it for us?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Could the Hunter cape have a teleport to the guild like several other skill capes do?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we get deposit boxes near some hunting areas at the cost of gp/hunting materials? Or one time payment for access to a deposit box?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Will the trap storage include Butterfly Jars? The Butterfly Jars are used for Hunter, so it'd be weird to include Impling Jars and Butterfly Nets, but not Butterfly Jars."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Could we use Eagles to carry out small jobs for us? For example you could send your Eagle off to the bank with a pouch of things to deposit."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Why would barehanded catching moths be useful since we’d still need jars? It’s not like Implings where you might randomly come across one without gear."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Do Moth Jars require 'accept aid' to be on?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Can we get even more uses for furs? It's nice that the outfits will have some use now, and that the furs can also make pouches. But these pouches let us hold... more furs. I feel like we need something else on top for them. Why do I need to make a fur pouch? Why will I need tons of furs?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What would you think of adding a hunting style boss encounter?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "You find a hole in the floor under the crate! All you can see is the faint glimmer of extremely far below."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "You begin to lower yourself into the hole..."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "... and using your catlike agility land on all fours at the bottom of a large cavern!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Asgarnia's fate hangs in the balance. Disparate tribes unite under the banner of Lord Raddalin [sic], and his enemies look on in fear and hatred. Raddalin [sic]'s advisors – an uneasy alliance of Black and White knights – whisper of a discovery in the North that will give them the power to change everything.\n\nCaught in the midst of history, a lowly scribe and the son of a Jarl hold the fate of Raddalin [sic]'s new kingdom in their hands.\n\nFrom the glorious inauguration of King Raddalin [sic]'s reign to the disgraceful expulsion of the Zamorakians from Asgarnia, The Gift of Guthix tells an epic tale of the origin of magic, the plight of civil war, and the crushing defeat of the Fremennik Great Invasion. Amongst plots and betrayals, a penitent turncoat waits for her moment to leap into the unknown."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "A thrilling epic of betrayal and magic set during the founding of Falador and the doomed Fremennik Great Invasion. Sure to delight RuneScape fans old and new, this stunning tale shows how the gift of magic changed the course of Gielinor forever.\n\nIlme is in danger. Torn between a duty to her family and her position as scribe to a wizard of King Raddalin [sic]'s court, she is forced to spy for the rebel warlord, Moranna. As she carefully navigates the politics of court and the ever-present risk of execution if discovered, Ilme unintentionally plays a part in the spread of magic around the world and the forceful expansion of the realm of Asgarnia.\n\nSweeping from the glorious growth of King Raddalin [sic]'s reign to the disgraceful expulsion of the Zamorakians from Asgarnia, this novel tells an epic tale of the origins of magic, the death of a Rune Guardian, the plight of civil war, and the crushing defeat of the Fremennik Great Invasion. Amongst plots and betrayals, a penitent turncoat holds the fate of Asgarnia in her hands."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The aim is simple: Speak the correct pass phrase to me and you will be allowed to proceed."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Welcome to your next trial. Here, there is one simple goal... Survive."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Welcome to your third trial. Before you stand some recently initiated acolytes. However, it seems one of them was not as loyal to our cause as first believed. Your task is to question all four and determine who the traitor is."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Victory is within your reach, but one more trial awaits... Face your opponent."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "A thrilling epic of duty, magic and vampyres set in the Third Age that looks at why Lord Drakan invaded Hallowvale. Sure to delight RuneScape fans old and new, this stunning tale shows how and why Hallowvale was taken over.\n\n“I owe you a battle-debt,” Rhea admitted, inclining her head and making the sign of the star.\n\n“Something tells me you will have ample opportunity to return it soon enough, Wolf,” the winged warrior replied.\n\nThe city of Hallowvale has stood for centuries, a realm of light safeguarded by winged protectors and the Everlight. But all that will soon change. As the millennia-spanning God Wars grind towards their brutal conclusion, the armies of darkness descend upon the shining city - vampyres, werewolves, and legions of cruel mortal warriors, led by the cunning and malicious Lord Drakan.\n\nThe streets are filled with panic, but Queen Efaritay remains confident. Surely Saradomin, Lord of the Light, will save them? Their military will delay the foe until He arrives, the Queen has a secret weapon at her disposal and, if all else fails, the glow of the Everlight will stave off the blood-drinking vyre?\n\nCan the knightly warriors defending Hallowvale stand firm, or will they be undone not by the wicked efforts of their foe, but by the faltering reign of their queen, Efaritay? And why has Drakan become obsessed with claiming Hallowvale for himself?\n\nFaced with desperate choices, the queen adopts a risky strategy to turn the tide. Her choices will echo for eternity as the fate of Hallowvale teeters on the brink."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Was the Hereditas Expedition doomed from the start? Led by Pontifex Bilrach, the Mahjarrat must find the artifacts of the dead god Tumeken and complete the Ritual of Rejuvenation, otherwise they face extinction. Forced to work together by Zaros, the Mahjarrat form an uneasy alliance, though they all have their own ambitions.\n\nHaving found only sand and false hope wandering through the Kharidian Desert, the search is becoming ever more frustrating and the casualties mount as the humans die for the Mahjarrat cause. The desert is vast and full of danger, the sun is oppressive, and there are traitors in their midst. Can the Mahjarrat succeed despite these impossible odds?"
    ],
    "template": "cquote2"
  }
]