[
  {
    "list": [
      "Get ready for the 12 days of #DragonSleigher!\n\nEach day we'll be posting dragon-related clues to our Twiter, Facebook & Instagram which can be solved in game. Solve the clue and you'll start a christmas loot explosion!\n\nThe first clue will be released tomorrow. Good luck!",
      "From the official Old School RuneScape Twitter account"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Slog around a board with a sun tanned snail about these items ~ Cracker Jack http://ow.ly/ou8Ah",
      "Old School RuneScape's Twitter account"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "50 under me initially over the rough big red company ok? ~ Cracker Jack http://ow.ly/oBVV3",
      "Old School RuneScape's Twitter account"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Wizards Mizgog, Sedridor and Traiborn walk into a bar. The bartender serves them two wizard mind bombs and one asgarnian [sic] ale. The bar closes at 11, at which point everyone leaves. How many people left the bar?"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "My name is Martin Holt. I have dedicated my entire life to serving the Kingdom of Great Kourend. Under the council's rule, we've supposedly enjoyed nothing but harmony and prosperity for decades... but I know better. I can see it. I can feel it. This age of so-called 'peace' is reaching its end, and I fear for what comes next.\n\nEver since the last king died and his heir disappeared, the law of the council has become progressively unjust... corrupt... broken. Those whom we've entrusted this once great Kingdom to have become the ones we dread the most! They threaten the very foundations of all that we've built... and until the monarchy is restored, we will protest, we will rebel, and we WILL have justice!\n\nGreat Kourend will be a kingdom divided no more!",
      "Martin Holt"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "This is what I get for exploring uncharted caves. Looks like I'm trapped down here - My entry rope slipped off and now there's nowhere to go but deeper. I think I'd be safer just waiting and praying for rescue. If anyone finds this, get out while you can."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "\" Why should I, Tolna, be trapped in such a wretched place? Arrghh, It's not fair! Feel my ANGER! \""
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "\" It's so quiet and dark. I FEAR I may never escape this horrid place. Mum, Dad, help me! \""
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "\" Where am I, How long have I been here? Am I still the person I once was? Oh why am I so CONFUSED? \""
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "\" What's the point? No-One will ever help me. I'm not worth anything, will anyone ever combat my HOPELESSNESS? \""
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Shall I compare thee to a desert's day? Thou art drier and more rough-skinned. Rough sandstorms shake the cacti away And Summer's head defers to Autumn wind. Sometimes too hot, the eye of heaven shines, With Guthix's gold complexion often dimmed; And every fair from fair sometimes declines, By chance or desert's changing course untrimmed. But thine eternal desert shall not fade Nor lose possession of that sand thou owest Nor Zamorak brag thou art in his shades, When in eternal lines to sand thou growest; So long as camels breathe or eyes can see, So long lives this and this gives life to thee.",
      "Al, Shall I compare thee to a Desert's Day"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "This is just to say I have nibbled the cacti that were by the oasis;  and which you were probably saving for lunch;  Forgive me, they were delicious, so crunchy and so cold. [Al composed it when he had accidentally eaten Ellie's cacti]",
      "Al, This is just to say"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "A battered and bent coin with Zamorakian markings. It bears the word 'Senntisten', which we believe to be the original name of the city, Saranthium, before it was rebuilt by those loyal to Saradomin. Partial numbers on the coin would indicate that it is from the year 3740, presumably from the 3rd Age."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Asking for someone's bank PIN is just as serious as asking for an account password... Under no circumstances should you tell another player your password, PIN number or any other personal details of your account.",
      "Rule 3 - Password Scamming",
      "Rules of RuneScape"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "In one of his four great dreams, Tumeken travelled to the border of his lands. On his journey, he saw many weak men and women struggling to cope with the heat. He helped them as best he could, but knew there was only so much he could do. After many days of travel, he encountered a great man who towered over all. He stood in the middle of a mountain pass, ensuring all could safely travel through. Tumeken approached the man and said: 'You are, indeed, the strongest of men. I shall give unto you a piece of myself, so that you may help me rule these lands. You will be an example to remind our people to take care of their wellbeing, both physical and mental.' And so, Het, the god of health, was born."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "In one of his four great dreams, Tumeken travelled to a part of his lands where two rival tribes were in opposition. He saw both sides engage in heated argument, but as he looked on, he also saw a troop of baboons. They were playing and learning together, sharing food and chittering excitedly. Tumeken called out to them, and one scampered towards him. Tumeken stoked [sic] the baboon and said: 'You are, indeed, the most sociable of creatures. I shall give unto you a piece of myself, so that you may help me rule these lands. You will be an example to remind our people to take pleasure in the joys of friendship.' And so, Apmeken, the goddess of companionship, was born."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "In one of his four great dreams, Tumeken travelled to a large settlement by the River Elid. Upon his arrival, the citizens prepared a great feast of excess in his honour. Horrified by the waste, Tumeken left the city. However, as he did, he saw a crocodile in the river, stalking its prey. The crocodile was slow and patient, but in the end, the meal was hers. Tumeken caught the eye of the crocodile and said: 'You are, indeed, the most resourceful of creatures. I shall give unto you a piece of myself, so that you may help me rule these lands. You will be an example to remind our people to never overindulge in physical pleasures.' And so, Crondis, the goddess of resourcefulness, was born."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "In one of his four great dreams, Tumeken travelled to the emptiest part of his lands. There, he came upon a lone cave which delved deep below the sand. Inside, Tumeken sat and reflected. However, as he did, he noticed a small scarab burrowing in and out of the chamber. Tumeken watched it for hours, until he finally snatched it up before it could flee. He looked at the small scarab in his hand and said: 'You are, indeed, the most isolated of beings. I shall give unto you a piece of myself, so that you may help me rule these lands. You will be an example to remind our people of the importance of tranquillity, but also the dangers of solitude.' And so, Scabaras, the god of isolation, was born."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Presently, we are in the 169th year of the 5th Age. The length of a day, of course, is equal to one cycle of the sun and the moon.\n\nThere are ten months in the RuneScape calendar. [...] An extra day is added to Moevyng every four years to account for an anomaly in the way the calendar has been calculated. Moevyng Day, as it is called, tends to fall in the middle of the month.\n\nThe most intriguingly-named month is the Ire of Phyrrys. My colleagues over at the Observatory have uncovered the charred remains of a diary that belonged to Phyrrys, apprentice to the astronomer Scorpius.\n\nEarly entries in Phyrrys's diary tell of how he was attempting to figure out the RuneScape calendar, based upon the astronomical studies his mentor was conducting. However, a few pages have survived of Scorpius's own diary, heavily hinting at Phyrrys's ineptitude, and how at the culmination of the apprentice's initial calendar research, he'd failed to account for a whole forty days.\n\nThis is backed up in Phyrrys's own diary entries, whereby from this date on, his anger (ire) seemed to grow and grow at his inability to work these forty days into the calendar. It is assumed that a later inhabitant of the Observatory found these notes and, quite easily, corrected the mistake by placing them between Septober and Novtumber, naming the month in honour (or more likely in jest) of the 'challenged' Phyrrys.",
      "Reldo"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "This polar bird, found in the far northern regions, can survive at impressively low temperatures. Although its long tail affords it great manoeuvrability, it is also the cause of a great deal of interest from collectors.",
      "William Oddity's Guide to the Avian"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Damn, to provide context... there will be some clues put out over social media, somewhat similar to crack the clue but considerably easier.\nBit of a raids teaser basically. Keep an eye on the old school twitter!",
      "Mod Kieren - From the comment of a reddit post revealing the first piece without a hint given."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "You are free to create as many accounts as you like, and you are welcome to trade between your accounts just as you would with any other player - you can log into two accounts at the same time to do this if you wish. Trading wealth or items between your own accounts is done entirely at your own risk. We advise that you use the trade system we supply to trade between your own accounts. Unusual trade methods like dropping, death or trust trades are particularly risky and we strongly advise against them.\n\nIf any of your accounts obtained items or wealth through rule breaking activity, for example macro use or real-world trading, then all your accounts may be banned.\n\nAlso, multi-logged accounts must not interact with each other to gain an unfair advantage in game play, such as ‘rigging’ the result of a minigame. For example, it is against the rules to have a number of accounts in a minigame all controlled by the same person, in order to try and guarantee the minigame outcome."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "As soon as you touch the coins you hear the grinding sound of bones against stone as you see skeletons and zombies rising up out of the ground. The coins turn to dust in your hands."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "We haven't been ruled by a king for many a year... that statue was long overdue for replacement anyway. You're not under arrest, I merely wanted to talk to you. But let me introduce myself. I am Veldaban, son of Dondakan. I am the Commander of the Black Guard in Keldagrim."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Deep within the Kharidian Desert, south of Shantay Pass, unrest is growing within the cities of Menaphos and Sophanem. With the threat of the Devourer still lurking in the shadows, the High Priest of Icthlarin has deemed it time to make contact with the citizens of Sophanem who had fled to Menaphos in the face of the recent plague. Thus far his attempts have proved futile, however, as Menaphos remains wary of the contagion and refuses to comply."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The copper longtail is found in temperate wooded regions and is one of the most common birds in the world. Although its appearance is unremarkable it is a graceful and successful bird that continues to fend well for itself.",
      "William Oddity's Guide to the Avian"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Over the course of the next four weeks we will be releasing four clues here on the forums. These clues will be solvable in game, allowing you to unlock one piece of a brand new set of cosmetic gear each week!\n\nOnce all four have been released, the information they provide can be combined to create a fifth, incredibly challenging clue. The first player to successfully solve this clue will be forever commemorated in game. All players who are able to complete the clue will also receive the fifth and final piece of equipment to complete the set!",
      "Mod Ronan,",
      "Old School RuneScape Community Management"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Similar to the last clue-seeker event, over the course of the next couple of weeks we will be releasing hints to help Crack the Clue. These clues will be solvable in game allowing you to unlock a piece of a brand-new set of cosmetic gear!\n\n\nOnce all clues have been released, the information they provide can be combined to create an especially challenging mystery. The first player to successfully solve it will be forever commemorated in the game. All players who are able to complete the clue will also receive the final piece of equipment to complete the set!",
      "Newspost announcing the event"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Join thousands of players attempting to unearth the hidden treasure scattered across Gielinor. The first person to solve all 5 clues will earn a special in-game reward. Be sure to keep an eye on our social media channels for the weekly clues!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What you needed to do, is you needed to take this probability calculation and put it into the right distribution, which is the Poisson distribution, which, as we all know, is French for fish. Anyway, you'd come out with an RGB code, which was red. And the solution is a red fish. A red herring. And you guys couldn't even get that, and you think you're gonna solve Crack the Clue? I don't think so!",
      "Mod Mat K"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "A long time ago, there was a person who went by the name of Mod Mat K, \nWhile working on the game, he had an idea one day. \n\nHe wanted to create a treasure hunt harder than anyone knew, \nSo he decided to create Crack the Clue I and II. \n\nThe first one was released and ended in a success, \nIt took longer to solve than anyone would guess. \n\nThe second one went by a bit too quick, \nAs players realised they could just use the brute force trick. \n\nBut now, Jagex wants to create something even more difficult, \nSo the search started to find someone else to consult.\n\nFinally, they found the one after looking far across the sea, \nMy name is Woox, and I'm the designer behind Crack the Clue III!",
      "Woox narrating the announcement video"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Thirty years ago, Crandor was a thriving community with a great tradition of mages and adventurers. Many Crandorians even earned the right to be part of the Champions' Guild! One of their adventurers went too far, however. He descended into the volcano in the centre of Crandor and woke the dragon Elvarg. He must have fought valiantly against the dragon because they say that, to this day, she has a scar down her side, but the dragon still won the fight. She emerged and laid waste to the whole of Crandor with her fire breath! Some refugees managed to escape in fishing boats. They landed on the coast, north of Rimmington, and set up camp but the dragon followed them and burned the camp to the ground. Out of all the people of Crandor there were only three survivors: a trio of wizards who used magic to escape. Their names were Thalzar, Lozar and Melzar."
    ],
    "personquoted": "Guildmaster",
    "template": "cquote2"
  },
  {
    "list": [
      "Back in my father's day, Crandor was an important city-state. Politically, it was as important as Falador or Varrock and its ships traded with every port. But, one day when I was little, all contact was lost. The trading ships and the diplomatic envoys just stopped coming. I remember my father being very scared. He posted lookouts on the roof to warn if the dragon was approaching. All the city rulers were worried that Elvarg would devastate the entire continent."
    ],
    "personquoted": "Duke Horacio",
    "template": "cquote2"
  },
  {
    "list": [
      "The crimson swift is a tropical bird that typically lives in dense jungle areas. Subtlety is not one of this bird's strong points, its striking red plumage ensuring it will be visible wherever it goes, making it a popular first bird for hunters and spotters alike.",
      "William Oddity's Guide to the Avian"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "A man came to me with the King's seal, I gave the man Daconia rocks, and Daconia rocks will kill the tree!",
      "Hazelmere"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Red is north of Blue. Yellow is south of Purple. Green is north of Purple. Blue is west of Yellow. Purple is east of Red."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Little is known about the giant eagles. There are reported sightings in many parts of the world, but the nests of these magnificent creatures remain elusive. The only record of such a nest being found is in the folk tale of the bandits of the golden claw. It is said that the bandits leader could talk to and befriend the eagles, and used the eagles' nest at the top of what is now known as the eagles' peak as a hideout. The story goes to hint at a secret entrance to the hideaway existing near the peak of the mountain, but until this day it has not been found.",
      "William Oddity's Guide to the Avian"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Hey guys,\n\nI want to take a few moments to apologise to you and explain where, why, how and what next will happen with regards to the new duck NPC in Falador Park.\nFirst off, we think it's important to explain the motives and reasoning behind the decision to add a new NPC to the game outside of poll. The original duck model was built inside the Easter event earlier this year, and as a nice gesture, I decided to move it to Falador park and rename it after a popular streamer as a thank you for their feedback and continued effort to support the game. Initially, this wasn't part of our development plan or schedule and was implemented quickly to have it in-game in time for the removal of Easter.\n\nIn retrospect, it's clear that the decision wasn't in line with our ethos and caused a considerable upset and division within the community, something we definitely did not intend to happen. Furthermore, the handling of the situation in regards to the removal of topics discussing the duck, whether they be positive or negative, was definitely poor.\nAs a result, the NPC has been removed from the game in the update which went live earlier.\n\nLastly, but by no means least, I'd like to take this opportunity to apologise for this incident. It's not within our nature to cause divisions or negative sentiment within our communities and part of what makes us a strong and focussed team is the support, feedback and continued existence of all player driven and controlled communities – Something we have always taken time to engage ourselves with and support.\nTo sum up, what do you think we should do next to ensure the quality and implementation of updates are in line with your expectations and how we can avoid situations like this in future.\n\nMod Reach and the Old School Team.\"",
      "Mod Reach"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The Godfather attacked us. We have fled to safety. If you are loyal to her majesty, find us by using the co-ordinates \"AIR\", \"DLR\", \"DJQ\", \"AJS\"."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The flames of Lloigh-enn are an often rumoured, almost mythical, barrier between various dimensions, that require a spell recited most precisely, that is different for each individual who wishes to pass through.\n\nI am surprised a mere mortal has heard of them, let alone encountered them in person;\n\nI had thought them long since extinguished... You have my gratitude adventurer, it is not often the curiousity [sic] of Zamorak is excited.\n\nI will have to look into this, it could be very useful in my plans...",
      "Zamorak"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I am writing to advise you that our secret preparations to the statue have been completed. All you need to do now is hit it with your boat. Take some gullible human along when you do, the mines are crawling with them these days. The human will surely get the major blame. \n\n After this, the statue is going to be rebuilt in the image of our great director. You need not concern yourself with the how and why, but rest assured you will be compensated greatly.",
      "Regards, Colonel Grimsson of the Red Axe"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Report on Intruder\n\n\nWe found a dwarf wandering in our mines. We weren't sure if he was a spy or simply an explorer, but we couldn't take any risks. We decided to send him back with his memory wiped, rather than put him to use as one of our test subjects. We can't afford having to explain another mysterious disappearance at this point. Additionally, we added something to the spell that would make him hungry for kebabs and thirsty for beer, so that whatever he can remember will be dismissed as the ravings of a drunken fool. Grunsh did a good job, he seems to be fitting in well. Nevertheless, the spell seems to have been a little bit too strong, the subject is unlikely to recover from his condition. His obsession with kebabs is a bit too extreme. Will tell Grunsh to adjust his spell next time."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Red Axe Employee Records\n\n\nHreidmar, director of the Red Axe (employee #1)\n\nInformation classified.\n\nGrimsson, the butcher of Barendir (employee #4297)\n\nGrimsson was once a soldier in the dwarven army and quickly made his way up the ranks, up to colonel. He served with the Black Guard at Ice Mountain and in Kandarin. He was present at the battle of Barendir when he fought against an army of trolls. It was here that he got his nickname, the Butcher of Barendir, as he mercilessly killed the trolls even as they retreated in defeat. Here, also, he got his distinctive scar running across his forehead in a hand-to-hand battle with a particularly ferocious troll. After this battle Grimsson became more and more aggressive, even to his fellow dwarves. Following a particularly vicious attack on a comrade, he was dismissed from the Black Guard. Soon after, he was recruited by the Red Axe. Here he's learned to control his rage and become even stronger. By now, he has become the right hand dwarf of the director. While he holds no official rank, he is still often affectionately referred to as 'The Colonel'.\n\nGrunsh, Ogre Shaman (employee #38262)\n\nFound lost and near death in the ice cold mountains above Keldagrim, Grunsh was nearly mistaken for a troll at first. Taken in by the Red Axe and nursed back to health, it turned out that he was in fact a powerful ogre shaman. Intelligent by ogre standards, and steadfastly loyal to his rescuers, he has taken up a prominent position in the ranks of the Red Axe. This is primarily due to the fact that since dwarves cannot use magic, they must rely on other races as spellcasters. Grunsh fits the bill perfectly."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Fragments have started to reveal themselves...\n\nOver the next few days, dIscover a trail of clues across our newsposts to uncover a new Fragment.\n\nGood Luck! The first person to @JagexSarnie on Twitter with #FragmentHunt & solve the name will win 6 months of Membership.",
      "",
      "Old School RuneScape Twitter"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Another clue uncovered...\n\nWill you be the firSt to solve all of the puzzles?",
      "",
      "Old School RuneScape Twitter"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "This marks the halfway point.\n\nWe've been enjoying alL the theories and guesses so far, but who will be the first?\n\nDon't forget to @JagexSarnie on Twitter with #FragmentHunt and the answer to win 6 months of membership!",
      "",
      "Old School RuneScape Twitter"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Another secret lies hidden amongst the completed solution.\n\nCan you discover where the secret frAgment is kept?\n\n#FragmentHunt",
      "",
      "Old School RuneScape Twitter"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Someone has solved the puzzle!\n\nHere's the fiNal trail of clues to finish off the #Fragmenthunt.\n\nStay tuneD for more details on the fragment which we'll reveal tomorrow.",
      "",
      "Old School RuneScape Twitter"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "With smile of Child-like wonder, and penetrating gaze, the enigmatic Gnome Child shall watch you all your days.\n\nIn good times and in evil, in fat times and in lean, he watches you with interest, but will not intervene.\n\nBut if you make the Gnome Child your champion or your friend, his freakish smile shall follow you, until the bitter end."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "...When the Temple Knights discovered rumours of the ruined temple, they immediately feared the return of some ancient evil and sent a contingent of their strongest warriors to investigate. The knight that lies dying amidst the crumbling masonry is all that remains of that doomed expedition..."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The golden warbler can be easily identified by its hideously annoying song. Although the warbler is prized by hunters for its fine feathers, it is probably caught just as much simply to shut it up.",
      "William Oddity's Guide to the Avian"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I am the great Iban, I cannot die."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "An imposter dares desecrate this sacred place! ... Home to the only true child of Zamorak. Join the damned, mortal!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Ivandis Seergaze of Lumbridge - A deft and well skilled man of unusual appearance, he held a most bizarre control over some powerful minions of Drakan's horde. A rod or staff helped imbue him with such power. Then with the aide of a Guthix serum he would turn the vile entity, often times destroying the creature instantly or reverting it to an original incarnation or worst of all enraging it greatly, much to the chagrin of his holy brothers."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Sadly the game was not as complete as we wanted and we spent the first few months trying to \"fix\" the game where we could. About a month or so ago we took the decision to stop trying to \"fix it\" as we still wouldn't have the game we wanted and the game certainly did not meet all the objectives and specifications established in the original game design document and therefore it would be better to go back to the founding principles and build the game we always wanted –Andrew is now overseeing the project and working very closely with the team to build, not all was lost as we naturally have developed the game engine substantially over the last few years and the new designs benefits massively from this as well as a ton of experience within the team as to what works and what doesn't. So whilst the content and a lot of the game play will change from what was previously built almost everything else will go straight back into Stellar Dawn.",
      ", 25 October 2009"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "My friend, you were right to send me to investigate the dwarf's drunken claims, for I have discovered a treasure beyond our wildest dreams. The aviantese are alive, and I suspect they still guard the godsword! Beneath the remnants of the temple a great battle is being fought between the followers of Bandos, Armadyl, Saradomin and Zamorak. My command was slaughtered and I am grieviously wounded. YOU MUST PREVENT THE GODSWORD FROM FALLING INTO THE WRONG HANDS! I do not know how I am going to get this message to you, why is that talking skull never around when he's needed? Your comrade, Sir Gerry",
      "Knight's notes"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Uncover Kourend's murky past and see another side to your adventures in Kourend Chronicles, a six-part series packed with new lore from your favourite continent. Check back each week for more stories, and keep your eyes peeled - we've sprinkled in a few cheeky hints for Kourend's future...",
      "A Kingdom Divided - Coming June 2021"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Myriad and beautiful were the creatures and civilisations of the early ages of the world. Gielinor was a work of art, shaped lovingly over the millennia by the creative mind of Guthix. Only the sturdiest races survived the God Wars, and even then only by abandoning their high culture and gearing their societies towards war. Of the more delicate races there is now no trace, and almost no memory. One such race had bodies as fragile as snowflakes, yet they built crystal cities that stood for a thousand years. The wind would whisper through the spires and fill them with sweet harmonies, and the rising sun would shine through the precious gems that studded the towers and create inter plays of light as if rainbows were dancing. Indeed, so marvelous was this light-show that the patterns of light themselves became alive, and great flocks of luminous creatures rode along the gem cast beams, each drawn to its own colour. The creatures you see floating in this chasm are the last sorry remnants of that age. I do not know how they made their way here and survived to this time, but I am grateful for their company.",
      "Juna"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "King Roald of Varrock has gratefully agreed to be Patron to my efforts to create a full, true, and accurate history of this world in which we live. I have made a start by opening two new sections available to the public; the official histories page, and the tales from the tavern.\n\nPlease be advised if checking out any manuscripts or documents that they are to be returned on time, and late fees will be deducted at a rate of 2 gold per day. I also ask visitors to keep the noise down in the research areas, or their library card may be revoked.",
      "Reldo"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I have tried to convince him to stay, but he will not listen. He believes our mother is controlling us, keeping us close against our will. He does not see that she only acts out of fear, fear that she might lose us. He wants me to join him, but I won't leave her behind. She is our mother, our creator, we owe everything to her.",
      "Memory of Seren, memoriam crystal (1)"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "She cries out for him, desperate for him to return to her. I've been trying my best to comfort her, but it has been little help. In her desperation for him to return, she has created new life in his image. They are pale imitations though, shadows of him and I. Their creation has been sapping her energy, and I fear she will grow too weak. All may not be lost though, for I may be able to convince them to sacrifice their energy and return it to her.",
      "Memory of Seren, memoriam crystal (2)"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "She has been dreaming more and more often recently. As she dreams, more beings are manifested. While her initial creations held some intellect, the latest ones have been purely instinctual. She is clearly running out of energy and running out of time. The beings that sacrificed themselves for her slowed things down, but it hasn't been enough. I am left with no choice, for I am powerless to help her. I have to leave her, before it is too late.",
      "Memory of Seren, memoriam crystal (3)"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "It was not easy to leave her, but I knew I had no choice. Since my departure, I travelled far and wide, finding nothing but empty worlds, long since abandoned. I almost gave up, but just as I was ready to stop, I came upon a world full of life. The creatures here, they are a joy to behold, living in harmony with each other and their home. I approached them, fearful of how they would react to me. It soon became clear that there was no need for fear. They fell in love with me, and I fell in love with them. At long last, I feel like I am home. Never shall I leave their side.",
      "Memory of Seren, memoriam crystal (4)"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "My dear,\n\nI wish you to know of the intense pleasure I am deriving as I observe your struggles in the Theatre. Your desperation in the face of your foe, coupled with the relief you show when you survive for just a few moments longer - the sight and scent of your travails are delicious. Bravo, you are a most talented performer!\n\nIf circumstances were otherwise, I would dearly love to summon you to my own castle's dungeon, where I could sample your pain in a more intimate manner. But, alas, your life will surely end with this performance, this swan song.\n\nI thus send you some nourishment to prolong my pleasure as I watch you struggle.",
      "Yours until death, 'Anonymous'"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I'm like, totally bored. My wife has her nose buried in a book, and snaps at me whenever I go near her.\n\nThe Theatre's not my thing, but it beats getting cussed at every time she thinks I'm interrupting her reading, so you may as well have some stuff to keep you fighting for longer.",
      "Amblor"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Meat sack,\n\nYour pitiful attempts to survive Verzik's Theatre are quite laughable. However, you are clearly under the impression that you can survive the challenges ahead, so I hereby enclose some supplies to prolong the agony for you.",
      "Marisa"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Hey human,\n\nI'm not much into the blood sports myself, but my husband's totally obsessed with watching this stuff. As long as he's busy watching you, he won't keep bothering me, so I can get on with this book I'm trying to read.\n\nHere's some supplies to make your fight go on longer.",
      "Cheers, Mervilla"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Peasant,\n\nYou fight well, for a human. I doubt my wife and I will find anyone more diverting to watch in the near future, so we are sending you this package to ensure your fight does not end immediately.",
      "Regards, Rachra + Roida"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Adventurer,\n\nYou've putting [sic] up a good fight there. Have some food to keep yourself going a bit longer.\n\nIf anyone's ever going to beat this Theatre, I'd like to see it be you. But that's not going to happen, obviously - it's far too hard for a human.",
      "Sargrita"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I bet my mate that you'd get a lot further than this, so here's some stuff to make sure you do. Don't tell him, okay?",
      "Trevallyn"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "You rock, human!\n\nHere's something to help you take the fight all the way to Verzik - give Her Freaky Ladyship a wallop from me, if you can!\n\nAnd hey, Ladyship, I bet you've got your goofy orators reading all these messages, but you're never going to know who I am!\n\nlol [sic]",
      "Unknown"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Hey human,\n\nYour struggle has been most entertaining so far. My wife and I wish to see more of your antics before you perish, so we are sending you some supplies to keep you alive for longer.",
      "Yours faithfully, Vladirog"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "We are most displeased with your performance. Are you even trying?",
      "Message if a player finishes a raid with a score of 0"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Hi there,\n\nThis is a message from Jagex Player Support.\n\nAs part of our ongoing investigation, unusual activity was identified on a number accounts [sic], including this one, which resulted in the movement of wealth and items back into the live game.\n\nAs a result of this investigation a member of The OldSchool [sic] Team has been dismissed from employment at Jagex for misuse of moderator privileges as related in the following newspost . [sic]\n\nWe have decided in these rare circumstances to return your account to as close as possible the state it was in prior to the incident by returning your lost wealth.\n\nPlease note that due to certain unavoidable restrictions we may return platinum instead of specific items so you can purchase replacements.\n\nWe take matters like this very seriously and, as such, we would like to assure you that we have taken steps to make sure that an incident like this will not happen again.\n\nIf you need further help, check out our online support centre.",
      "Jagex Player Support"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The time has come, my warriors. The gifts I bestowed upon you have served you well, and you, in turn, have served your god. Now, it is time to begin your servitude to me... to my god. You shall stand ever vigilant for His return, and then you will be champions in His glorious army - we shall have victory against the usurper. But first, you must die...",
      "Sliske"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Yes, that's it, fight, fight with all your heart. It's always so much sweeter when they resist us. Come with us. Come and be with us for all eternity."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Late last year Mod Balance and Mod Infinity made comments about Auto Hot Keys and mousekeys, specifically whether or not they were against the rules. A few RuneScapers weren't satisfied with their response to the situation and so we escalated the issue to our anti-cheating specialists who have confirmed that their statements were correct.\n\nThey have confirmed that:\n\nMousekeys (i.e. the windows accessibility tool) is allowed (it always has been); anything else is third party software and is not. If the team see evidence that a player is using AHK's, super-mousekeys or any other versions of this macroing software then they will take action against them. If a player is using normal mousekeys, they won't. The team are perfectly capable of detecting both and telling the different between them.\n\nWhen it comes to skilling, mousekeys can potentially give an advantage when it comes to emptying the inventory quickly, however this requires a certain level of skill, though the following section of macroing rule is quite clear in regards to this behaviour:\n\n\"Software that generates input to our game applets. This includes software that automatically moves the mouse pointer or generates mouse clicks or key presses.\"\n\nNow, mousekeys do not generate input as that is done by the user; it doesn't automatically move the mouse pointer to a specified coordinate, it moves it at a steady pace in the direction specified by the key pressed (2,4,6 or 8) and stops doing so when the key is released. It doesn't generate mouse clicks (as that is done by the user pressing 5) and it doesn't generate key presses. Without augmentation or modification (adjusting the inbuilt settings is not augmentation or modification and is fine) mousekeys are not capable of violating the rules against third party software.",
      "Mod MattHe",
      "Clan Leaders Forum"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "An aged guardian stands by a lever near the Yanille bank. When you talk to her, she lists the boss monsters of various quests that you have completed. You select which one you'd like to fight again. Once you're ready, you pull the lever. You are teleported into a cave that looks exactly like the KBD lair, but instead of the KBD you meet the monster you wished to fight. It's a private cave, so you'd have the monster all to yourself. If you win, you get rewarded with yellow tokens. The aged guardian exchanges these for degradable yellow armour that absorbs monster damage but not PVP damage.",
      "Mod Ash & Mod Nexus, Content Developers"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "'Obey the of your,  and ' - King Kharedst IV"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "A coin in very good condition with Saradominist markings. It bears the word 'Saranthium', which we have found to be the name of the city being excavated east of Varrock. The numbers on the coin would indicate that it is from the year 3804, presumably from the 3rd Age as the Godwars were coming to an end."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "\"I'm (very slowly) writing my own Java RPG, and eventually I want to have this oracle type thing up a mountain where you can go, and it will give you a hint on your current quest. Obviously you should make it fairly hard to get to. (i.e put it out of the way, and protect it with some monsters) but it does stop people getting completely and utterly stuck!\"",
      "Andrew Gower"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Our data science team draw account names from a pre-defined criteria that we supply, this usually include things like game bias, time zone, activity, pillar points, Authentication / Bank PIN equals true and so on. We vary the raw trawl of accounts from time to time to fit our needs, for example we have recently focused on OS game bias from Australian time zones.\n \nOnce we have that list we review each account for reports made about it, display name history and linked accounts to identify rule breaking on undesirable behaviour on alternative accounts. We then do some due diligence checks to see if any of the accounts are linked to cheating communities or have any links or concerns in relation to Community Safety issues. Once we have that list we extract any accounts that log in from countries whose Authorities provide public searchable *** offender records and, where possible, run a sense check against public records. We then run a hijacking check to see if the account user is involved in account phishing or other activity such as name selling or account selling and then finally a check of any payment fraud history. We sometimes do a few further adhoc checks such as removing accounts with a lot of public wi-fi or proxy access.\n \nOnce we have that final list the players can be invited and if they accept the invite they will move into a state where they can't mute anyone and their reports are closely monitored for about 2 months. Once we are happy that the reporting is of a good standard we move the account to a full P Mod status which means they can mute and also that the accounts are then checked weekly for security, activity and mute accuracy.\n  \nHope that helps.",
      "",
      "on Reddit"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Two distinct types of pottery have been recovered from the Dig Site, adding evidence to the two settlements on this site. The red clay pottery appears to be much older and occasionally has purple Zarosian symbols, while the Saradominist artefacts are usually of a lighter shade with blue decorations."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "What ultimately proved to be the final breaking point for Jagex was when several of the banks that provided the credit card processing services for Jagex started to charge a much higher processing fee due to the excessive number of charge-backs that were happening compared to other internet-based companies. It should be noted that Jagex wasn't necessarily singled out individually, as nearly all on-line gaming companies have had to address this issue to one extent or another. In addition, these banks threatened to completely cut off these financial services, report Jagex to various credit bureaus as a fraudulent enterprise, and issued an ultimatum that Jagex had to get the RWT issue under control. Quite literally, the very existence of Jagex as a company was threatened and had anti-RWT policies and game changes not been enacted, RuneScape as a game would no longer exist either."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "On a more serious note, many of you will be aware of our efforts to stop real-world trading and how some of our recent updates have been part of that. You may have questions about it: What does it mean? How does it affect the game? How big a problem is it? What are the ways of dealing with it? To answer these questions and more, we'll be releasing a very important Development Diary on the subject."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Our belief is that 25 million XP out of 250 million XP is not a lot. If someone is committed enough to get that amount of XP, the 10% extra is not going to make any difference to them. As for the difference between Jagex RWTing and RWT companies doing it is that we do it without negatively impacting on Runescape and use the revenue generated to make Runescape better.\n\nRWT companies create the bots, bot the game at the expense of players and keep the cash.\nEverytime we sell membership we are real-world trading. RuneScape wouldn't exist if we didn't do it.",
      "Mod Mat K"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "We don't want players to be able to buy their way to success in RuneScape. If we let players start doing this, it devalues RuneScape for others. We feel your status in real-life shouldn't affect your ability to be successful in RuneScape."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Our task is simple. Make a new Prayer book that doesn't outright overpower the Prayers we all know and love, bake in the common themes from hundreds of community suggestions, make something that feels rewarding for skilling-focused and combat-focused content, and deliver on some elements of high-risk vs. high-reward without making the new set of Prayers inapproachable. Simple, really.",
      "Jagex"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Two players take turns to draw a rune from a bag, which contains ten runes in total. Each rune has a different value: an air is worth one point, up to a Nature rune which is worth nine points. If a player draws the Death rune then the game is over, and they have lost. A player can choose to hold if they wish and not draw any more runes, but this runs the risk of the other player drawing more runes until they have a greater points total and win.",
      "Robin"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Aah RuneFest, seems our worst kept secret so far. We are planning a real world event for the players currently code named RuneFest. I can't give too much away otherwise the team will be beat me with my own shoes But I suppose I can say that I'm really excited about meeting the player(s). As are the rest of the Jagex family. Take care and hopefully see you all soon Irl.",
      "Mark Gerhard"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Runescape nation was the project name for RuneFest. No RuneFest will go international afterwards, the 1st will be in England. Yeah it will go on tour :) I can't say too much about RuneFest though as the will club be [sic] to death with my own shoes if I do :) There will be official coms on RuneFest to follow shortly I'm sure",
      "Mark Gerhard"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Yes Rule :)",
      "Mark Gerhard"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Class 09: Audio recordings; video recordings; audio-visual recordings; pre-recorded publications; downloadable electronic publications; data-carriers for audio and visual and audio-visual recordings; CDs; DVDs.\n\nClass 16: Printed publications; printed matter; books, leaflets, brochures; posters, postcards, stationery.\n\nClass 25: Clothing, footwear, headgear.\n\nClass 41: Entertainment; organising, promotion and production of entertainment and events; organising, production and presentation of shows, staged events, theatrical performances, concerts, live performationces and audience participation events; musical entertainment; live musical entertainment; production, presentation and distribution of sound and video recordings; provision of recreational facilities; arranging and conducting festivals; arranging and conducting competitions; arranging and conducting events relating to computer games and video games and Internet games; information and advisory and consultancy services relating to all of the foregoing.",
      "British Intellectual Property Office"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "During a pre-arranged meeting with the RuneLite developer we outlined our concerns with the nature of the client and asked for its immediate closure without the need to escalate any legal action against a dedicated Old School player. We did this because we believe RuneLite was and is infringing Jagex's IP rights and damaging the game which goes against our commitment to our community to maintain the integrity of the game. Specifically, the sharing of tools used to deobfuscate Old School RuneScape code, and then re-publishing said code.\n\nWhilst this may seem heavy handed, if ignored it's entirely plausible that this code could make its way into the hands of developers seeking to adapt it to create botting scripts, or developers who would implement game-breaking features. We cannot allow for botting to become an even easier pursuit with our code in opensource, without our permission.",
      "Jagex"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Hopefully the news that Jagex and the Old School team are tackling this project in earnest is something that excites you, even though it does mean that we need to politely ask you shut down your personal project.",
      "Jagex"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Hmm, syntax wise it's similar to any C-style language, except variable names are prefixed with their type (eg. %varname is an integer). We also lack full array support. Other than that, it'd do pretty much anything you could do in C or Java.",
      "Mod Chris E",
      "Game Engine Q&A"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "the key lies\n\nat the end\n\nof the path",
      "From the Twitter accounts of Mod Brow, Lenny, and Nin."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The 60kB limit was still in place when I wrote \"Sea Shanty 2\", so it was a simple tune like all those early tracks — again, I was going for catchy. It came very quickly to me once I was in the shanty-writing groove. It has remained in the game for well over a decade, and has always enjoyed a degree of notoriety because it's a cheesy earworm. Since Old School RuneScape launched in 2013, we came to realise that the fanbase had re-embraced the track, and it has become a meme. There are plenty of silly videos featuring it, Rick-Rolling, etc. Although it makes me cringe a little, I don't mind it being a humorous song as it has charm. One of my ambitions in life is to write a novelty track and retire from the proceeds. \"Sea Shanty 2\" might be my best effort yet, but sadly I'm not close to retiring...",
      "Ian Taylor"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "It's standard to not discuss active investigations and actions being taken, at least until after we've taken steps to resolve the issues. We became aware of a method being used to duplicate gold, and a combination of things - including tip-offs from Rendi and our system monitoring - led to us becoming aware of it very quickly. The Support and anti-cheating teams worked on removing a large amount of gold and investigated the accounts involved, whilst the SysAdmin and Engine teams were working on stopping it happening more. We remain diligent, and are yet to see any repeated occurrence of the exploit - work is continuing to improve our game systems to prevent this sort of thing from occurring again.",
      "Mod Sween"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "0000 1 1 0110 111000 10010 10010 1000 00 1 010101 0100 1011 10010 0110 01 0100 100 111 1010 101",
      "@OldpackAvailers"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      ".... - - .--. ---... -..-. -..-. -... .. - .-.-.- .-.. -.-- -..-. .--. .- .-.. -.. --- -.-. -.-"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "I wish I was a cow My life would be so simple I could lie around just eating grass And wonder if I was a pimple."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Twinkle, twinkle little egg Wouldn't you like to grow some legs? And run around, on grass so green arguing with the milk and cream."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "How goes it, blade of grass? I'm glad you're not any thinner You should invite your friends around So I can have my dinner!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "T'was brillig and the slithey toathes Did gyre and gimbol in the wabe All mimsy were the borrowgroves And the mome raths outgrabe."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "The key issues we had to consider when it came to splashing was that it has always been a part of Old School, however until the random events were removed it was something which wasn't appealing to players. Of course, there are those who think that splashing should remain as it is an easy way to level magic. However, we think that if everyone could get 99 magic easily any future update to the magic skill would be redundant.\n\nWhat we have decided to do is to emulate the effect of random events if you are splashing. So, if you are splashing in an area where you can receive random events and not interacting with the game for a period of time, your account will stop auto-retaliating.",
      "The Old School Team"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "There's a number of flatpacks that exist as objects in the game but you can't actually create them, because they were created when Construction was being developed as a skill way back in... 2005? 6? The flatpacks that exist were scrapped but the objects weren't deleted, so they made it into the live game... we could make them flatpackable, but there's no real benefit to it.",
      "Mod John C, Associate Producer"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "A man came to me with the King's seal. I gave the man Daconia rocks. And Daconia rocks will kill the tree!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "the"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Lady Verzik cordially invites you to the Theatre of Blood! The greatest collection of powerful beasts are here for your entertainment.\n\nTickets available from June 7th!"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "...Content Development often add little jokes to their updates. Sometimes we're told about them before they're added to the game. Occasionally, they believe that it would be more amusing to just add them without telling us. Then we get lots of messages asking what a 'Thingy' is..."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "TokKul is precious to us; why want you to trade it to someone else? Do you not know that TokKul is most sacred? We TzHaar age and harden, and when death takes us naturally we are then solid, unchanging obsidian. The ancients among us are then made into TokKul to ensure that they remain cared for by their descendents.\n\nJalYt-Ket: you would trade the bodies of your ancestors? We do not wish for TokKul to be traded by hands unwatched by TzHaar.",
      "TzHaar-Hur-Lek, Postbag from the Hedge 17"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "This beautiful bird can be found in hot jungle climates where it expertly catches small insects for food. It is perhaps therefore ironic that it is usually caught for its bright plumage, which can be used in turn to make excellent fly fishing lures.",
      "William Oddity's Guide to the Avian"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Gielinor's story is rich and vibrant. It spans thousands of years, has born witness to countless massive battles and the rise and fall of gods, heroes, villains, kings and queens. There are epics a-plenty, but among those are stories of everyday folk. The people doing the battling, worshipping the gods, and falling victim to the violence. Ordinary characters living in this extraordinary fantasy world. And that's where we wish to begin with the first of the Twisted Tales.",
      "Official description"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "TokKul is precious to us; why want you to trade it to someone else? Do you not know that TokKul is most sacred? We TzHaar age and harden, and when death takes us naturally we are then solid, unchanging obsidian. The ancients among us are then made into TokKul to ensure that they remain cared for by their descendents.\n\nJalYt-Ket: you would trade the bodies of your ancestors? We do not wish for TokKul to be traded by hands unwatched by TzHaar.",
      "TzHaar-Hur-Lek, Postbag from the Hedge 17"
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "Only as flesh becomes ash, \nand wood becomes dust, \n...will Iban's corpse embrace \nnature's eternal lust."
    ],
    "template": "cquote2"
  },
  {
    "list": [
      "While I sense the beating of a good heart I will not open. Feed me three crests of the blessed and the creature's remains, throw them to me as an offering... a gift of hatred, a token. Then finally rejoice as all goodness dies in my flames."
    ],
    "template": "cquote2"
  }
]