[
  {
    "list": [
      "This is likely a value that scales with prayer level; more research is needed."
    ],
    "template": "fact"
  },
  {
    "list": [
      "how much?"
    ],
    "template": "fact"
  },
  {
    "list": [
      "Not observed; could be speedrunning, D&I, or never was. Might be watchtower completion or fire pits"
    ],
    "template": "fact"
  },
  {
    "list": [
      "Confirmation needed. An elaboration may also be appropriate."
    ],
    "template": "fact"
  },
  {
    "list": [
      "It is unclear if an inconsistent delay after mining a dark essence block actually exists – the process appears always to take 9 ticks, even before the 7 December 2022 Mining delay removals."
    ],
    "template": "fact"
  },
  {
    "list": [
      "Unverified whether this also applies to any point before full completion of MM2 quest. It is possible to reobtain enchanted bars during and after completion of MM1 before MM2."
    ],
    "template": "fact"
  },
  {
    "list": [
      "It must be verified if the unlock hint sounded same in 2018-2021 before introduce of shuffling system."
    ],
    "template": "fact"
  },
  {
    "list": [
      "This may be 120 essence."
    ],
    "template": "fact"
  },
  {
    "list": [
      "Experience might depend on Strength level. Tests were done with level 82 Strength."
    ],
    "template": "fact"
  },
  {
    "list": [
      "Could it? Needlessly ominous"
    ],
    "template": "fact"
  },
  {
    "list": [
      "May be higher than 47"
    ],
    "template": "fact"
  },
  {
    "list": [
      "See fact below"
    ],
    "template": "fact"
  },
  {
    "list": [
      "Actual historical hint may not be accessible in public if it did exist prior to adding current one, and this one is 'restored' according to page's history"
    ],
    "template": "fact"
  },
  {
    "list": [
      "Needs testing if the ornament has any use during this quest"
    ],
    "template": "fact"
  },
  {
    "list": [
      "After the Emir's Arena was added?"
    ],
    "template": "fact"
  },
  {
    "list": [
      "Need verification as to whether or not Strength and Combat levels are required as well"
    ],
    "template": "fact"
  },
  {
    "list": [
      "The historical unlock hint is likely to be fictional and must be either changed or confirmed that it did exist in this form."
    ],
    "template": "fact"
  },
  {
    "list": [
      "Needs confirmation if there were any different unlock hints prior to Hosidius rework. If so, they must be added to changes section."
    ],
    "template": "fact"
  },
  {
    "list": [
      "The exact way to reproduce this is unclear; entering with a weapon equipped and quickly leaving afterwards seems to work."
    ],
    "template": "fact"
  },
  {
    "list": [
      "This is discussed on the talk page. The first one should be always successful only if the player receives an axe & tinderbox and/or chops a log and/or makes a fire. If the player uses another player's fire to cook a shrimp before doing any of that, the shrimp can be burnt with a 50% chance as before; if the shrimp is successfully cooked, the player can skip the woodcutting and firemaking part of the tutorial."
    ],
    "template": "fact"
  },
  {
    "list": [
      "How do we know this happened during the Fifth Age?"
    ],
    "template": "fact"
  },
  {
    "list": [
      "It must be confirmed whether this unlock hint was valid in 2018-2021, as it was copied from RS3 wiki before 2018 and not changed until music update in 2021"
    ],
    "template": "fact"
  }
]