[
  {
    "list": [
      "Dear Kaht B’alam,\n\nI trust you will be able to read this letter, since you seem to understand and remember our common tongue.\n\nNevertheless, since we’ve last spoken in your temple, I was curious, to say the least, about your kind and your history.\n\nWhile you did share a little bit of the mysterious past that surround your origins, it occurred to me that some of your shamans seemed to possess strange powers and abilities, and since some adventurers such as myself are in a constant quest for knowledge and power, I was wondering if you would be inclined to share this wisdom with some of us? In turn, maybe we could work something to bring our species closer, such as an alliance or a treaty that would benefit both of us?\n\n(To be fair, I believe we should try to end the war between the Shayzien soldiers and your tribe if we have the chance.)\n\nAlso, in my travels, I met an individual named Ket’sal K’uk, in the swamp, near the north-western coast, who seemed to be too preoccupied by his own rituals to bother speak to me at all. I was wondering if you had knowledge of his presence, and if you could explain me his doings? (Perhaps I would be able to assist him even, if he was to open up.)\n\nAnyway, I hope that this message will reach you and I thank you in advance for your time and reply.\n\nSincerely, Etienne II"
    ],
    "template": "letter"
  },
  {
    "list": [
      "How is the council faring with Kourend?\n\n\nLewisIsFail"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Rakkar,\n\nWhile your mind may have seen better days, I believe there is still something left of you in there. If so, what do you remember of your ill-fated expedition to this former fishing hamlet? How have you survived here for the last few years since the disappearance of the locals and your Fremennik brothers? What do you know of the mysteries lurking at the bottom of that nearby crevasse? What happened to the snakestone you tried to discard? And who or what is the Kayzertief?\n\nWith thanks,\n\nGentleTractor"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Can you tell the tanner in the middle of Forthos dungeon I hate him and his business model sucks?\n\nMazrrim"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Oh mighty Voice of Yama,\n\nHowdy! I've wandered about Kourend a good bit and found myself in a particularly warm chasm when I stumbled upon your goat-headed self. We chatted for a bit. Personally I thought you were a swell fellow, but you did seem standoffish about your master's intentions. What's the big boy up to? Gathering power, yeah, but like... what for? How so? Right now all he's done is blind a few guys and get thousands of demons slaughtered.\n\nAlso, you're a minotaur, correct? The only other minotaurs I've seen are stuck in some weird hole in the ground underneath a bunch of barbarians. Do you ever get any goat-like tendencies? The urge to munch on tin cans, perhaps? A very peculiar sound you like to make, a bleating-crying-screaming sound?\n\nAnyways, have a wonderful day, don't forget the sunscreen and say hello to your grandmother for me.\n\nGentleTractor"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Veos, you've been free of body possessions since I helped you... right? No new voices in your head? I was worried about you, dude.\n\nFlamingBunnyChanou"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Mrs. Mary,\n\nWhy does your house contain an incomplete windmill? It has the turbine outside, part of a grinder inside, as well as pot and sink downstairs, and a wheat field by the nearby guild. I would very much like to be able to make bread in the area.\n\nThank you,\n\nNomes"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Knight of Varlamore,\n\nWhat is Civitas illa Fortis like? And when will it be open to adventurers once more?\n\nSacKingsRS"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Rose,\n\nWhere is Xeric?\n\nPeriwinkleditor"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Hans,\n\nHave you ever felt a loss of purpose? When you're faced with the most troublesome news how do you often find yourself overcoming it? I've known you for years and I await your expertise.\n\nGratefully yours, DividedStory"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear King Roald,\n\nI hope this letter finds you well - I will keep this message brief. I have a question that's been burning in my mind for some time now, and I would hope you or your advisor could put it to rest.\n\nThe River Salve, and Paterdomus Temple by association, are incredibly important in keeping the dark forces lurking in Morytania out of Misthalin. Believe you me, I've seen what's over there and what wants out, and it's not pretty.\n\nSo please, when I ask you this, it's only for the sake of security and ease of mind.\n\nWhy in Saradomin's name is the only guardian of the temple an oversized pug?\n\nSincerely,\n\nA concerned citizen. (MasK_6EQUJ5)"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Akthanakos\n\nWhat have you been up to since you were freed from your imprisonment in Enakhra's temple? Your return has done little to affect the temperament of your Ugthanki, and they remain as irritable as always. I would appreciate it if you gave them a talking to so they would stop accosting me whenever I so much as glance at one as I make my way through the desert. I'm sick and tired of having to wash camel spit out of my robes.\n\n/u/wahisietel"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Brother Monk, you who performs the security checks for the ship to Entrana,\n\nI am submitting this formal complaint as a result of our recent interaction on the 19th of Pentember at approximately 5 past midday, when I was refused passage to the holy island of Entrana for the carrying of supposed illicit or dangerous goods. I was turned around angrily without a chance to speak, chastised, and demanded I contemplate my grevious sin.\n\nI reject your assessment entirely.\n\nI am not only a devout follower of Saradomin, but also the only possession on my person at the time was my pet salamander.\n\nMy Saradomin-loving salamander.\n\nLook, I get it. Security and all that. But while in line, I watched some of the most incredible individuals pass through your checkpoint. I saw a man walk by with an actual ballista with the string literally in his other hand. No issue. I watched a man adorned in crimson robes with a book in Zamorak's name, openly reading aloud as he waltzed through. No issue. I saw a lady dressed in a demon outfit with a carrot sword roll up, carrying a pet three-headed dragon. No issue.\n\nAnd yet I was turned around for my pet salamander.\n\nI was in tears. I still am. You guys need to reassess your priorities and reach for better standards, as this was completely unacceptable. I'm giving you 2 weeks to respond before I'm heading to the authorities. I'm expecting compensation and proper boarding rights for salamanders or you can expect to be in Port Sarim jail.\n\nSincerely,\n\nGnome"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To the Brassican Mages, the small yet dedicated sect of followers of the cabbage god known as Brassica Prime,\n\nWhy do you choose to follow such an enigmatic and mysterious deity? Is there something special to be found in cabbage, as what Saradominists find in wisdom and Zamorakians find in destruction? They find little use among us adventurers as they only restore 1 HitPoint when eaten, and are not robust enough to be worth farming. However, I would be delighted to be able to recognize the sacred properties of cabbage with the same dedication as you, if you are so inclined to teach them to me.\n\nRegards, findanegg."
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Lady Vulcana Lovakengj,\n\nI am writing to learn a little more about how the Lovakengj family history. Specifically, anything about Yonrith before and after he came to Kourend. I also wonder if there is any contact between the dwarves of Kourend and dwarves elsewhere. Like does your city have ties to Keldagrim and the trading companies?\n\nThanks,\n\nMaybeIAmCringe"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Question to the ghost I see roaming the wilderness:\n\nOoooOooooo OooooOooOoo. Ooo OooooOOoooOo OoooOoooOoo! OooOooooOo OooO Oooo. OooooooooOoooooOoooo? OooooOoooOooo?\n\nSincerely, OooOoo"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dearest Kaal-Mej-San, Kaal-Ket-Jor and Kaal-Xil-Dar,\n\nI understand that what I've done for you so far is truly nothing in the grand scheme of things, but I hope it is enough for you to trust me with the answer to the following question:\n\nHow were you three capable of traversing from Mor Ul Rek to Mount Karuulm? From what I know from the TzHaar of Mor Ul Rek, exiting the volcano brings your kind to a deadly low temperature. That's not even counting the fact that there's an entire ocean between here and there!\n\nYour friend, Zacflame\n\n(Note to Pete: It is extremely hot down there, be careful!)"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To Altarkiz,\n\nIs it true that you're a Bedabin Nomad? Why have you come so far from the desert? What are you concentrating on? Are you enjoying your trip?\n\nFrom Deztv"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To the esteemed Harold Death Esq.,\n\nHow is Nieve getting along? I hope she is coming to terms with her new environment and she treats Muncher well. Let her know I sent Glough her way.\n\nKind Regards, Ingus Wraith"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Dusuri,\n\nLately I've really been getting into hunting down those mysterious hunks of space rock that fall from the sky every so often. It's quite fun tracking them down and chatting with the other adventurers that come across them. The rewards you provide in exchange for the dust from these rocks is certainly a nice incentive; These golden duds are quite stylish, and I've had no trouble keeping stocked up on gems for my adventuring needs thanks to you.\n\nI have to ask though, what do you do with all that stardust? Us human adventurers can't do anything with it on its own, but you claim to specialise in the stuff. I'm just curious what's so useful about this dust that you're willing to part with so many precious gemstones to acquire more of it?\n\nTake care! I'll see you next time I've got more stardust for you.\n\nFrom Cambria Bold"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Reshi, Thomdril and Kendall,\n\nWhen I was last visiting Kourend, journeying out of Kingstown, I couldn't help but overhear the lovely music echoing throughout your camp. I stopped by and we spoke briefly. You informed me of your travels from the kingdom to the south, and how you were students of the College of Bards.\n\nI wonder if you could tell me a bit more about that? What's the college like? Do many bards come from or pass through there? What's your favourite thing about the place? And what's life like as a bard? I've yet to visit the city of Tempestus where the College resides, but I’ve heard good things.\n\nI must say, I'm quite jealous of your musical talent. I did once try to put on a show for the Fremennik people using their preferred instrument, but I must confess that I resorted to performance-enhancing magic to make up for my lack of skill. Shameful, I know.\n\nPerhaps one day I'll visit the College and get the right tutoring to properly learn the ways of the bard.\n\nYours sincerely,\n\nGentleTractor"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Drill Sergeant,\n\nYou look ripped. What's your workout regimen? Do you think Alathazdrar the demon butler could outrun you?\n\nSincerely, Fruitbooting."
    ],
    "template": "letter"
  },
  {
    "list": [
      "To Postie Pete,\n\nI've seen you on many of your routes delivering your letters. One thing I was curious about was your top secret visit to the Wilderness's Bandit Camp. What were you doing there?! You acted quite suspiciously, especially when you said the Chaos Elemental was behind me and vanished. What are you hiding?\n\nSincerely, Venomous."
    ],
    "template": "letter"
  },
  {
    "list": [
      "You can give cats to citizens in West Ardougne in exchange for Death Runes. The citizens claim that they use the cats to hunt rats in the area. The players believe that the cats are eaten by the citizens. Which is it?\n\nYours, Mod Zuko"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Sir Tiffy Cashien,\n\nWhat action will be taken regarding the fallen expedition to the so called 'God Wars Dungeon' and the knowledge we've gained from their sacrifice? The discovery that the aviantese still live and, even more shockingly, that the millennia-old war rages on, seems like the revelation of the century Yet since the death of Sir Gerry, I've seen no overt movement from the Temple Knights whatsoever.\n\nPerhaps some of your covert scouts have already reported this, but during my own expeditions I have noticed troubling signs around a certain frozen door in that accursed temple.\n\nYours, mpsdevil"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To the High Priest of Icthlarin,\n\nGreat Temple,\n\nSophanem,\n\nKharidian Desert\n\n\nGreetings, friend!\n\nIt has been a while since my last visit to your city, apart from a few trips to Jalsavrah pyramid of, errr, an entirely academic nature... oh look, is that Simon Templeton?!\n\nAnyway, is Sophanem faring better now that you can trade again? How goes the struggle for Klenter's soul with the Devourer? Have you settled into your new position yet? Incidentally, although we're well acquainted by now, you never told me your name. I'm embarrassed to say it never occurred to me to ask about it until now, either!\n\nTo the High Priest of Icthlarin,\n\nSpeaking of names, I had another question: the city of the dead is home to two great pyramids. There is Jalsavrah, tomb of kings, and the one south of it, where priests are interred. Does the latter also have a name? Indeed, the other named pyramids in the desert all seem to follow similar naming conventions; do you know anything about that, linguistically?\n\nGood luck, friend, and may Tumeken's light shine ever upon you. I have a feeling we will meet again soon!\n\nBest,\n\nLord Drakan\n\nP.S. On a related note, your suspicions about the Sect of Scabaras were correct and you should probably know there is an implausibly dangerous system of tunnels inhabited by the Scabarites and their giant scarab monsters beneath Sophanem. You really ought to look into that."
    ],
    "template": "letter"
  },
  {
    "list": [
      "Strange Old Man,\n\nI was wondering if I could ask a favour of you? Recently, adventurers all over Gielinor have been debating the original colour of the Barrows Brothers armour. Would you be able to shed some light onto this to ease the burden on our troubled minds?\n\nFrom heldire90"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Death,\n\nMy first kitten from Gertrude ran away two years ago. Is he still alive? :(\n\nThinkingThrust"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Bottomless Pit in the Camdozaal Ruins,\n\nI thought I heard some strange whispers when I peered into your inky depths. Might've been my imagination, but I figured I'd ask Postie Pete to toss this note down and see what happens. Either way, I hope to learn more about you in future; many of my favourite adventures have involved bottomless pits and mysterious whispers.\n\nSincerely, LongerRoad"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Fire Warrior of Lesarkus,\n\nYou might not remember me as we had our encounter many moons past - we fought a most glorious battle in the cisterns of the Temple of Ikov.\n\nI see now that I was misguided by the foul wizard Lucien and hope you can find it in your heart to forgive me for my transgression?\n\nDuring our encounter you introduced yourself as a fire warrior of Lesarkus, though I must admit I had never heard of such a thing in my many travels. Nor have I since.\n\nWhat is Lesarkus? Is it a nation, a city... or perhaps an order or religion? Are there other fire warriors, or perhaps heroes representing the other elements of Gielinor?\n\nI hope my questions are not too intrusive, but alas the library of Varrock has proven unable to answer these burning questions.\n\nWith great respect,\n\nTamriel"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Juna/Guthix,\n\nYou’ve shown mercy to our friend Zanik and saved her from a most unfortunate death. Please, will you find the love and compassion in your heart to resurrect our beloved Bob, a mighty cat who has fallen to the evil Dragonkin and his minion Galvek?"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Lady Tangwen Trahaearn,\n\nI hope that you are settling nicely into Prifddinas after so much unpleasantness over the past hundreds of years.\n\nAfter bringing you the runite bar to repair it I have always been fascinated by your exoskeleton. Could you tell me more about it?\n\nKind Regards,\n\n7Bears"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Chaos Elemental,\n\nThere's something I've been wondering for quite a while now. I hope it's not considered rude, but I really have to ask - what even are you? Yes, I know that you're an 'elemental' and all that, but what does that actually mean? Are you connected to TzTok-Jad? Apparently, he's some sort of fire elemental. Or maybe you have something to do with the Elemental Workshop? I do hope you answer this letter. It would be really nice to know you're more than just a weird tentacle cloud.\n\nSincerely, Rockfisher82"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To the extremely persistent Messenger,\n\nI know you're scared of your employer, but trying to pass that letter to me at the bottom of the ocean seems a bit much. Have you thought about a less hazardous use of your talents? Maybe delivering Gnomish cuisine?\n\nSigned, a slightly concerned adventurer"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To a Nechryael\n\nHey Mr Nechryael, I gotta question for you. Are you in any way related to the Mahjarrat? I've met a couple Mahjarrat in some ancient ruins in the desert and they kinda look similar to you (although I must say you look much more muscular than they did, do you work out?).\n\nSincerely,\n\nTheWiseLoner"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To My Arm,\n\nHow are your farming adventures going? It only felt like yesterday when I was watching you pick your very first Gout Tuber.\n\nMaybe we can go on another adventure together sometime soon?\n\nSincerely, your strangely-named human friend"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Pontak,\n\nFifteen years ago, on the 29th of Septober in the 168th Year of the Fifth Age, I wrote you to give an update in my quest for Zamorak's teddy bear, Saradomin's wig, a left-handed chisel, cheese from the moon, and a dodo egg.\n\nFirst, I'd like to apologize for my language; I was but a mere child at the time. In the many years passed, I've since completed the trials once over again, and even slain the mighty Jormungand, and am now known as Thorkar Dräpare. It's safe to say I have grown substantially over these years. To that end, I'd like to make amends and extend my hand for a truce. What say you?\n\nSecondly, I wanted to give you an update. I've since located the Mage Gower's skull; you'll be interested to know that he actually still possesses it. I pen this note from inside my sleeping bag, which I use often. I had Guthix's climbing boots, but sold them many years ago after their street price skyrocketed. And, recently, I traveled to Zanaris and was able to craft a delicious cheese from the many cows that inhabit that realm. So, I have now retrieved that item as well. However, despite my many efforts, I have yet to locate the dodo egg. However, rest assured: my quest continues to this day.\n\nI hope this finds you well, and I do sincerely wish you all the best.\n\naragornjack1"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Pontak,\n\nWhy do you hate all outlanders? You are mean. And by the way, I bought Zamoraks Teddy Bear, but i got rid of it. It tried to attack me. You wouldnt want one of those. And I have the left handed chisel. All regular chisels are left handed. And Saradomin's wig belongs to Veleornia. She's actually a boy who is bald. She went to the makeover mage, and he forgot to give her hair. Oh and one more thing, Im level 57 and im soooo much stronger than you. I only need to kill Koschei the Deathless and then Ill have seven votes and Brundt will let me in. hahahahah u are a noob.\n\nHope you have a bad life,\n\naragornjack1"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To the representative of the Gielinor Banking system,\n\nWhat was your reaction the first time you saw someone try to deposit the mythical Godsword? Are there items that the wonderful Banking staff prefer or resent? My second question is about your new branch being opened in the near future. What was the process like acquiring the land rights in the newly discovered Ancient wing of the God Wars Dungeon? I’ve been enormously impressed by your commitment to customer service (like your work with the chest on Ironman Isle on Fossil Island), and I’m very impressed that you’re taking this to the next level. Will you be getting KC for your personnel every time that items need to be brought down?\n\nGratefully yours, The Adventurer"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To Skotizo,\n\nYour feet so big, but flipper so small, why?\n\nSincerely, a flipper enthusiast"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To Konar quo Maten,\n\nI found a Brimstone Key and it says it's for your heart. Can the next task you give me be a nice walk in the park with you?"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Mambo-duna-roona and Patrick,\n\nI recently built a Large Orrery in my home, and after studying it I am perplexed. It shows our home planet Gielinor, alongside our moon Zanaris, in orbit around a star. However, I also noticed a second planet with two moons also orbiting our star.\n\nWhat is this planet? Is it inhabited? Are its moons similarly inhabited by magical fairies like Zanaris? I'd love to know.\n\nWith great inquisitiveness,\n\nWorldstream"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Can you please tell Bob the Cat I said pspspspsps?"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Dad,\n\nWe all know how trolls get their names, and I admire your sense of hunger. But was your father named 'Dad'? Was he named for his father? This begs the question, how far back does the line of Dads go? Where does the family 'tradition' start?\n\nYours,\n\nBreastmilk"
    ],
    "template": "letter"
  },
  {
    "list": [
      "For the eyes of the Wizards' Tower's Chief of Research only.\n\nHello Sedridor, it has been a while since we've spoken and in the long time since, I've become Aubury's equal in the art of Runecraft. How time flies!\n\nWhilst news of a new type of rune has hopefully reached your ears, I write this letter to you in hopes of finding some information about some runes that appear to have been lost to this world.\n\nAncient caches of times past appear to refer to the existence of a man known as 'Mage Gower', who discovered what he called 'master runes' that not even I have heard of. Namely, the life, illusion, reality, and time runes. I believe if information about these runes were to be re-discovered, it could push forward our knowledge of magic and perhaps change our perspective on the history of magic as well.\n\nHowever, if the properties of these master runes are indeed what they claim to be, it may be wise for them to remain hidden away; you could even say that their power is the reason that knowledge of it was sealed away by this Mage Gower.\n\nBest regards,\n\nSpineweilder"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Cow31337Killer and Unicorn1337Kilr,\n\nHave either of you ever encountered the mythical Unicow? More importantly, which one of you would be responsible for killing it?\n\nYours, etc.\n\nHlwys"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Jonathan,\n\nI was referred to you by one of the more helpful staff in the Arceuus Library, as you are the historian specialising in the history of Hosidius.\n\nDuring one of my adventures in distant lands across the Western Sea, I visited a massive library, one far larger than even the one in Arceuus, and came across a certain diary written by an adventurer originating from Hosidius.\n\nMost of the pages are stained with blood and have become illegible, but readable entries of the diary appear to have been written during the 33rd decade, which according to Imerominia, should be dated around 200 years ago after the War of the Five Houses.\n\nThe adventurer appears to have perished by the hands of Skotizo, the dark demon beneath the Catacombs, who I've had a close encounter with. As the expert in the history of Hosidius, do you know the name of this adventurer and the details behind the events they were involved in?\n\nI should probably send this diary to you in hopes that you may find someone who can recover the entries stained by blood."
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Freja,\n\nI recall when we first met, you mentioned that you were planning an expedition to the Isle of Garmr and Acheron. I believe you said that you didn’t want me to help you kill that boar of yours because you wanted adventuring partners with more experience under their belts. But as it’s been a few years since then, would you consider taking me along on your expedition sometime soon?\n\nRegards,\n\nFursonaHaver"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Barlak,\n\nI hear that people bring you bones and giant shells, and that the Dorgeshuun use the bones to prop up the mine shafts and to make other temporary structures.\n\nWhat do the Dorgeshuun use snail and tortoise shells for?\n\nRegards,\n\nSedridor"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Bryophyta,\n\nGiants are all over our world, but we know so little about you. Do moss giants follow Guthix because you seem to love nature so much?\n\nHow do you grow such a lush forest in an underground sewer? Are you friends with Obor? And when might we meet another Titan like yourselves?\n\nI love you Mossy Mommy!\n\nRegards, MissingPear"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To Tarn Razorlor,\n\nI write to you in awe and bewilderment after hearing a tale from an adventurer I am friends with. First and foremost, I am so sorry that he actually stole your journal! Some adventurers really just take anything they can get their hands on, don't they?\n\nNow, I'm not as innocent as I could be myself. I listened as he read some of your writing out loud, and I didn't stop him as quickly as I should have. With all this said, I was wondering if you would be willing to provide further insight into this ‘great library’ that was mentioned in one paragraph after another? It's truly shocking to hear that such a facility really exists in Morytania! My mind is overwhelmed pondering over the type of valuable knowledge that might lie there. Antique spell incantations? Esoteric enchanting techniques? Perhaps the secrets behind how Saradomin's army in the God Wars supplied its wizardly troops with magic equipment?\n\nPlease, you must shed light on where this great library is located so that its knowledge may be studied and put to use! This is for your own sake as well, as refusing might result in your diary being handed to various scholars for awareness and study, baring anything of intimacy that might lie within its pages...\n\nRegards,\n\nMaximax"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To Thurgo,\n\nA while ago I told you about the lost city of Camdozaal, and its sole inhabitant, Ramarno, another Imcando dwarf. I was wondering if you had visited yet, and if not, would you like to?\n\nI'll bring the Redberry Pies,\n\n- SAwesome1018"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To the Sphinx and the good people of Sophanem,\n\nI hope things are going well in your city! I can only imagine your new partnership with the Banks of Gielinor drives a lot of tourism. I've been up to a lot of adventure lately and explored the various tombs and temples around the desert. Jaldraocht had relics and treasures of an ancient god buried within, Uzer held the key to a major demon's banishment, and you are no doubt familiar with my misadventures in Klenter's pyramid and Jalsavrah!\n\nThe view from atop Jaleustrophos is remarkable, too. Speaking of that view, it's hard to see as of late, but I think I've caught glimpses of ruins to the east and something larger to the south. Some novice treasure hunters have begun to assemble in Nardah and, since I've plundered just about everywhere else, I can only imagine this is where they're headed. Having seen them in action, I must admit I worry for their safety. They're not likely to heed my warnings, so I am writing to you hoping for insight and advice that might keep them alive. What can you tell me about those reaches of the desert?\n\nRegards, Your Favorite Gullible Yet Well-Meaning Adventurer"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Ferox,\n\nNow that you've been studying the history of the Wilderness for a while, have you made any interesting discoveries?\n\nFrom Jade_Mans_Eyes"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To the dog in Varrock,\n\nWe loves you.\n\nWhat do the Dorgeshuun use snail and tortoise shells for?\n\nSincerely,\n\nThe OSRS Community"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To General Graardor,\n\nIt is rumoured that you are the last known living member of the Ourg race (I hope that doesn't surprise you; I dont know how much you know of the world outside of the 'current' war). I'm wondering if those rumours are true. Are you an Ourg?\n\nThere are also rumours that your bones are not Ourg bones, but regular big bones (don't ask me where these stories came from). If you are indeed an Ourg, how come you don't 'drop' Ourg bones?\n\nSincerely,\n\nTheWiseLoner\n\nP.S. I've met an Ourg by the name of Slash Bash (unfortunately he was an undead). Did you know him?"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Barrows Brothers\n\nHow do you feel about people constantly raiding your resting place? I always feel bad when I dig you up, but my need for your clothing outweighs my sorrow. I hope one day you can rest in peace.\n\nWith love and respect to my fellow bros,\n\nCode-4"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To Archmage Sedridor,\n\nThe Wizards’ Tower is a very nicely constructed building and quite a standout piece of architecture, considering the long bridge to reach it and it being completely surrounded by water. However, when entering your quarters downstairs, it seems as though you live in a dungeon! With the dirt floors, broken down walls, and a skeleton to boot it is certainly no place for an Archmage to dwell. Have you ever thought about sprucing the place up to be more fitting for a head mage?\n\nYours in magic, Cashlemke"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Pet Rock,\n\nAre you ok after being boiled in that one adventure we had? I like to let you rest in my cat basket but I worry you get restless. Would you like me to take you anywhere? To do anything? or are you happy napping?\n\nFrom your best friend (Lorb163)"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Bob,\n\nI have been a regular patron at your axe shop, I would like to know how you learned your skills to repair the extremely rare Barrows armour.\n\nDo you have a secret history? Or perhaps this is a hobby that you refined into a skillset? I would love to know your story.\n\nSincerely, BoopNFloop"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Demon Butler,\n\nHow do you teleport infinitely, and with what magic or item? Also, where do you spend all the money we pay you? What do you like to do outside of being a butler for us?\n\n119arjan."
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Apothecary,\n\nThrough my adventures you've helped me a countless amount of times with potions and brews that I had never seen before and currently still lack the expertise to make. This makes me curious; Where did you learn your art? I had to learn the methods of the Taverley druids to be able to train the skill of Herblore, do you have any relation to them? How did you learn such proficiencies?\n\nPlease enlighten me!\n\n- Pyia\n\n(P.S. If you happen to have any hair care tips, I would love to know)"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To Randivor (proprietor of Keldagrim's Best Bread),\n\nDo dwarfs actually eat dwarven rock cake? Or is it the sort of thing you keep at the bottom of you backpack to stave off hunger with the knowledge that things could be worse, you could be eating dwarven rock cake.\n\nFrom, A (not so hungry) Adventurer, GreedyTacoTheif"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Gnome Child at Holiday Event,\n\nO wise child of gnomish descent, we met in 2020 to celebrate a birthday. You may remember cat ears that were honestly a bit cringe.\n\nWhen we spoke at the party, you gave me a number of cryptic, prophetic statements. I see now the wisdom in many of your words. Have all of your predictions come to pass, noble sage, or are some of these prophecies yet to be fulfilled?\n\nYour disciple,\n\nLux"
    ],
    "template": "letter"
  },
  {
    "list": [
      "My dearest Cyrisus,\n\nHow long has it been, old friend? It seems like both yesterday and years ago that we last met! The odd chats I get with you tend to be over Lunar magics, but I know that neither you or I are fond of such artificial, 'virtual' communications.\n\nHow have you been doing? You've mentioned taking on some of Gielinor's greatest challenges, but new ones seem to emerge every day. Have you thought about coming with me on another adventure sometime? There's a lot out there that we've yet to explore together (even a whole continent to the west, I'll have you know), and something tells me that any extra preparation we can make for the future will pay back in spades.\n\nLet me know,\n\n~ Gnome"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Thermonuclear Smoke Devil,\n\nI've had a lot of fun duelling with you and your brethren, although through all the smoke I'm not quite able to tell; do you have a large eye, or a wide, open mouth? My eyes sting after being in the cave for a bit, so I'd hope yours don't! I'm also curious about the plethora of skeletons strewn about the cave. They don't particularly look like any creature I've seen on my adventures! Do you perchance know what these might have been in their golden years?\n\nLots of Love, Seph\n\nP.S. Don't worry! I've been taking good care of Lil' Thermy."
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Mr. Death,\n\nI found myself wondering what you do with the many millions of gold you’ve reaped from players over the years. Are you saving up to start a haunted house or something?\n\nPaulet42"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To Martin The Master Gardener\n\nYou've been taking care of pigs for the better part of two decades now. Will we ever be able to learn some new skills and join you in the raising of cattle?\n\nFrom Wishgrantedmoncoliss"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Hello Gielinor Litter Crew,\n\nFor as long as I’ve existed, I’ve seen items vanish from plain sight on the ground after a few minutes. Where does this stuff go? Is there some secret vault under the ground filled to the brim with forgotten treasures? What do you do with the millions of logs, fish and bones you surely collect every day?\n\nThanks,\n\nLitterbug in Lumbridge"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Myths’ Guild Labrador,\n\nThank you for the warm welcome when I joined the guild. Are you also a member of the Myths’ Guild? If so, what was your feat that granted you membership?\n\nRegards,\n\nPup"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Wise Old Man,\n\n\nHave you ever been down on life? What do you do and how do you handle it? Hopefully in all your years you've gained some knowledge on the matter."
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Shantay,\n\nHow upset are you that all the content creators call you 'Shanty' behind your back?\n\nThanks,\n\nA concerned desert citizen"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Greetings General Babacus,\n\nI've recently spent much time in your great city while preparing to take on the fierce Lizardman shamans, and I've come to admire how well-supplied the troops of the Shayzien army are! The head guards in particular are each equipped with a dragon longsword and a dragon square shield. How have you been able to source this magnificent equipment for your head guards? Do you have a special agreement with the fairies of Zanaris and Siegfried Erkle of the Legends’ Guild? I wasn't even able to wield a dragon longsword (despite certainly being adept enough) until after I had entered the Lost City myself! Moreover, I'm sure your head guards are worthy of being called legends, but I haven't seen any of them at the guild whenever I stop by.\n\nThe Shayzien house must truly have some master negotiators on their side.\n\nYours,\n\nArtchu25"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Oh gaseous horror / Who resides so deep / By char and castle / You do so creep\n\nTentacles flail / With eldritch flair / Chaotic magic / Disturbs the air\n\nI have for thee / A simple ask / As you have done so / In the past\n\nGrant us foresight / Of what's to come / Afford me this / And thy will be done\n\nAs your thrall / I'd submit to you / Give my loyalty / For just a clue\n\nLewu"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Kangai Mau of the Rantuki Tribe,\n\nIt has been a while since I've helped 'recover' your tribal totem from the dastardly Lord Francis Kurt Handelmort. I hope it remains in your care; it was quite the challenge to take it!\n\nThat being said, it would be very insightful to learn more about your tribe, such as its customs and way of life. Are there other tribes hidden in the jungles of Karamja? Lastly, what do you know of the ancient temple on the south coast of the Kharazi?\n\nYour esteemed thief,\n\nSpineweilder"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Kovac,\n\nHow did you obtain the Smiths' Uniform you sell in your reward shop? It's too small for a Giant and too big for a Dwarven smith. It's a very odd piece of equipment for a Giant smith to have laying around.\n\nBest regards,\n\nMajlo"
    ],
    "template": "letter"
  },
  {
    "list": [
      "' The Jackal’s Torch ''\n\n\nOnce, long ago, three mortals were led through the land of the dead. They travelled together on the dismal road of the Underworld. The Devourer’s beasts were not to be seen then, but the Underworld was still a treacherous place: souls were lost in mist, the Noumenon called and pulled souls to its hidden depths, and impossible whispers lead them astray to places even the gods knew not. But worst of all was the darkness. More than anything, the Underworld was a dark place. The Sun’s light could never reach so low. But in His stead was His son. The guide and protector. The wanderer in darkness. Icthlarin, god of the Underworld.\n\n\nIcthlarin led the party of three blindly through the darkness, relying on scent alone. The only light by which to see was the glow from their spirits – enough only to not stumble and fall.\n\n\nAt last, they came to a passageway, and Icthlarin turned to the first of the three and said:\n\n“This is your port of call. Through here is music and peace everlasting. You will want for nothing. Now go, for my endless task continues and there are more souls to guide.”\n\nAnd so, the first of the three bowed graciously and passed on.\n\n\nAfter a journey through mist, they came to yet another passageway. Icthlarin turned this time to the second of the three and said:\n\n“This is your port of call. Through here is discord and war everlasting. You will always want more. Now go, for my endless task continues and there are more souls to guide.”\n\nAnd so, the second of the three bowed respectfully and passed on.\n\n\nThen Icthlarin walked in silence. He stopped at every crossroads and crossing, every path and passageway, but still he walked. At last, he turned to the third and asked:\n\n“Where is your port of call? I can find no place for you in all the Underworld. Your scent is on no hall.”\n\nThe last of three replied:\n\n“My place is with you. You outshine your father and all else above. Service, not rest, is my reward.”\n\nThe god grew silent then and knew not what to say.\n\n\nThey walked longer through mist until at last Icthlarin said, his back turned:\n\n“You know not of what you speak. I have no port of call, no halls to call my own. My life is spent in in-betweens; my task is never done. No, my father’s field of reeds, that is best for you.”\n\nYet the mortal was persistent:\n\n“I care not for your father’s field of reeds nor any other hall! I need no port of call!”\n\nAnd Icthlarin was angered by their insolence:\n\n“What aid can you give me? Your spirit is dim and has not even the brittle strength of bones.”\n\nThe third answered:\n\n“The light of my spirit may be dim, but it is better than darkness.”\n\nThe god considered:\n\n“It is a lonely path. You will meet many, but they will all pass you by.”\n\nAnd the third smiled:\n\n“The better to share it.”\n\nIcthlarin grew silent once more, but then he turned to the cave wall. He tore free one of the roots of the world and extended it to his mortal companion and said:\n\n“Come then, for our endless task continues and there are more souls to guide.”\n\nAnd with the third’s touch, their spirit became the first ember and lit the root’s end.\n\nIt was a beginning. Since then, Icthlarin has never wandered alone, for all those who serve him are wanderers in darkness too. They are the light in the jackal’s torch.'''"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Varrock Museum Curator Haig Halen,\n\nI feel like I can call you Haig because we are so alike. I'd like to be able to use my rare fossils one day, it'd be great to make a new display. I know I don't know as much about fossils as you but I think you'd be impressed with my knowledge. I love your monocle, you look very classy. Do you ever use your rare fossils for Prayer XP? Me neither. These are all things we can talk about and more. I know you have not been seeing my Fossil Island jokes because I know you would set up a new display if you did. I hope you set up rare fossil displays this time, and we can become good friends. I am sure our relationship would be a real rare find!\n\nBone Voyage,\n\nu/SlothyPotato"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To Koschei the Deathless,\n\nHow long have you been living amongst the FreMennik? What were your TriAls like? How many Chieftains hAve you fought aLongside, and how many have you seen to VaLhalla? Do you live with Thorvald, or do you just uSe his cavern for the Trial of Bravery? What's your favorite part of being a Fremennik? Do you often get the chance to visit the various Isles?\n\nHave you ever wondered about your past? Peer helped us with ...something, during the creation of V's Shield, he might be able to help you with your memories! And if that doesn't work, we might be able to get you an audience with the Oneiromancer, if you'd accept such a lunatic idea.\n\nTo get to the real meat of this missive, though;\n\nWhere were you when the basilisks attacked?\n\nI definitely expected to see you KHARving a swathe through the basilisk. I would never accuse you of SHAIing away from combat, but your absence was quite notable.\n\nWere you leaving slain creatures in your WAKE UP at the hobgoblin coast? Did your blood (and theirs) run deep upon those rocky shores?\n\nIf you wish to REMEMBER the taste of true combat, to know it in your very bones, I hear there are mightier foes to prove your mettle in THE NORTH.\n\nI'm sorry,\n\nSculpt0r"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Hazelmere,\n\nBlah blah blah blah blah blah, blah blah blah? Blah blah blah blah blah blah, blah blah, blah blah blah blah. Blah blah blah blah blah blah? Blah blah blah blah blah, blah blah (blah blah blah blah blah)?\n\nFrom OreOfChlorophyte"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To Imerominia,\n\nI was reflecting on the conversation we were having recently about the history of Kourend, and I have what feels to be, quite frankly, a very foolish question to ask. Who or what was Twill? Was Twill the place where the royal accord was signed, or is the accord named after some instrumental person who was key in bringing about the agreement? I had assumed that Twill was a place given that no one named Twill is referenced in the document, but as a burgeoning historian myself, I’m trying to hold myself to better standards than such simple assumptions. When I was helping Jorral discover the history of the outpost to north-west of West Ardougne, he instilled in me the necessity of conducting first-hand historical research. Any light you could shed on this topic would be most appreciated.\n\nRespectfully,\n\nDheginesa\n\nP.S. I know that travel away from the Dark Altar can be difficult for the citizens of Arceuus, but I think you should visit the outpost some time if possible. The museum Jorral runs there is quaint but still very charming. I'm sure you'll find yourself enthralled with his work."
    ],
    "template": "letter"
  },
  {
    "list": [
      "To Jorral,\n\nAfter our last encounter I've travelled the world far and wide looking for more treasure with the enchanted key you gave me. Sadly it seems to have disappeared from my bag at some point. Have you seen it by any chance? If so, could you try rubbing it near the sheep pen north of Ardougne (alternatively I'd be willing to do that for you in case you need to stay at the outpost doing historian things)? I have a gut feeling we could use it to gain interesting insights into things that happened in the past *cough* invasion of Avarrocka, betrayal of Zaros, generic battle in the actual god wars *cough*\n\nYours truly,\n\nNot the real Zaros"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Odd Stone,\n\nI hope you and the rest of Weiss are doing well.\n\nI am writing to get a bit more info on that story you told me about the bone-headed human you saw at the stone where you got your name.\n\nI have met a few of those bone-headed people myself now. Some are friendly and some are very dangerous. Any details about them you might remember would be useful, we want to make sure Weiss isn't in any danger after all.\n\nRegards, MissingPear"
    ],
    "template": "letter"
  },
  {
    "list": [
      "The Jackal’s Torch\n\n\nOnce, long ago, three mortals were led through the land of the dead. They travelled together on the dismal road of the Underworld. The Devourer’s beasts were not to be seen then, but the Underworld was still a treacherous place: souls were lost in mist, the Noumenon called and pulled souls to its hidden depths, and impossible whispers lead them astray to places even the gods knew not. But worst of all was the darkness. More than anything, the Underworld was a dark place. The Sun’s light could never reach so low. But in His stead was His son. The guide and protector. The wanderer in darkness. Icthlarin, god of the Underworld.\n\n\nIcthlarin led the party of three blindly through the darkness, relying on scent alone. The only light by which to see was the glow from their spirits – enough only to not stumble and fall.\n\n\nAt last, they came to a passageway, and Icthlarin turned to the first of the three and said:\n\n“This is your port of call. Through here is music and peace everlasting. You will want for nothing. Now go, for my endless task continues and there are more souls to guide.”\n\nAnd so, the first of the three bowed graciously and passed on.\n\n\nAfter a journey through mist, they came to yet another passageway. Icthlarin turned this time to the second of the three and said:\n\n“This is your port of call. Through here is discord and war everlasting. You will always want more. Now go, for my endless task continues and there are more souls to guide.”\n\nAnd so, the second of the three bowed respectfully and passed on.\n\n\nThen Icthlarin walked in silence. He stopped at every crossroads and crossing, every path and passageway, but still he walked. At last, he turned to the third and asked:\n\n“Where is your port of call? I can find no place for you in all the Underworld. Your scent is on no hall.”\n\nThe last of three replied:\n\n“My place is with you. You outshine your father and all else above. Service, not rest, is my reward.”\n\nThe god grew silent then and knew not what to say.\n\n\nThey walked longer through mist until at last Icthlarin said, his back turned:\n\n“You know not of what you speak. I have no port of call, no halls to call my own. My life is spent in in-betweens; my task is never done. No, my father’s field of reeds, that is best for you.”\n\nYet the mortal was persistent:\n\n“I care not for your father’s field of reeds nor any other hall! I need no port of call!”\n\nAnd Icthlarin was angered by their insolence:\n\n“What aid can you give me? Your spirit is dim and has not even the brittle strength of bones.”\n\nThe third answered:\n\n“The light of my spirit may be dim, but it is better than darkness.”\n\nThe god considered:\n\n“It is a lonely path. You will meet many, but they will all pass you by.”\n\nAnd the third smiled:\n\n“The better to share it.”\n\nIcthlarin grew silent once more, but then he turned to the cave wall. He tore free one of the roots of the world and extended it to his mortal companion and said:\n\n“Come then, for our endless task continues and there are more souls to guide.”\n\nAnd with the third’s touch, their spirit became the first ember and lit the root’s end.\n\nIt was a beginning. Since then, Icthlarin has never wandered alone, for all those who serve him are wanderers in darkness too. They are the light in the jackal’s torch."
    ],
    "template": "letter"
  },
  {
    "list": [
      "The Blood of Scabaras\n\n\nField notes on the Kalphite species, as recorded by Iqbar Ali-Abdula\n\n\nI have travelled to the Bedabin camp to examine the giant insect brought down by Al Shabim and his fighters. The nomads say they have sometimes sighted these creatures roaming the desert to the north, but this is the first in living memory to cross into Bedabin territory. Even dead, it is a fascinating specimen — comparable in size to a Kharidian scorpion but closer in appearance to a scarab, with six segmented legs and a chitinous exoskeleton. The Bedabins have named it “kalphite,” after a creature Menaphite religious lore tells was created during the fall of Scabaras, when the god’s blood dripped upon a swarm of scarabs and caused monstrous mutations of body and mind.\n\nI have devised the scientific name kalphiscarabeinae for this unique species. I suspect the kalphiscarabeinae has gained its mythical reputation for being so rare, and hope my research trip into the northern desert will shed light on its natural origin. This could well be the defining discovery of my bug-hunting career!\n\n\nIn several days of exploration I have not encountered more kalphites, live or dead, but their snaking trails criss-cross the sands everywhere I look. Scattered along these tracks lie the dry husks of shed exoskeletons, many larger than the Bedabin specimen.\n\nInitial evidence indicates kalphites may live in subterranean hives, as ants or termites do. I have located a sandstone structure some days north of the nomad’s camp which conceals the entrance to an underground tunnel. It would take a good length of rope to overcome the initial drop, and attempting the descent by moonlight would risk injury, so I will camp for the night and venture down at dawn.\n\nStrange. The desert is quiet tonight, yet a humming vibration plays on the edges of my awareness, somewhere between heard and felt. Long days in the heat must be wearing on my senses.\n\n\nThis morning I breached the kalphite lair. Following the drop down is a vast, airy tunnel, well-lit by the sun filtering down through the rocks above. Narrower passages branch away to each side, trailing off to depths and darknesses unknown. All around, insects click and scuttle in the walls, and always there is the humming, the incessant droning, enough to make your ears ache all the way down to your teeth.\n\nTumeken’s light, it torments me! Sometimes, when my focus drifts, I swear I hear language in the noise, but when I try to pick out words, they slip my grasp.\n\nI have managed to avoid a direct encounter with the creatures, though increasingly I worry this is only because I am too small to draw their notice. I am presently hidden in a small alcove for safety as I write. Ahead, the tunnel opens on a larger atrium. Two of the largest kalphites I have yet seen guard a pit at its centre. Beyond that, I do not know. Dare I wonder?\n\n\nIcthlarin spare my soul, but I dared.\n\nSomehow I won through to the pit unscathed by its guardians. Stifling, stinking waves of heat radiated up from the depths. I lashed a rope in place and shimmied down halfway for an overhead view of the space below.\n\nAnd I saw her.\n\nOh, the sight of her stole my breath! I knew her for a Queen at once. She patrolled her throne chamber in pitted chitin armour, hulking and six-legged, a nightmare of twitching antennae and scissoring mandibles.\n\nShe sensed me; her eyeless head swivelled in my direction. Then she reared back on four legs and let out a terrible screech, interspersed with a series of mandible clicks so precise they could only be purposeful speech. Sandstone cracked and crumbled as the walls disgorged dozens of smaller kalphites, a shifting, swarming mass that flooded into the chamber like a river of blood.\n\nSheer panic kept me clinging to the rope. The insectile clicks and groans of the kalphites took on the rhythm of a chant, smothering every sense, drowning out every thought. A new presence pressed on my awareness – a terrible, divine, eternal presence. With a faraway sense of alarm I realized that the Queen and her children were praying, and something, some god, answered the call.hyx\n\nShimmering with divine protection, the Queen went silent and still. Then a spasm ran through her. Her thorax and abdomen pulsed grotesquely. With a sound like rending metal, the chitin plating split along her back and she burst forth, born anew, wings whirring to motion, legs grasping through the air towards me–\n\n\nThere is a gap in my memory here. I cannot say how I made it back up the rope to safety. Even now, I struggle to hold my thoughts.\n\nThe kalphites have a language and a Queen and a god. This is not an anthill, not a termite colony, no mere swarm of insects, no! A cult! A cult of Scarabas secreted away beneath our very feet!\n\nAm I to deliver this knowledge back to the Bedabins? To Al Kharid, or Menaphos? No, no, it is blasphemy to speak of Scabaras in Menaphos. But then, Menaphos seems far away, unreal, a city of short-lived humans with mortal concerns. Nothing to a god — a god of insects, a god of nightmares, a god of isolation.\n\nWhy, why, why did I come down here? My head is full with the whirring of insect wings.\n\n\nThe Kalphite Queen holds court beneath the sands. She leads her children in prayer. Her children, larvae glutted on the rotting flesh of a fallen god. Her workers, her soldiers, her guardians. Scabaras’ cult, Scabaras’ army. Scabaras’ sacred blood, flowing in a hundred tangled veins under the desert.\n\nThe blood of Scabaras prays for his return! The blood of Scabaras awaits his return! Oh kalphiscarabeinae pasha, oh kalphiscarabeinae sacer!\n\n\n[The remaining pages of the journal are filled with frantic scratchings that do not correspond to any known language.]"
    ],
    "template": "letter"
  },
  {
    "list": [
      "The Exodus\n\n\nIts been a few weeks since the sacrifice. Those that were far enough away said it was beautiful, a symbol of hope for us all. A shimmering, radiant star powerful enough to save us. Those closer to it claimed they felt embraced, though they also lost their vision. And those close enough to touch the power? They are gone, the light was indiscriminate. I am unsure how they felt, though personally I would not feel much gratitude. I never saw the light clearly myself, but I felt the heat, along with everything else living here.\n\nI immediately stepped outside. There are a distinct shift in the air. I saw others doing the same. The heat was blistering, plant life was scorched. The buildings were shaking. Some thought this meant our end was near and in hindsight, they were not far off.\n\nEveryday it seems more dies, what was once a green, beautiful land, slowly turning to ash and sand. The native wildlife cannot survive in this environment and I grow doubtful of our ability to as well. More people turn to crime and I no longer have the will to stop them.\n\nThey tell us the Empire has retreated and that we’ve won. But its hard to feel that way looking at the suffering around me. If this was a victory, how much worse would losing have been? The Empire at least seems strong enough to protect its citizens. People are lost and angry and I cannot blame them. Who do we to turn to now? The Gods that couldn’t protect us, or the Pharaoh chosen by the same Gods? The Empire is still vast and expansive outside our borders. Our ace, our hope and our protector is gone after subjecting us to what seems to be a slow end. This is our freedom.\n\nI am resentful. Of Amascut for abandoning us. Of Icthlarin, for losing control of his Judges. Of the Judges for their betrayal. Of the ruler of the Empire for his endless expansion. Of Pharaoh Osmumten, for his vain attempts to fix this. Of those who believe this will pass in time. And most of all, I resent Tumeken. For his arrogance in thinking he could protect us.\n\nI’m not alone in these thoughts, though few would say it out loud. There are plots and schemes brewing. I do not intend to be around to see any of them through. Treachery is something I not stoop too. But my heart goes out to those that will stay and endure. And I sympathize for those that want change. I can only imagine what the cowardly and faithless plan to do in the chaos in the name of profit and power.\n\nI suppose I am also a coward and a faithless man now though. I’m leaving Menaphos in a few nights with my family. Being a guard I doubt I’ll draw much suspicion. There are others too, and we are supposedly leaving by boat, we must have a powerful ally. The malcontent in the city runs deep. Where are we headed? I’m unsure, a secluded part of the Empire perhaps, free of conflict? Or another land untouched by this Empty Lord. Anywhere would be better than this cursed and hopeless desert.\n\nI leave this diary with hope my brother finds it afterwards. He would’ve been forced to stop me from leaving I know. I just hope he understands and maybe one day we will see each other again when times are better.\n\n\n- Name faded out"
    ],
    "template": "letter"
  },
  {
    "list": [
      "The Meaning of a Name\n\n\nIn the first moment, she became the goddess of rebirth, of return. Her breath was a soft, welcoming embrace that brought souls from death into new life. Her words were whispered promises, a sense of love and lost that continued the great cycle. Her touch was gentle and guiding, a push towards the direction of further life - and all was good. She shifted with the sands, brought peace to the arid winds, and slipped between the cold-mooned nights.\n\nHer name was Amascut. Sister. Daughter. Life-bringer.\n\nThe second moment came, and a war of ages broke across the sands. Grains rolled under armored feet, the wind howled beneath their helms, and her voice was a careful caution to all. To hear her speak was to be taken, to allow breath to still, and feel one’s muscles drift to silence; forevermore to be reborn anew with spear in hand. She loved and lost both in the second moment. She must have felt her heart swell as the Mahjarrat entered the fray, must have mourned for those who fell.\n\nHer name was Amascut. Warrior. Guide. Sister, still. Sister of the peace-bringer, sister of the sands themselves.\n\nThe third moment, a moment of darkness. Of revelation, that allies were not always what they seemed. Of seeing horrors beyond comprehension as the light faded from follower after follower and Zaros’ name was whispered on lips instead of hers. She felt nothing but sorrow - the words were true, the sands were empty, the souls were not fit for rebirth. To pass on was to no longer be guided to a new spear, but to be devoured, to be struck down with hatred and scorn. Her name became hatred, her love a lust for destruction, her touch a callous and rough strike.\n\nHer name is Amascut. Devourer. End of days. Bringer of true dark.\n\nNow I hear her voice. I hear her name. I dig, and dig, to find the tomb of her warmth. I dig with her words in my ears and her hatred in my heart because she is the true end. Amascut is my beginning, Amascut is where I will die, Amascut’s beasts will devour my soul no matter her brother’s meddling. I give myself willingly into her empty maw, to become a part of her name, a part of her ultimate plan. A part of her control over the sands.\n\nThe winds.\n\nThe sun.\n\nThe moon.\n\nShe is Amascut.\n\nShe is hungry."
    ],
    "template": "letter"
  },
  {
    "list": [
      "On 16 Ire of Phyrrys, a challenge. Your services will be required soon."
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Dagannoth Rex,\n\nEvery time we meet you vehemently refuse to step foot in the water, no matter how many magic spells my friends and I pelt you with. Is it because you're afraid of water? It seems pretty silly that one of the kings of WATERbirth island would be afraid of getting wet.\n\nOr maybe you just like the tingly sensation of Slayer Dart?\n\nYours truly, DarkfireX34"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear K'ril Tsutsaroth,\n\nAfter a long day of YARRRRRRR! ing my Prayer Points away, what does a great and powerful demon like yourself do to unwind? Surely you can’t be that angry all the time, what do you do to rekindle all that rage?\n\nStrength through Chaos,\n\nLuitenantDan\n\nPS: What brand of toothpaste do you use to keep those pearly whites pearly and white?\n\nPPS: Who’d you commission your dual blades from? I could use a new sword."
    ],
    "template": "letter"
  },
  {
    "list": [
      "To Ignisia, Grand Master of the Order of the Sacred Flame,\n\nGood day Ignisia,\n\nIt has been a while since I last paid a visit to the Pyromancers. The last time I was there, I... just wanted to check on the cute little toad at your camp. Definitely did not pour anything on the Doors of Dinh.\n\nRegardless, I have a couple of burning questions I would like to ask you.\n\n- In order to serve the Order, you had to pass something called the Trials of Fire. Could you tell me more about these trials? \n- Would it be possible for a mortal such as myself to undertake the Trials, to prove myself to the Order? \n- How did you become Grand Master of the Order? \n- Have you heard of a hot young man (pun not intended, he seems to light fires every moment of every waking hour, and his hands are stained with ash) by the name of Ignatius Vulcan? I was surprised to learn he was the master of Firemaking, when you seem to be a much better fit for the role!\n\nI hope you can answer at least some of my questions!\n\nSincerely, u/YoshiFan12, fellow master of Firemaking\n\nP.S. - What do rejuvenation potions taste like? I would have had a sip myself during my time subduing the Wintertodt, but the well-being of the other pyromancers was more important."
    ],
    "template": "letter"
  },
  {
    "list": [
      "Greetings Alec,\n\nAs a member of the Myths' Guild, I continue to seek out myths and tales to fill the Library of Knowledge. As such, I am looking for possible leads on one of the most elusive animals in Gielinor.\n\nAs the headmaster of the guild, surely there is some information you know of about the mythical horse, whose traces of its existence have been strewn about the world and yet has no known confirmed sightings. Its also been referred to as a hornless unicorn, though I'm confident that is just a rare genetic mutation among unicorns, which are a totally different species than a horse.\n\nMy best lead, Hajedy and Vigroy, claim to offer cart rides between Brimhaven and Shilo Village in Karamja via horse, and yet I was not able to witness these horses in action.\n\nAdditionally, Diango sells a children's toy called toy horseys. I can only assume that the nonsensical word \"neigh\" that I hear children shout while playing with them is some fanciful reference to the mystical sounds these creatures must make. However, the word may just be the product of the over-active imagination of children.\n\nIf you have anything additional leads, I'd love to hear about them in pursuit of expanding the Library of Knowledge!\n\nThanks in advance, Spineweilder"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Hi there, (NAME)!\n\nThank you for your purchase of a Membership Passcode. Your passcode is below.\n\nYou may redeem the code on one of your own RuneScape accounts, or give it to a friend for them to redeem.\n\nTo redeem the code yourself, you MUST first log into the account you’d like to receive the Membership credit. Once redeemed, the Membership will be applied to the account which is currently logged in. You can see which account is active in the top right of the code redemption screen.\n\n(CODE)\n\nThe code can be redeemed after (TIME)."
    ],
    "template": "letter"
  },
  {
    "list": [
      "O' Great, Mightly Olm,\n\nMy kin and I have delved into your chambers many a time, and have challenged you to battle many a time as well. Because we always meet in this manner, I do apologise, but I have not had an opportunity to speak to you. I wish to know, Great One, how you feel about our challenging you to fierce combat? Are we unwelcome invaders disturbing your rest? Do you consider us invited champions you enjoy sparring with? If we are unwelcome, my apologies: I mean no true, grave harm to you; I am driven to search for scrolls and gear of great import within the depths of your chambers.\n\nO' Great One, I beseech thee with just one more query. When us combatants are not present, what activity do you busy yourself with? I do hope we are not rudely interrupting you when we arrive.\n\nI bid thee well,\n\nTungstenGyro"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To Nulodion, Rolad, and all you other fine dwarves of the Ice Mountain encampment,\n\nGreetings, my friends! How's work been? I'm sure you're quite busy manning (dwarving?) the mines and creating such monumental feats of engineering as the famous Multicannon.\n\nI'm writing to you with a slight concern that's peppered my mind for the past number of years: that, for some reason, any time I attempt to light a fire in this rather massive region (taken from the wiki), I'm being told \"The dwarves won't be happy if you light a fire here.\"\n\nNow, I find this particularly bizarre, as this enormous stretch of land is generally unoccupied. And given how adventurers have been lighting fires everywhere for decades with relatively minimal damage, I couldn't think of a good reason why you might prohibit this use of fire.\n\nI would greatly appreciate if you would enlighten me on the situation!\n\nSincerely yours, ScreteMonge"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Cam the Camel,\n\nAre you acquainted with Cam the Bank Camel?\n\nBest regards,\n\nAdventurer"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Lanthus,\n\nAs an experiment, I recently entered each portal within the Castle Wars lobby while wearing an item from an opposing God. To my surprise, Saradomin, Guthix, and Zamorak not only spoke to me directly to show their disdain for my actions, but also used magic to transform me into the likes of a bunny, an imp, and a sheep. This seems to be a far more direct interaction between the gods and us humans than is normally possible. Especially for Guthix, who should be sleeping right now according to legend. Does the Castle Wars area somehow have a special connection with the gods that is not possible elsewhere in Gielinor?\n\nSheepishly, Worldstream"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Keldagrim Stonemason,\n\nWhy are you the only proper stonemason in all of Gielinor? Your monopoly on Gold Leaf and Magic Stones would surely draw some competition!\n\nKind regards, Sweaterly"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To my friend Thurgo,\n\nI wonder if you'll indulge me over a mug of ale and a freshly baked redberry pie for a moment.\n\nAs you are a smith of impeccable craftsmanship (or craftsdwarfship), your skills with the hammer are second-to-none. However, I have heard a tale across the sea of another dwarf of legendary prowess, who goes by the name of Dinh.\n\nI wonder, have you heard of this smith before? He had supposedly created a great door to seal a terrible winter beast, and smithed a nigh-impenetrable bulwark. Someone of his abilities lead me to believe he may also have been an Imcando Dwarf, but I shouldn't speculate.\n\nI wonder if you've read anything about him before during your own studies as a young smith? I'm curious to know more about him, and if he may have been an inspiration to you. If not Dinh, then who?\n\nWarm Wishes,\n\nCupcakeKirin."
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Helpful Spirit inside the Tombs of Amascut,\n\nWhy are you so helpful? Is it because you were helpful in your previous life and wanted to continue in the afterlife? Or were you evil in your previous life and you have to be helpful now in order to make amends? Regardless, thanks for the supplies!\n\nSincerely,\n\nZanthy\n\n\nP.S. Those Ambrosias are amazing! You've gotta send me the recipe! (I promise I won't share it!)"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Steve,\n\nI know we all loved Nieve, but how do you feel about following in her footsteps and becoming a Slayer Master?\n\nSincerely, ImOneEyed"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Pet Kraken (Steve),\n\nA few years ago during one of our adventures I unfortunately lost you. I thought my heart would never heal until one day when Probita let me know that despite not being insured she had somehow found you.\n\nI wanted to ask you what did you get up to during our separation? Did you miss me as much as I missed you? Did you go on your own grand adventures, or simply wander aimlessly until we were reunited?\n\nFrom Lorb163"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To Maisa,\n\nHey, how's things?\n\nI was rummaging around your camp near the Ruins of Ullek and I found a bottle of 'tonic', I'm curious, what type of tonic is it? What does it do?\n\nSincerely,\n\nTheWiseLoner"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Doris,\n\nDo you know there's a giant hole in the rock wall around your house? Kinda weird to bother with a gate in the front, but then have a hole in the back anyone can just walk through. There's some unsavory folk in Edgeville... you should probably get that fixed.\n\nYours,\n\nJuniorRaccoon2818"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To Lowerniel Drakan, Lord of Vampyrium\n\nI doubt you know my name, but frankly, you don't need to; suffice to say, I'm the person who killed Vanstrom Klause and Ranis. You're next. I know, as far as you're concerned, I'm an insect that's so far beneath you I'm barely worthy of incineration - or whatever it is you say - but I'm not sending this to scare you. On the contrary, I'm sending it so when you're staring death in the face, you know it's your own pride that got you killed. The Myreque was a wounded beast, and you let it lie instead of finishing the job. What happens next is your own fault. You failed as a hunter, so I hope you enjoy being prey before you die.\n\nMyreque Prevail!"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear ‘Deranged’ Archaeologist,\n\nI recently paid you a visit on Fossil Island, and whilst throwing books at me, you shouted some interesting things. I would like to know more about your research; I'm sure you've seen some extraordinary things on your journey - living plants? Doors that won't stay closed forever? Time running out before ‘she’ rises? Were you perhaps studying an ancient civilization, and uncovered secrets that your peers deemed you ‘deranged’ for sharing? I promise to hear you out!\n\nAll the best,\n\nQomposite"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Head Chef (Of the Cooks' Guild),\n\nI am writing to you today with a bit of a culinary mystery. I wonder if you know the origin of the strange disc shaped food we call 'pizzas'? They seem an odd creation and likely have an interesting origin story. I tried asking other people and only got tall tales about a faraway land shaped like footwear (an obvious fabrication). Hopefully you can enlighten me on their true nature.\n\nRegards, Myst King"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Hatius Cosaintus,\n\nI'm writing this letter to ask you some burning questions.\n\nHow's the Lumbridge life? And what's your relationship with the folks of Lumbridge? Have they accepted you?\n\nAlso, how do you feel about the second attempt to replace you? Hope you’re doing well after that.\n\nLeaving on a positive note, I absolutely love your 3rd Age Chest, Leggings and Cloak. I wonder how many Clue Scrolls you've been collecting to get that drip.\n\nFrom Anonymous"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To the Sleepwalkers of Morytania,\n\nHeya! Ever since Swampletics, I think everyone has noticed you guys, wandering to and fro among the dreadful lands of the Morytania swamps.\n\n... Why are you wanding? And why are you sleepwalking?\n\nKeep on keepin' on sleepyheads,\n\nOtomachi Una"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Hey Norman, It's me, Shopnt; I was your Mahogany Homes contractor a while back and we got to talking afterwards. Sorry for dismissing your worries about that monster outside your house, I just couldnâ€™t imagine there being something like that in Falador.\n\nStill, I felt bad afterwards, and I decided to do some digging, which pulled up some good news and some bad news. The good news is I think I've found what spooked you, and it wasn't an eldritch horror; Falador is an extremely popular place for leaping and vaulting across rooftops, and the closest thing to an official 'course' starts with a tightrope walk right past your bedroom window.\n\nThe course is a bit quieter these days, but I've heard stories of hundreds of people doing it all at once, day and night. Under those conditions, I'd absolutely believe that you could have woken up and seen a confused mess of limbs and faces and eyes outside your window. So, the good news is you're probably safe from eldritch monsters.\n\nThe bad news is that even though itâ€™s quieted down these days, I doubt they are going to stop running course even now, I don't think they're going to stop anytime soon, so you'll probably be stuck with people outside your window as long as you live here, but better a mundane annoyance than an unspeakable terror, right?\n\nWishing you the best,\n\nShopnt\n\nPS: Try not to blame the runners, okay? The fresh air and health benefits of that kind of exercise are incredible. If you ever do end up getting out of your house and go travelling, I'd recommend stopping by the Gnome Stronghold out west. They've got a very approachable obstacle course that's actually open to the public if you don't mind a few shouting drill sergeants."
    ],
    "template": "letter"
  },
  {
    "list": [
      "Humble greetings, TzHaar-Mej-Jal,\n\nI must ask, how are fire/infernal capes made? Are they simply containers that hold flowing lava, or is the lava actually woven into a wearable cape? I can only imagine the master crafters as the TzHaar-Hur would be able to achieve such a feat.\n\nBest wishes,\n\nJalYt-Ket-Xo Rare Corgi"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Verac,\n\nI hope you and your brothers have been well, or at least as well as a wight can be. I have been bringing you cakes and leaving them by your tomb as a gift, but I was wondering - do you prefer chocolate cakes? Or do you like pie better? If you tell me I'll know what to bring!\n\nWith love,\n\nyour biggest fan\n\nI love Verac"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Tempoross,\n\nI am quite curious as to what exactly you are and why you've chosen to hound the anglers with storm after storm. You surface as a giant water creature, but I know there's more to it than that. Are you the glowing fish whose scales us adventurers scatter? Are you some form of elemental or magical being? Or are you more like the Windertodt over in Zeah, which seems to be a force of nature? And what drives you to attack? Did the anglers do something to offend you that they haven't told us adventurers about? Is there some way a peace can be achieved between you and our kind? Curious minds seek answers, and I hope you're able and willing to give some.\n\nFrom the ever-curious Sarra"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Hi Guildmaster Jane, it’s Zanon here.\n\nEvery time I enter the farming guild I always see loads of keen farmers working away planting seeds and cutting trees and generally keeping the guild colourful and nice. But why is it that all us farmers just keep littering the guild with our empty plant pots and diseased crops? Couldn’t there be bins available to dispose of our litter? I think the Guild would look much better without the litter. Maybe you could hire staff to watch out for litter droppers and give the players a telling off if caught littering.\n\nAnyway, thanks for listening and stay safe.?\n\nFrom Zanon"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Calv (I can call you Calv, right?),\n\nWhat exactly is your relation to Vet'ion, and why do you just randomly have his skull on your person sometimes? Is this normal skeleton behaviour? Also, sorry for beating you up multiple times.\n\nSincerely, Fuzzybeetles\n\nP.S. have more loot next time"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Greetings Grand Vizier Radimus Erkle!\n\nI joined your guild quite some time ago, being an avid fan of quests and adventures. I've even managed to join the prestigious Myths' Guild thanks to your recommendation. You truly are an inspiration to all of us adventures!\n\nNow here is my question, and I hope it doesn't sound rude. It concerns the dungeon below the Guild. Why are the creatures down there so uninteresting? Don't get me wrong, the stores and other services in your Guild are wonderful, but the dungeon is a sad sight. Heroes' Guild has a mighty dragon (and the Myths' Guild a few more), while the Champions' Challenge is (in)famous to us all. The animals and shadow warriors are a bit lacking in contrast.\n\nIs it possible to introduce new creatures down there to make the dungeon a more exciting place to visit?\n\nWith warm regards,\n\nVamppyyri50"
    ],
    "template": "letter"
  },
  {
    "list": [
      "\"When you think about RuneScape's most iconic quests, there's a pretty good chance the Mahjarrat story will be one of the first to come to mind. While Guthix Sleeps, Ritual of the Mahjarrat, and indeed, Desert Treasure, are regularly considered some of the finest quests ever made. Now, all these years later, we're finally revisiting those epic stories with our own take on the legendary Mahjarrat.\n\nEarlier this year, we made our first foray into the Mahjarrat storyline with Secrets of the North, but that was nothing compared to the might of this next instalment. This is a story we've been wanting to tell for years, and it's only through your tremendous support for our past storytelling efforts that we're now finally able to do so. We've made sure to honour the deep legacy of the Mahjarrat storyline, whilst also pushing the boundaries for storytelling in Old School like never before. Whatever you might be expecting, you're probably not ready for this. This is the one where everything changes. So, from myself and the rest of the team, it's an honour to be able to finally share Desert Treasure II – The Fallen Empire with you.\"\n\nMod Ed"
    ],
    "template": "letter"
  },
  {
    "list": [
      "We want to be upfront here, this year's event is largely the same as last year's well-received trick-or-treating community event. We know that's going to disappoint a lot of you who look forward to these small slices of silly seasonal spookiness.\n\nThe reason is simple: Varlamore is shaping up to be Old School's biggest launch to date and with Leagues IV on the horizon, plus other upcoming QOL changes to content like the Chambers of Xeric, we've made the decision to prioritise development of these bigger projects. Whilst you'll be replaying last year's event, we hope you understand our reasoning (even if you may disagree with the decision) and we hope that you'll appreciate the tweaks to the community goal and enjoy the new cosmetic rewards!\n\nRest assured our long-term plan is to continue with the short story-driven holiday events that are so core to Old School. That said, we'd like your thoughts on how we approach this year's Christmas event. We were considering re-running 2013's Christmas event (which is a much older event itself from 2006). We're conscious that many of you won't have played this event before (or at least not for many, many years, way back in RuneScape 2!) and we think you'll enjoy the nostalgic trip! Alongside that, we're leaning towards having Old School's 11th Anniversary event be primarily a community celebration rather than any in-game content. What do you think? Let us know your thoughts."
    ],
    "template": "letter"
  },
  {
    "list": [
      "To Aristarchus,\n\nHow are things in Pollnivneach? Like you, I've been travelling around the desert in search of knowledge. I've recently uncovered some amazing things in the Necropolis, but the Devourer and her thralls have desecrated the place; I'm sure you'd be interested in visiting whenever it’s safe. I've also met one of your colleagues, Akila, who has remained there as a helpful spirit, aiding those seeking to lessen the Devourer's influence here.\n\nI've also found something amazing in the desert's eastern coast; an ancient vault, with faint magical energy emanating from the door. I can't seem to find a way to open it, but I have a feeling the answers will come to me very soon...\n\nThe last thing that piqued my interest is somewhere closer than you'd think; Al-Kharid has many of these glyphs, covered in weird-looking little squiggles and pictures. They are also prominent as decorations in the upper floors of the Emir's Palace.\n\nMight you know what they mean or represent? I believe it to be an ancient form of the Kharidian language, but there are no translations accessible to me currently. The Pharaoh did recently announce his plans to end the quarantine in Menaphos, so perhaps the Great Library there may have one?\n\nSafe travels,\n\nSpineweilder"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Old Man Gricoller,\n\nI hope this letter finds you well!\n\nFirst, I'd like to thank you again for this lovely hat you gave me. It helps keep the sun out of my eyes on the farm, sure, but it also looks nice when out on the town!\n\nSpeaking of the town, I went to the local pub recently and I had the honor of being served by your granddaughter Golova. The food was great and all, but I did hear a bit of worrying news. She had apparently recently fired one of her sisters, something about bringing in a bad crowd- I'm ashamed to admit I did a bit of snooping and discovered it has something to do with Bologa's views on Zamorak.\n\nI'm not very picky when it comes to divine intervention, but I was wondering what your views were on the whole thing?\n\nAlso, it's been bugging me for a while now, though I'm usually too tired to ask after a long day of honest work in the fields- are the fruits your farm specializes in named after your granddaughters, or are they named after the fruits?\n\nGood harvests,\n\nHarper Tress"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Venenatis,\n\nI have been spending a lot of time in the Wilderness lately looking for Mossy Keys. During my stay in Ferox Enclave I heard that you moved into a cave some time ago. Since you have had some time to get used to your new home, I was curious how it compared to your old home on the plains? I assume the cave is warmer and cosier, but don’t you ever miss the fresh breeze or being able to look up at the stars at night? Other than that, how are your neighbours? I also heard a large skeleton called Vet’ion and a bear named Callisto moved into the caves nearby. They appear to be quite noisy as they both shout and roar a lot. Speaking of the other inhabitants of the Wilderness, another large spider called Spindel moved into a cave further to the south, do you know her? She does look a bit like you, although not quite as large and powerful. Anyhow, I wish you the best of luck with settling into your new home and hope that you do not get any unwanted visitors hoping to find rings and other valuables.\n\nWith kind regards,\n\nSpy Hugo"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Ba-Ba, Kephri, Zebak, Akkha, and the Wardens,\n\nHello, all of you!\n\nI hope your days have been better since my colleagues and I evicted Amascut from Jaltevas. I apologize for the rather blunt approach we took, but we are warriors, not healers.\n\nHow are you faring? Have Amascut's curses waned after your defeat and her departure? I was hoping each of you had the presence of mind to answer a question for me.\n\nKephri, what's that thing floating over your head and how do you keep it there?\n\nBa-Ba, where do you and your children get your bananas? There don't seem to be any banana trees in the desert and there isn't much light or water in the Tombs...\n\nZebak, what's your favorite food? I'm assuming it isn't jars or stones given how many of those you spit out. Can I bring you some next time I swing by?\n\nAkkha, what are those white orbs that you summon when we spar, and how do you make so many? You don't strike me as much of a mage.\n\nLastly, for the Wardens - if you two were to fight each other, who would win?"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Foxes: “Getting to work on an official merch range is an incredible feeling. I’ve been playing RuneScape since I was six years old and never would I have expected to get a chance to work with Jagex. It’s surreal to say the least and an absolute honour.”"
    ],
    "template": "letter"
  },
  {
    "list": [
      "I've learned from other denizens of Gielinor that, for decades, you had stopped collecting mail. Is this true?\n\nIf so, is it because you had been participating in a labor strike? Or are the men and women I had spoken to under a mass-delusion event?\n\nEither way, I'm very glad to see you making the rounds again.\n\nMuch respect,\n\nLittle Witch\n\nP.S. What is the roughest region to deliver mail to? I'd imagine it's Canifis, considering your calcium-robust form, and the fact they seem to chase after anything with a loose bag out there."
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Cuthbert, Lord of Dread,\n\nI recently engaged you in a duel to the death to determine the fate of humankind (and frogkind), and I do not expect you to forgive me from beyond the grave for your defeat. Our battle was legendary, but it got me thinking: how did you come across your moniker? \"Lord of Dread\" is a very impressive title.\n\nYour eternal foe,\n\nBetafrost"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Hello Wise Old Man, I come to write you to obtain answers. I would like to help my good friend Norman in Falador out and defeat his demon, yet I have no idea who or what is haunting him. With all your experience, could you guide me to whom this creature is?\n\nKind regards,\n\nAltihnkaii"
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Alathazdrar, the Demon Butler\n\nThaz (is it ok if I call you Thaz?) if you read this, I'm free on Thursday night and would like to hang out. Please respond to this and then hang out with me on Thursday night when I'm free."
    ],
    "template": "letter"
  },
  {
    "list": [
      "Dear Prison Pete,\n\nI have saved you from Evil Bob's evil looking Party Room so many times.\n\nHow do you keep getting lured back?"
    ],
    "template": "letter"
  },
  {
    "list": [
      "To the Varrock Stray Dog,\n\nWho’s a good dog?"
    ],
    "template": "letter"
  },
  {
    "list": [
      "It was initially very hard to pin down what we wanted the Raging Echoes theme to look like, and we started off simply with a colour palette. From there I looked at the two elements of \"Raging\" and \"Echoes\". I flirted with the idea of a restless spirit, an angry echo of the past. Ragged, old, transparent fabrics. It was hard to base multiple rewards on this arbitrary idea alone, so we leaned towards something that can echo or repeat itself. A face, easily recognisable, became a motif we would repeat. Are they echoes of people you perhaps once knew? Or perhaps echoes of yourself, fragments of your mind? Then we added the dark pink and red hues to represent the underlying rage this echoing arises from. It was entertaining to play with something a bit more abstract."
    ],
    "template": "letter"
  },
  {
    "list": [
      "“One of the problems that Wintertodt has had forever is that it's way more supply intensive for players with high Hitpoints, to the point where it's become almost mandatory to do Wintertodt ASAP on a new account. The concept of a Warmth Meter to substitute Hitpoints has been kicking around in the community since before I joined the team, so it felt like a welcome change. While we were doing that, it made sense to address some of the other problems the content had, like the Wintertodt deciding to slap you across the face and stop you Fletching for multiple cycles in a row. These changes should make it feel a lot comfier, which is exactly how you should feel when fighting a giant snow spirit intent on encasing the world in permafrost. Oh, and I can’t wait for players to find the red herring!”"
    ],
    "template": "letter"
  },
  {
    "list": [
      "As someone who has developed quite a few different PvM encounters in the past 4+ years, Araxxor was something of a first for me since slayer bosses inherently don't want to be too engaging. The game itself is asking you to kill hundreds in a row, admist other slayer tasks that are low intensity, having a boss sprung upon you that is very high intensity would be unwelcome, compared to other bosses that are a bit more opt-in.\n\nTrying to strike a balance between a fairly chill boss, but one that still has enough depth to keep the player feeling like they have bits to improve on or things to try long term was quite difficult, I'm not sure if I fully accomplished this but players seem to enjoy Araxxor so I'd like to think I wasn't miles off at least!"
    ],
    "template": "letter"
  },
  {
    "list": [
      "\"I didn't really know what I wanted to do for Game Jam this time, so I loaded up Reddit, saw a highly upvoted post complaining about Vyres and Blood Shards and got to work!\n\nThere've been loads of suggestions to put Blood Shards on other thematic drop tables like The Nightmare or Theatre of Blood, but I think these solutions can be a bit unpredictable. Considering the power of the Amulet of Blood Fury, the supply of Blood Shards is something we need to be careful about. If this item becomes cheap to use, it could have long-term negative impacts on PvM across the game.\n\nI decided to come up with a way for players to convert other thematic resources into Blood Shards, making them less frustrating to obtain without tanking the price.\n\nIntroducing: the Blood Jelly! Pump an absolute boatload of resources into one massive Blood Jelly and snag yourself a Blood Shard for your time and resources. Simple! I'm really interested to hear whether or not players like this direction. If not, we can always go back to the drawing board.\""
    ],
    "template": "letter"
  }
]