[
  {
    "name": "Chicken",
    "locations": "North-east of Lumbridge just east of River Lum, south of River Lum in Farmer Fred's chicken coop",
    "combat": "1",
    "hitpoints": "3",
    "requirements": "None",
    "advantages": "* No food required.\n*Feathers are dropped in groups of 5-15 and are stackable, and can be sold for some profit.\n*Bones will drop frequently, allowing the player to train their Prayer as well.",
    "disadvantages": "* Only 3 HP (12xp) per kill. Once you start hitting 4's with your Strength and weapon, chickens are no longer a good melee training monster but they are still good for training Prayer and collecting feathers.\n*Non-aggressive.",
    "template": "melee training monster"
  },
  {
    "name": "Monk",
    "locations": "Edgeville Monastery",
    "combat": "5",
    "hitpoints": "15",
    "requirements": "None",
    "advantages": "* No food required as you can ask monks to heal you for free.\n* Good training for 1 Defence pures.\n* 15 HP (60xp) per kill plus more experience per kill if they heal themselves for 2 HP. Players can continue killing monks towards Level 20 melee skills.",
    "disadvantages": "* No drops other than bones\n*Non-aggressive.",
    "template": "melee training monster"
  },
  {
    "name": "Seagull",
    "locations": "Port Sarim ports, Corsair Cove",
    "combat": "2, 3",
    "hitpoints": "6, 10",
    "requirements": "None",
    "recommendations": "The start of The Corsair Curse to train on seagulls at the Corsair Cove.",
    "advantages": "* 10 HP (40xp) per kill from the level 3 seagulls.",
    "disadvantages": "* No drops other than bones.\n*A long death animation before dropping bones.\n*Non-aggressive.",
    "template": "melee training monster"
  },
  {
    "name": "Giant rat",
    "locations": "Lumbridge Swamp, Edgeville Dungeon, Varrock Sewers",
    "combat": "3, 6",
    "hitpoints": "5, 10",
    "requirements": "None",
    "recommendations": "Your best weapon and armour. Food may be required but they drop raw rat meat. Small fishing net, tinderbox, and an axe may be optional to fish shrimps south-east of Lumbridge Swamp.",
    "advantages": "* They always drop raw rat meat, which can be cooked for Cooking XP and heal for 3 hitpoints.",
    "disadvantages": "*No valuable drops.\n*Lumbridge Swamp may be crowded and giant rats are slightly distanced from each other.\n*They have a tendency to hit 1's on players with little defence and no armour.\n*Non-aggressive.",
    "template": "melee training monster"
  },
  {
    "name": "Giant frogs",
    "locations": "Lumbridge Swamp",
    "combat": "13",
    "hitpoints": "23",
    "requirements": "None",
    "recommendations": "Bring your best armour (chainbody recommended) and weapons.",
    "advantages": "* High HP (23 HP for 92 melee experience per kill), low defence, and they deal little damage.\n*Always drops big bones which can be sold for guaranteed profit or used for Prayer experience while training.\n*They rarely drop beginner clue scrolls.",
    "disadvantages": "* Sometimes crowded.\n*No valuable drops other than a beginner clue scroll to solve.",
    "template": "melee training monster"
  },
  {
    "name": "Flesh Crawlers",
    "locations": "Catacomb of Famine (level 2) of Stronghold of Security",
    "combat": "28, 35, 41",
    "hitpoints": "25",
    "requirements": "Travelling through Vault of War (level 1) once. Decent combat.",
    "recommendations": "Bring your best armour and weapons, and food.",
    "advantages": "* They only deal 1 HP of damage but higher level Flesh Crawlers can hit quite accurately.\n*Always aggressive towards players of all levels, making this a great afk training method at any level.\n*They have access to the gem drop table and rarely drop uncut gems.",
    "disadvantages": "* No bone drops.\n*Higher level Flesh Crawlers will quickly damage players, even if it is just 1 HP per hit as they have a very fast attack speed of 1.8 seconds per attack.\n*Not as profitable in free-to-play as other monsters around these levels. They are only profitable in member worlds.",
    "template": "melee training monster"
  },
  {
    "name": "Zombie",
    "locations": "Catacomb of Famine (level 2) of Stronghold of Security",
    "combat": "30, 44, 53",
    "hitpoints": "30, 40, 50",
    "requirements": "Travelling through Vault of War (level 1) once. Decent combat.",
    "recommendations": "Bring your best armour (chainbody recommended) and weapons. 40+ Defence is recommended.",
    "advantages": "* The zombies in the Stronghold of Security are a decent alternative to Flesh Crawlers.\n*They are aggressive towards players up to twice their combat level + 1.\n*They have access to the gem drop table and very rarely drop uncut gems.",
    "disadvantages": "* By Combat Level 107, zombies in the Stronghold of Security are no longer aggressive.\n*Not as profitable in free-to-play as other monsters around these levels. They are only profitable in member worlds.",
    "template": "melee training monster"
  },
  {
    "name": "Giant spider",
    "locations": "Pit of Pestilence (level 3) of Stronghold of Security",
    "combat": "50",
    "hitpoints": "50",
    "requirements": "Travelling through Vault of War (level 1) and Catacomb of Famine (level 2) once. High-level combat.",
    "recommendations": "If fishing for food by the riverbank of Barbarian Village, bring a fly fishing rod and feather. Prioritize salmon over trout.\n\nIf retrieving food from the Edgeville bank for longer trips, bring 1 or 2 strength potions and the rest should be anchovy pizzas or swordfish.",
    "advantages": "* Always aggressive towards players of all levels, making this a great afk training method at any level to 99 and beyond.\n**After aggression ends in 10 minutes, if the player is training among the giant spiders just north of the ladder upon entering the first room of giant spiders from the ladder, players can re-aggro them by running to the end of the corners of the room of giant spiders: Top-left corner of the room after the first 10 minutes, then top-right corner of the room after the next 10 minutes, then bottom-right corner of the room after the next 10 minutes, repeat. If this doesn't seem to work (as in if aggressive areas covers the entire room, usually due to random events teleporting the player), climbing up the ladder and climbing back down will reset aggression too.",
    "disadvantages": "*Giant spiders can sometimes hit up to a maximum of 7 points of damage.\n*No drops other than beginner clue scrolls.\n*Unattended players could still possibly die before aggression ends. This happens less often at higher Defence but it's still possible. [[File:Hardcore ironman chat badge.png]]",
    "template": "melee training monster"
  },
  {
    "name": "Chicken",
    "locations": "North-east of Lumbridge just east of River Lum, south of River Lum in Farmer Fred's chicken coop",
    "combat": "1",
    "hitpoints": "3",
    "requirements": "None",
    "advantages": "* No food required.\n*Feathers are dropped in groups of 5-15 and are stackable, and can be sold for some profit or be used for fly fishing.\n*Bones will drop frequently, allowing the player to train their Prayer as well.",
    "disadvantages": "* Only 3 HP (12xp) per kill. Once you start hitting 4's with your Strength and weapon, chickens are no longer a good melee training monster but they are still good for training Prayer and collecting feathers.\n*Non-aggressive.",
    "template": "melee training monster"
  },
  {
    "name": "Goblin",
    "locations": "East of Lumbridge Castle past the River Lum",
    "combat": "2",
    "hitpoints": "5",
    "requirements": "None",
    "recommendations": "Your best weapon and armour. Food if you try this from level 3.",
    "advantages": "* They are fairly weak at level 2, and therefore can be easily slain for 20-24 experience points.\n*They can commonly drop water runes, as well as body runes and earth runes for magic training later.\n*While uncommon, they drop beginner clue scrolls more often than men, women, and cows.\n*If Goblin Diplomacy has yet to be completed, the player could hold onto 3 goblin mails from killing goblins for that quest but goblin mails could also be found inside crates at Goblin Village.",
    "disadvantages": "* Lumbridge is a common place for new players to train their combat skills and the area may be crowded.\n*While goblins do drop an assortment of items including coins, they only provide little profit.\n*They have a tendency to hit 1's on players with little defence and no armour.\n*Non-aggressive.",
    "template": "melee training monster"
  },
  {
    "name": "Men and Women",
    "locations": "Varies, including Lumbridge",
    "combat": "2",
    "hitpoints": "7",
    "requirements": "None",
    "recommendations": "Your best weapon and armour. Food if you try this from level 3.",
    "advantages": "* Very common and weak NPC.\n*Often close to banks.\n*Decent amount of hitpoints so you don't have to switch targets as often as you do when fighting chickens.",
    "disadvantages": "*Non-aggressive.\n*Often not grouped close together.",
    "template": "melee training monster"
  },
  {
    "name": "Cow",
    "locations": "North-east of Lumbridge just east of River Lum, north of the windmill north-west of Lumbridge, Crafting Guild, and the farm south of Falador",
    "combat": "2",
    "hitpoints": "8",
    "requirements": "None",
    "recommendations": "Your best weapon and armour. Food if you try this from level 3 but they drop raw beef.",
    "advantages": "* They always drop cowhide, which can either be sold to the Grand Exchange for profit or be used to train Crafting.\n* They always drop raw beef, which can be cooked for Cooking XP and heal for 3 hitpoints.",
    "disadvantages": "* It is a common place for new players to train their combat skills or make starting money and the area may be crowded.\n*They have a tendency to hit 1's on players with little defence and no armour.\n*Non-aggressive.",
    "template": "melee training monster"
  },
  {
    "name": "Giant rat",
    "locations": "Lumbridge Swamp, Edgeville Dungeon, Varrock Sewers",
    "combat": "3, 6",
    "hitpoints": "5, 10",
    "requirements": "None",
    "recommendations": "Your best weapon and armour. Food may be required but they drop raw rat meat. Small fishing net, tinderbox, and an axe may be optional to fish shrimps south-east of Lumbridge Swamp.",
    "advantages": "* They always drop raw rat meat, which can be cooked for Cooking XP and heal for 3 hitpoints.",
    "disadvantages": "*No valuable drops.\n*Lumbridge Swamp may be crowded.\n*They have a tendency to hit 1's on players with little defence and no armour.\n*Non-aggressive.",
    "template": "melee training monster"
  },
  {
    "name": "Minotaur",
    "locations": "Vault of War (level 1) of Stronghold of Security",
    "combat": "12",
    "hitpoints": "10",
    "requirements": "None",
    "recommendations": "Your best weapon and armour and 15+ Defence. Level 20 Fishing and Level 15 Cooking to catch and cook trout (and salmon at Level 30 Fishing and Level 25 Cooking) outside the stronghold with a fly fishing rod and feathers.",
    "advantages": "* They commonly drop iron arrows, which can be used for Ranged training.\n*They drop noted items such as rune essences for runecrafting and copper ores and tin ores for early smithing XP (or to sell at the Grand Exchange).\n*They commonly drop bronze full helms, which can be sold at the Helmet Shop in Barbarian Village.\n*They uncommonly drop right skull halves, which can be used to build or recharge skull sceptres (+3 charges or more for each tier of the Varrock Diary completed) or be cut into bone fragments, which can either charge the skull sceptre (i) or be sold on the Grand Exchange for each ( per right skull halves, or  more for each tier of the Varrock Diary completed up to  with all tiers of the Varrock Diary completed).\n*They have access to the gem drop table and rarely drop uncut gems.\n*They occasionally drop beginner clue scrolls.\n*You could optionally continue training on them until melee skills are at 30 if you wish to collect more arrows and other drops.",
    "disadvantages": "*Often crowded.\n*They have a tendency to hit 2's on players with little defence and no armour.\n*Non-aggressive.",
    "template": "melee training monster"
  },
  {
    "name": "Al-Kharid warrior",
    "locations": "Al Kharid Palace",
    "combat": "9",
    "hitpoints": "19",
    "requirements": "None",
    "recommendations": "Decent but cheap food like trout or salmon. Alternatively, you can buy kebabs for 1 gp each in Al Kharid. Also bring your best armour and weapons, because they can deal some damage.",
    "advantages": "* Lots of warriors to fight.\n*Aggressive if one warrior is attacked — all nearby others will come and fight. This makes it easy to always be fighting something. But this is advantageous at higher levels.\n*The bank is very close by.",
    "disadvantages": "* Often crowded.\n* Being ganged up at lower levels.",
    "template": "melee training monster"
  },
  {
    "name": "Barbarian",
    "locations": "Barbarian Village",
    "combat": "10, 15, 17",
    "hitpoints": "18, 24, 24",
    "requirements": "None",
    "recommendations": "Bring your best armour and weapons, because they can deal some damage. While there are cooked meat in the mead hall, players could also fish and cook trout and salmon by River Lum east of Barbarian Village with a fly fishing rod and feathers (other players also often drop fish too).",
    "advantages": "* They uncommonly drop runes (including chaos, earth, fire, and rarely law runes) and bronze arrows.\n*They have access to the gem drop table and very rarely drop uncut gems.\n*There are cooked meat in the mead hall for healing.",
    "disadvantages": "* Sometimes crowded.",
    "template": "melee training monster"
  },
  {
    "name": "Giant frogs",
    "locations": "Lumbridge Swamp",
    "combat": "13",
    "hitpoints": "23",
    "requirements": "None",
    "recommendations": "Bring your best armour (chainbody recommended) and weapons.",
    "advantages": "* High HP (23), low defence, and they deal little damage.\n*Always drops big bones which can be sold for guaranteed profit or used for Prayer experience while training.\n*They rarely drop beginner clue scrolls.\n*Players could continuing until level 40 melee skills.",
    "disadvantages": "* Sometimes crowded.\n*No valuable drops other than a beginner clue scroll to solve.",
    "template": "melee training monster"
  },
  {
    "name": "Hill Giant or Hill Giant (Giants' Plateau)",
    "locations": "Edgeville Dungeon, Giants' Plateau",
    "combat": "28",
    "hitpoints": "35",
    "requirements": "Brass key (for the shed shortcut if going to Edgeville Dungeon), decent combat",
    "recommendations": "Your best armour (chainbody recommended) and weapons, and some moderate-to-high-healing food",
    "advantages": "*Decently high HP for level (35).\n*They have decent profitable drops for lower-level players such as limpwurt roots and they have access to the gem drop table that rarely drop uncut gems.\n*Chance of dropping a giant key, which allows the player to fight Obor, who also has good drops and a chance of dropping the valuable hill giant club .\n*They sometimes drop law runes, cosmic runes, nature runes, low-level equipment (varies depending on type of Hill Giant), and rarely drop chaos runes and death runes.\n*Always drop big bones which can be sold for guaranteed profit  or used for Prayer experience while training.\n* Faster aggression reset than Stronghold of Security, due to no doors. Just walk until you can't see giants on the minimap and return.",
    "disadvantages": "* Highly crowded in most worlds.\n*They can be a bit rough and tough against lower levels.",
    "template": "melee training monster"
  },
  {
    "name": "Hobgoblin",
    "locations": "Asgarnian Ice Dungeon, Crandor, Edgeville Dungeon, west of Crafting Guild",
    "combat": "28, 42",
    "hitpoints": "29, 49",
    "requirements": "Brass key (for the shed shortcut of Edgeville Dungeon), decent-to-mid-level combat",
    "recommendations": "Your best armour (chainbody recommended) and weapons, and some moderate-to-high-healing food",
    "advantages": "* A decent alternate monster of training your melee combat skills and profiting when hill giants are overcrowded.\n*Level 42 hobgoblins have high HP of 49 but they are stronger than their level 28 counterparts and are recommended to be fought at 40+ melee levels.\n*They have decent profitable drops for lower-level players as they very commonly drop limpwurt roots and they have access to the gem drop table that rarely drop uncut gems.\n*They drop similar runes as hill giants do (except for death runes) but they don't drop them as often as hill giants.",
    "disadvantages": "* They can be a bit rough and tough against lower levels, especially the Level 42 hobgoblins.",
    "template": "melee training monster"
  },
  {
    "name": "Moss giant",
    "locations": "Varrock Sewers, Crandor",
    "combat": "42",
    "hitpoints": "60",
    "requirements": "Mid-level combat, a knife or slash weapon if travelling in the Varrock Sewers to cut webs.",
    "recommendations": "Food, armour (chainbody recommended), staff of fire and nature runes for High Level Alchemy, runes for Varrock Teleport",
    "advantages": "*Fairly high HP for level.\n*Decent alchable drops such as black sq shield, mithril sword , and steel kiteshield .\n*Good rune drops such as law runes, nature runes, chaos runes, cosmic runes, and rarely death runes.\n*Chance of dropping a mossy key, which allows the player to fight Bryophyta, who also has good alchable drops. Additionally, Bryophyta can rarely drop its essence which can be crafted into Bryophyta's staff  by bringing the essence and  to Zaff at his store in Varrock.\n*Always drops big bones which can be sold for guaranteed profit  or used for Prayer experience while training.\n*They have access to the gem drop table and rarely drop uncut gems.",
    "disadvantages": "*Varrock Sewers are often crowded.\n*Hits hard if you have low Defence or weak armour.\n*All of their (F2P) locations are far from a bank",
    "template": "melee training monster"
  },
  {
    "name": "Ice giant",
    "locations": "Asgarnian Ice Dungeon, Frozen Waste Plateau in the Wilderness",
    "combat": "53",
    "hitpoints": "70",
    "requirements": "Good combat",
    "recommendations": "Food, rune equipment, staff of fire and nature runes for High Level Alchemy, runes for Falador and Varrock Teleport",
    "advantages": "*Stronger alternative to moss giants.\n*Decent alchable drops such as black kiteshield, mithril mace , and mithril sq shield \n*Often drops adamant arrows.\n*Good rune drops such as law runes, nature runes, and rarely cosmic runes and death runes.\n*Always drops big bones which can be sold for guaranteed profit or used for Prayer experience while training.\n*They have access to the gem drop table and rarely drop uncut gems.",
    "disadvantages": "*These enemies are tougher and stronger than moss giants, thus, they are usually inferior to them for experience.\n*Long distance from a bank in either available location.\n*Found in areas along side ice warriors, which tend to get in the way due to their high level of aggression.",
    "template": "melee training monster"
  },
  {
    "name": "Body golem",
    "locations": "Ruins of Camdozaal",
    "combat": "50",
    "hitpoints": "60",
    "requirements": "Below Ice Mountain, good combat",
    "recommendations": "Food, rune equipment, barronite mace",
    "advantages": "*Barronite mace deals more damage per second on golems in the ruins than any other weapon.\n*The player has a +5 permanent Defence boost if Charm of Defence is active.\n*If not using extra barronite guards for barronite shards or to create additional barronite maces, they can be high-level alchemized for coins. Charm of Luck will increase the drop rate by 5%.\n*Sometimes drop uncut gems up to ruby.\n*Drops clay and ores up to iron.\n*Drops noted rune essences and body cores for Runecraft training.\n*Close to a bank.",
    "disadvantages": "*Requires a quest to complete and may take a lot of time put into creating a barronite mace.\n*No bones or ashes drop for Prayer experience.",
    "template": "melee training monster"
  },
  {
    "name": "Ogress warrior and Ogress shaman",
    "locations": "Corsair Cove Dungeon",
    "combat": "82",
    "hitpoints": "82",
    "requirements": "Protect from Magic (37 Prayer as you'll get attacked by shamans), Protect from Melee (43 Prayer), started The Corsair Curse, Dragon Slayer I (for the Resource Area)",
    "recommendations": "Swordfish (they can be fished in the Resource Area with a harpoon), rune equipment (rune chainbody recommended), staff of fire and nature runes for High Level Alchemy, chisel to cut gems and high alch them, runes for Falador and Varrock Teleport, waiting 10 minutes to de-aggro ogresses)",
    "advantages": "*Fishing spots to fish for food in the Resource Area (required the completion of Dragon Slayer I).\n*Good alchable drops such as mithril kiteshield, rune med helm , rune full helm , and rune battleaxe , and the very rare unique drop shaman mask but it could sell at the Grand Exchange for .\n*Often drops a good variety of runes such law runes, nature runes, chaos runes, cosmic runes, and death runes.\n*They common drop uncut gems. You could bring a chisel to cut them and high level alchemize emeralds and higher-tier gems rather than banking uncut gems for more experience per trip. Sapphires don't make much profit from high level alchemy, so they can optionally be dropped while saving nature runes for everything else.",
    "disadvantages": "*Highly crowded in few areas.\n*Without praying or prayer flicking protection prayers, shamans and warriors can hit up to a maximum damage of 8 and quite often if your Defence is underleveled.\n*Must wait 10 minutes in an area to de-aggro ogresses in the area.",
    "template": "melee training monster"
  },
  {
    "name": "Lesser demon",
    "locations": "Crandor and Karamja Dungeon",
    "combat": "82",
    "hitpoints": "81",
    "requirements": "Partial completion of Dragon Slayer I, 30 coins to travel to Karamja from Port Sarim",
    "recommendations": "Protect from Melee (43 Prayer), swordfish, rune equipment, staff of fire and nature runes for High Level Alchemy, runes for Varrock Teleport",
    "advantages": "*Less defence than ogresses as a good alternative for more experience points but profits less.\n*High alchable drops include steel full helm, mithril sq shield , mithril chainbody , and rune med helm .\n*Commonly drops a good amount of fire runes and occasionally drops chaos runes and death runes.\n*They have access to the gem drop table and rarely drop uncut gems.\n*Drops vile ashes that give 25 Prayer XP per kill or can be sold on the Grand Exchange for each.",
    "disadvantages": "*Drops, while still decent, are not as amazing as ogresses' or greater demons' drops.\n*Without praying or prayer flicking Protect from Melee, they can hit up to a maximum damage of 8.",
    "template": "melee training monster"
  },
  {
    "name": "Ankou",
    "locations": "Sepulchre of Death (level 4) of Stronghold of Security",
    "combat": "75 (NE), 82 (SW), 86 (NW)",
    "hitpoints": "60 (NE), 65 (SW), 70 (NW)",
    "requirements": "None",
    "recommendations": "Protect from Melee (43 Prayer), swordfish, rune equipment (rune chainbody recommended), chisel to cut left skull halves into bone fragments",
    "advantages": "*Less defence than ogresses and an alternative to lesser demons but less Prayer experience and money.\n*Level 75 ankous can be found in the north-eastern room without any other monsters to interrupt while the 10-minute aggression timer is on-going.\n*Very commonly drops law runes and commonly drops black robes, adamant arrows, rune essences, and mithril ores.\n*They uncommonly drop left skull halves, which can be used to build or recharge skull sceptres (+5 charges or more for each Varrock Diary tier completed) or be cut into bone fragments, which can either charge the skull sceptre (i) or be sold on the Grand Exchange for each ( per left skull halves, or  more for each tier of the Varrock Diary completed up to  with all tiers of the Varrock Diary completed).\n*They have access to the gem drop table and rarely drop uncut gems.\n*Edgeville Monastery's altar (requires  to access the ) that is outside the stronghold is not too far away and restores over +2 Prayer.",
    "disadvantages": "*Drops, while still okay, are not as amazing as ogresses' or greater demons' drops. At times, even the lesser demons' rune med helm rare drops profit more until all tiers of the Varrock Diary are completed in Members to maximize profit from left skull halves' bone fragments.\n*Less Prayer XP for their bones than killing ogresses or lesser demons.\n*Without praying or prayer flicking Protect from Melee, they can hit up to a maximum damage of 7 (level 75) or 8 (levels 82 or 86).\n*Rooms with skeletons in them will get in the way while the aggression timer is still going.",
    "template": "melee training monster"
  },
  {
    "name": "Greater demon",
    "locations": "Demonic Ruins of the Wilderness",
    "combat": "92",
    "hitpoints": "89",
    "requirements": "High combat, rune scimitar or rune/barronite mace, prayer equipment (monk's robes and holy symbol), Protect from Melee (43+ Prayer)",
    "recommendations": "70+ Attack and Strength (lower levels may be fine too with better Attack/Strength prayers), high prayer level, no other equipment",
    "list": [
      "anchovy pizzas or swordfish."
    ],
    "advantages": "* Your prayer will gradually be restored in the Demonic Ruins. You'll never run out of prayer points with Burst of Strength + Clarity of Thought (or only one of the higher-tier prayers) and Protect from Melee constantly active. With the rune mace giving the player +4 prayer bonus and barronite mace +2 prayer bonus (while being slightly stronger), you may be able to step up to stronger offensive prayers while maintaining prayer but the rune mace is weaker than a rune scimitar.\n* Good high alchable drops such as rune full helm, adamant platelegs , and mithril kiteshield .\n*Drops vile ashes that give 25 Prayer XP per kill.\n* Ignoring drops, this is also an afk training method.",
    "disadvantages": "*Common hotspot for player killers. If you wish to bank your expensive drops, don't stay long.\n**If you don't plan on picking up drops, there is nothing much to worry about if you have Protect Item on as you won't lose anything from being PKed unless if the PKer baits you into attacking them first.\n**To continue training on greater demons, if your respawn point is in Lumbridge (Edgeville respawn is recommended), run across River Lum and up towards the farm house, grab a bronze axe, run back south towards the Lumbridge Canoe Station, and travel to the Wilderness (57 Woodcutting required). If you need a new set of monk's robes, they can be found on the of the Edgeville Monastery.",
    "template": "melee training monster"
  },
  {
    "name": "Chicken",
    "locations": "North-east of Lumbridge just east of River Lum, south of River Lum in Farmer Fred's chicken coop",
    "combat": "1",
    "hitpoints": "3",
    "requirements": "None",
    "advantages": "* No food required",
    "disadvantages": "* Only 3 Hitpoints (12 experience) per kill\n*Non-aggressive",
    "template": "melee training monster"
  },
  {
    "name": "Ammonite Crab",
    "locations": "Fossil Island",
    "combat": "25",
    "hitpoints": "100",
    "requirements": "Bone Voyage",
    "recommendations": "Armour and food for low defence levels. Digsite pendant. Build the bank chest on Fossil Island to get access to a nearby bank",
    "advantages": "* The best monster for training at medium and high combat levels\n*Very high health targets with low Defence and Attack ability, meaning you won't need much food if any\n*High in number, easy to group and kill in groups\n*Automatic aggro, meaning there are many AFK spots",
    "disadvantages": "* Often crowded\n*Stops aggro after 10 minutes. Must be reset by walking away and coming back. The distance required to reset their aggro status fluctuates but usually stays between 1 and 15 tiles. There are instances where it is further away",
    "template": "melee training monster"
  },
  {
    "name": "Sand Crab",
    "locations": "Beach south of Hosidius, Crabclaw Isle, Crabclaw Caves",
    "combat": "15",
    "hitpoints": "60",
    "requirements": "10,000 coins to enter Crabclaw Isle, or have started The Depths of Despair to enter the Crabclaw Caves. There are also spots with no requirements",
    "recommendations": "Armour and food for low levels. If you are farming on the beach south of Hosidius there is a bank chest nearby so inventory space is not a concern. Using a full inventory of super attack and super strength potions increases your DPS considerably, which ultimately increases the experiences rates per hour",
    "advantages": "* Very high health targets with low Defence and Attack ability\n*High in number, easy to group and kill in groups\n*Automatic aggro, meaning there are many AFK spots",
    "disadvantages": "* Often very crowded\n*Stops aggro after about 10 minutes, must be reset by walking about one screen away",
    "template": "melee training monster"
  },
  {
    "name": "Nightmare Zone",
    "combat": "Varies",
    "hitpoints": "Varies",
    "requirements": "At least 5 quests that Nightmare Zone requires",
    "recommendations": "Refer to the Nightmare Zone page for more information",
    "advantages": "*Fastest solo experience per hour for Attack and Strength in the game (using Dharok the Wretched's equipment)\n*Alternatively, offers the most AFK training method in the game (using normal customisable rumble setup with absorption potions)\n*Use of overload and absorption potions, gained from NMZ points which reduces need for super combat and prayer potions\n*Points can be used for imbues which upgrade equipment, or to purchase herb boxes for some profit\n*No competition from other players; Nightmare Zone is instanced and deaths are safe (Unless playing as a Hardcore Group Ironman) - you will not lose any items upon death/leaving apart from dropped items in the arena",
    "disadvantages": "*Requires a coin fee in order to start, and some quests in order to utilise\n*Players may need super combat and prayer potions for the first few games as they have no points\n*No drops other than spending points",
    "locations": "North of Yanille, north-west of the bank",
    "template": "melee training monster"
  },
  {
    "name": "Slayer",
    "combat": "Varies",
    "hitpoints": "Varies",
    "requirements": "None",
    "recommendations": "Combat level 100 to use Duradel, black mask or slayer helm, various teleports and quests",
    "advantages": "*Barrage tasks are the most efficient way to train Defence and Magic\n*Melee tasks offer good experience rates due to the damage and accuracy bonuses of the slayer helm\n*Trains the Slayer skill at the same time\n*Can be profitable depending on the task list",
    "disadvantages": "*Overall, efficient Slayer training gives relatively low amount of experience in Attack and Strength, as most of the Slayer experience is gained by barraging\n*Efficient Slayer training has many requirements, including already having high Melee stats, completing most of the game's quests to unlock teleports and blocking bad tasks\n*Profitable Melee tasks do not give good experience rates in Slayer\n*Only doing cannonable Melee tasks will result in a loss.\n*Many Slayer spots can often be crowded\n*Worse Melee experience per hour than using Dharok the Wretched's equipment in Nightmare Zone\n*Much less AFK compared to using normal customisable rumble setup with absorption potions in Nightmare Zone",
    "locations": "Varies",
    "template": "melee training monster"
  },
  {
    "name": "Pest Control",
    "locations": "Void Knight Outpost",
    "requirements": "70 Combat (for Intermediate Lander), 100 Combat (for Veteran Lander)",
    "recommendations": "At least the medium tier of combat achievements completed",
    "combat": "Varies",
    "hitpoints": "Varies",
    "advantages": "*Fastest melee XP in the game at higher levels with the hard combat achievements completed, as XP is gained both from combat and commendation points simultaneously\n*No competition from other players - in fact this method benefits from having more people participating\n*Stats get restored at the end of each game, allowing for frequent use of special attacks and negating the need for prayer potions\n*Earns a small amount of coins",
    "disadvantages": "*Depends on having enough people playing for optimal XP rates\n*Requires a high amount of attention as the games move quickly",
    "template": "melee training monster"
  },
  {
    "name": "Chicken",
    "locations": "North-east of Lumbridge just east of River Lum, south of River Lum in Farmer Fred's chicken coop",
    "combat": "1",
    "hitpoints": "3",
    "requirements": "None",
    "advantages": "* No food required\n*Feathers are dropped in groups of 5-15 and are stackable, and can be sold for some profit\n*Bones will drop frequently, allowing the player to train their prayer as well",
    "disadvantages": "* Only 3 Hitpoints (12 experience) per kill\n*Non-aggressive",
    "template": "melee training monster"
  },
  {
    "name": "Rock Crab",
    "locations": "North of Rellekka, Waterbirth Island",
    "combat": "13",
    "hitpoints": "50",
    "requirements": "To access Waterbirth Island, you must have started The Fremennik Trials quest. If you haven't finished the quest, it will cost 1,000 coins to travel there. There are also spots with no requirements",
    "recommendations": "Armour and food for low levels. Camelot teleport tabs or runes will bring you somewhat close",
    "advantages": "* Very, very high health targets with low Defence and Attack ability\n*High in number, easy to group and kill in groups",
    "disadvantages": "* Often crowded\n*Stops aggro after 10-15 minutes",
    "template": "melee training monster"
  },
  {
    "name": "Experiment",
    "locations": "Experiment cave",
    "combat": "25",
    "hitpoints": "100",
    "requirements": "Priest in Peril, started Creature of Fenkenstrain",
    "recommendations": "Armour and food for low levels. Ectophial, started Fairytale II - Cure a Queen for access to fairy rings or other teleport to Canifis for ease of access",
    "advantages": "* Identical stats to the Ammonite crabs above\n*Very, very high health targets with low Defence and Attack ability, meaning you won't need much food if any\n*Single combat area, meaning no chance of shared kills\n*Not crowded",
    "disadvantages": "* Experiments are usually a few squares apart\n*Only drops bones; no other drops\n*Cannot be grouped\n*Not aggressive, will require manual clicking",
    "template": "melee training monster"
  },
  {
    "name": "Men and Women",
    "locations": "Varies, including Lumbridge",
    "combat": "2",
    "hitpoints": "7",
    "requirements": "None",
    "recommendations": "Your best weapon and armour. Food if you try this from level 3",
    "advantages": "* Very common and weak NPC\n*Most of the profit will come from herbs, including the valuable Ranarr weed\n*Often close to banks\n*Decent amount of hp so you don't have to switch targets as often as you do when fighting chickens",
    "disadvantages": "* If you are unlucky and do not get many herbs you won't make much money\n*Non-aggressive\n*Often not grouped close together",
    "template": "melee training monster"
  },
  {
    "name": "Al-Kharid warrior",
    "locations": "Al Kharid Palace",
    "combat": "9",
    "hitpoints": "19",
    "requirements": "None",
    "recommendations": "Decent but cheap food like trout or salmon. Alternatively, you can buy kebabs for 1 coin each in Al Kharid. Also bring your best armour and weapons, because they can deal some damage",
    "advantages": "* Lots of warriors to fight\n*Aggressive if one warrior is attacked — all nearby others will come and fight. This makes it easy to always be fighting something\n*Bank is very, very close by\n*They frequently drop valuable herbs",
    "disadvantages": "* Often crowded\n*Reliant on herb drops for profit",
    "template": "melee training monster"
  },
  {
    "name": "Chaos druid",
    "locations": "Edgeville Dungeon, Chaos Druid Tower",
    "combat": "13",
    "hitpoints": "20",
    "requirements": "Decent combat, level 46 Thieving if fighting in Chaos Druid Tower",
    "recommendations": "Food. Your best weapon and armour if fighting outside of the Wilderness. Only three valuable items and a looting bag if fighting in Edgeville dungeon",
    "advantages": "*Great profit for a low level monster, drops valuable herbs, runes, and mithril bolts\n*Not far from a bank and teleport if using an amulet of glory or Ardougne teleport\n*Aggressive",
    "disadvantages": "*Easiest spot to reach is in low-level Wilderness, where players may be attacked by other players or may accidentally attack another player, skulling themselves, unless PK Skull Prevention is turned on in the settings.\n*Non-Wilderness locations are far from a bank or require decent thieving\n*They deal decent damage to low level players\n*Sometimes crowded",
    "template": "melee training monster"
  },
  {
    "name": "Moss giant",
    "locations": "Catacombs of Kourend, Varrock Sewers, West of the Fishing Guild",
    "combat": "42",
    "hitpoints": "60",
    "requirements": "Mid-level combat",
    "recommendations": "Food, armour, High alchemy runes, Teleport to house tablets for using another player's house to teleport to Kourend to reach the Catacombs, ring of dueling for banking",
    "advantages": "*Fairly high Hitpoints for level\n*Decent herb, seed, and alchable drops\n*Chance of dropping a Mossy key, which allows the player to fight Bryophyta, who also has good drops and a chance of dropping the valuable Bryophyta's essence\n*Chance of dropping pieces of the dark totem, which allows the player to fight Skotizo once they are a higher level\n*Always drops big bones which can be sold for guaranteed profit or used for Prayer experience while training",
    "disadvantages": "*It can be hard to reach the Catacombs of Kourend for low-level players. Regular players should use the Kourend portal in the Player-owned house of another player on World 330.\n*Hits hard if you have low defence or armour\n*Without Mossy key or valuable seed drops, they are usually not worth the time and food it takes to kill",
    "template": "melee training monster"
  },
  {
    "name": "Wilderness Slayer",
    "combat": "Varies",
    "hitpoints": "Varies",
    "requirements": "None",
    "recommendations": "Slayer helm, Dragon defender, many Slayer points to block bad tasks, food, burning amulet, amulet of glory, high ranged for dragonhide armour",
    "advantages": "*The damage and accuracy bonuses of the Slayer helm often make killing your Slayer task great melee experience\n*Trains the Slayer skill at the same time, letting you work towards the profitable slayer monsters and bosses\n*Many Slayer monsters have good drops\n*Accumulates Slayer points much quicker than normal Slayer. You can save up a lot of these very quickly before starting normal Slayer later on\n*Far fewer requirements than normal Slayer. Not many quests help navigate the Wilderness\n*All monsters killed on Wilderness Slayer assignments have a chance of dropping a valuable Larran's key. Players with average luck can expect to get about one per task",
    "disadvantages": "*Some Slayer tasks do not give good experience per hour. If the player has not accumulated enough points to block those tasks yet they may be stuck training slowly for a while\n*The player is constantly in danger of being killed by another player, especially in greater than level 30 Wilderness. It is highly recommended to set player attack options to \"Hidden\" so they don't accidentally Skull\n*The player cannot bring their most expensive gear. Only ever bring three valuable items in the Wilderness: a weapon, a dragon defender, and the Slayer helm. The player can bring an additional item without losing it upon death if the prayer Protect Item is used at the time of death, bringing the total items protected up to four\n*The player should use cheap items like climbing boots, dragonhide armour, and the amulet of glory\n*Some common slayer tasks cannot be killed with melee, such as lava dragons",
    "locations": "Wilderness",
    "template": "melee training monster"
  },
  {
    "name": "Green dragon",
    "locations": "Wilderness in various locations",
    "combat": "79",
    "hitpoints": "75",
    "requirements": "Dragonfire protection, good weapons, food, and armour",
    "recommendations": "Food. Only three valuable items and a Looting bag. Ring of dueling to teleport to a bank. A games necklace to teleport to Corporeal Beast",
    "advantages": "*Every kill is guaranteed to drop a green dragonhide and dragon bones which make up most of the profit\n*Also drops ensouled dragon head and nature runes\n*Aggressive",
    "disadvantages": "*Green dragons are only easily reached in medium-level Wilderness, where players may be attacked by other players or may accidentally attack another player, Skulling themselves, unless PK Skull Prevention is turned on in the settings\n*Dragonfire protection, such as from an anti-dragon shield, is required to fight them\n*No good rare drops\n*They can deal heavy damage, so a lot of food is required\n*Often crowded with both other green dragon farmers and player-killers",
    "template": "melee training monster"
  },
  {
    "name": "Slayer",
    "combat": "Varies",
    "hitpoints": "Varies",
    "requirements": "None",
    "recommendations": "85 combat to use Nieve, Slayer helm, various teleports and quests",
    "advantages": "*The damage and accuracy bonuses of the Slayer helm often make killing your Slayer task great melee experience\n*Trains the Slayer skill at the same time, letting you work towards the profitable Slayer monsters and bosses\n*Many slayer monsters have good drops\n*Accumulates Slayer points which allow you to unlock items and block tasks you don't like",
    "disadvantages": "*Some Slayer tasks do not give good experience per hour. If the player has not accumulated enough points to block those tasks yet they may be stuck training slowly for a while\n*Efficiently training Slayer has many requirements, including completing most of the game's quests to unlock teleports and blocking bad tasks\n*Some Slayer tasks cannot be completed with melee\n*Many Slayer spots can often be crowded",
    "locations": "Varies",
    "template": "melee training monster"
  },
  {
    "name": "Gargoyle",
    "locations": "Slayer tower",
    "combat": "111",
    "hitpoints": "105",
    "requirements": "75 Slayer, Rock hammer, Priest in Peril",
    "recommendations": "Guthan the Infested's equipment, a Kharyrll teleport portal, access to fairy rings or a Slayer ring. Your best armour and weapons. High level alchemy runes. Gargoyle smasher Slayer perk",
    "advantages": "*Consistently drops valuable items like rune armour and noted bars\n*Below-average offensive capabilities for their level. Players with high defence can easily sustain their health with Guthan's equipment, a Saradomin godsword, or food\n*Most of its drops are noted or are alchable, meaning the player can stay indefinitely without needing to bank\n*Aggressive\n*Easy to kill without paying attention with the Gargoyle smasher Slayer perk",
    "disadvantages": "*Above-average defence for their level, will give less experience per hour than other options\n*75 Slayer requirement\n*No rare valuable drops, just consistently good drops\n*Far from a bank\n*They can deal heavy damage to low-level players\n*Often crowded",
    "template": "melee training monster"
  },
  {
    "name": "Monkey Guards",
    "locations": "Marim",
    "combat": "167",
    "hitpoints": "130",
    "requirements": "Started Monkey Madness I and have not completed Monkey Madness II",
    "recommendations": "Dharok's set",
    "advantages": "*Seldomly used, so not many players visit apart from the occasional player completing Monkey Madness I\n*Aggressive as long as a monkey greegree is not worn (though they become tolerant like other aggressive enemies)\n*Nearby altar allows for infinite Prayer points",
    "disadvantages": "*No drops\n*Non-aggressive after you have completed Monkey Madness II\n*Antipoison is required as there are poisonous level 1 spiders, which share the same aggression mechanic as the monkeys and gorillas of Ape Atoll\n*Teleport is needed if you need to quickly leave the area if not near a staircase/ladder",
    "template": "melee training monster"
  },
  {
    "name": "Rune dragon",
    "locations": "Lithkren Vault",
    "combat": "380",
    "hitpoints": "330",
    "requirements": "Dragon Slayer II",
    "recommendations": "High combat including prayer, dragonfire shield, a zamorakian hasta or abyssal dagger, insulated boots, digsite pendant, armour with high defences, super combat potions, food",
    "advantages": "*Rune dragons are the most profitable non-boss monster a high level player can kill for profit with melee while not paying too much attention\n*Drops a runite bar and dragon bones on every kill, as well as frequently dropping valuable rune and dragon equipment\n*Has a chance of dropping several valuable rare items including the dragon limbs\n*Is close to the digsite pendant Lithkren teleport\n*Not too crowded",
    "disadvantages": "*Requires very expensive gear and completion of Dragon Slayer II\n*The dragons deal heavy damage even with max stats and the best items in the game. Players must keep their health above 60 to avoid dying to a ranged attack and melee attack combo\n*Rune dragons can heal themselves with their unblockable special attack. If the player is unlucky or weak the dragons will heal faster than they can be killed\n*The player must frequently bank to get lots of high-level food and potions to fight the dragons effectively\n*Their high defence yields below average experience rates\n*At this point in their account, players should have access to better money makers such as Vorkath and Zulrah",
    "template": "melee training monster"
  }
]