[
  {
    "activity": "Bird house trapping",
    "image": "Bird house trapping.png",
    "activity time": "2",
    "recurrence time": "50 minutes",
    "skill": "* highly recommended for enchanting digsite pendants\n* High  recommended\n*  if you wish to make your own houses\n* :  to make a crafting table 2 and assemble a clockwork",
    "other": "* Digsite pendant unlocked",
    "item": "* Hammer, chisel, clockwork, and logs or bird houses\n* Hop seeds or herb seeds",
    "quest": "Bone Voyage",
    "input1": "Redwood logs",
    "input1num": "4",
    "input2": "Hammerstone seed",
    "input2num": "40",
    "input3": "Digsite pendant",
    "input3num": "0.2",
    "input3value": "+",
    "output1": "Bird nest (seed)",
    "output1num": "3.14",
    "output2": "Bird nest (empty)",
    "output2num": "4.43",
    "output3": "Bird nest (ring)",
    "output3num": "2.36",
    "output4": "Bird nest (red egg)",
    "output4num": "0.22",
    "output4value": "+",
    "location": "Fossil Island",
    "category": "Hunter",
    "details": "This guide assumes having, setting redwood bird houses, and wearing a strung rabbit foot, although the latter only slightly increases profits.\n\nSee bird house trapping's page for recommended setup.",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Brewing chef's delight(m)",
    "image": "Brewing chef's delight(m).png",
    "activity time": "25",
    "recurrence time": "2880 minutes",
    "item": "* Ectophial\n* 2 packages of the stuff\n* 4 buckets of water\n* 4 barley malts\n* 2 pots of ale yeast\n* 8 chocolate dusts\n* 16 beer glasses",
    "quest": "* Ghosts Ahoy\n* The Giant Dwarf\n* Cabin Fever",
    "other": "None",
    "input1": "Bucket of water",
    "input1num": "4",
    "input2": "Barley malt",
    "input2num": "4",
    "input3": "The stuff",
    "input3num": "2",
    "input3value": "0",
    "input3note": "100 pieces of eight",
    "input4": "Chocolate dust",
    "input4num": "8",
    "input5": "Ale yeast",
    "input5num": "2",
    "input5value": "25",
    "input6": "Beer glass",
    "input6num": "16",
    "output1": "Chef's delight(m)",
    "output1num": "10.25",
    "output2": "Chef's delight",
    "output2num": "3.75",
    "location": "Port Phasmatys and Keldagrim",
    "category": "Cooking",
    "details": "Note: \"The stuff\" must be acquired from the Trouble Brewing minigame; each game lasts 20 minutes and will yield 100 pieces of eight, assuming 100 resources are deposited. This is enough to buy two bags of \"the stuff\" from Honest Jimmy, which is necessary to make money from this method.\n\nThere are two locations equipped for brewing chef's delight: upstairs of the Laughing Miner Pub on the eastern side of Keldagrim, and in the basement of The Green Ghost in Port Phasmatys. Start with the fermenting vat in Keldagrim.\n\nFill your inventory with two Buckets of water, two barley malts, one package of \"the stuff\", four chocolate dusts, two pots of ale yeast, and eight empty beer glasses. Head to the vat in eastern Keldagrim via the trapdoor north-west of the Grand Exchange for quick access to the minecart system. Alternatively, the grouping tab can be used to teleport either to the Blast Furnace or the Keldagrim Rat Pits (upon completion of Ratcatchers). Head to the Laughing Miner north of the minecart station and go upstairs to the brewery. Pick up two pots from the pot spawn near the vat if you don't have them already, and talk to Blandebir to fill them up with ale yeast for 25 coins each. \n\nOnce you have all the necessary items, fill up the fermenting vat by putting in the ingredients in this order: \n*2 Buckets of water\n*2 Barley malts\n*1 The stuff\n*4 Chocolate dusts\n*1 Ale yeast\n\nThe vat must be filled in the correct order — it is vital not to forget \"the stuff\", as it increases the chance of brewing the mature variant from 5% to 64%. \nAfter you put the ale yeast in, the ale will begin to ferment. The brewing process can take anywhere from one day to one week to finish (see the fermentation time section of the main brewing page for more information).\n\nHead back to the Grand Exchange via the mine carts, and withdraw the same items once again to fill the vat in Port Phasmatys. Withdraw an ectophial for the quickest access to the brewery, two barley malts, one package of \"the stuff\", four chocolate dusts, eight empty glasses and two buckets of water if you don't have them already. You should have one pot of ale yeast in your inventory from your earlier trip to Keldagrim. Use your ectophial and head to The Green Ghost Inn, south-east of the Ectofuntus. Go downstairs to the brewery, and repeat the vat-filling process by putting in the two buckets of water, two barley malts, the stuff, four chocolate dusts and the last pot of ale yeast, in that order. After you put the ale yeast in, the ale will begin to ferment.\n\n\n\nWhen a vat of chef's delight(m) is done, the examine text will say There is a 64% chance for a vat of chef's delight to successfully mature when the stuff has been added to the mixture (see the brewing outcomes section of the main brewing page for more information). Click the valve on the vat to empty the vat into the nearby barrel, and then use your empty glasses on the barrel to collect the ale. If you check the Port Phasmatys ale two days after it begins fermenting to see if it's done, you can go through the same vat-filling process to collect and refill the ale vats, starting with Keldagrim, in one go.",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Brewing greenman's ale(m)",
    "image": "Greenman's ale(m) detail.png",
    "activity time": "25",
    "recurrence time": "2880 minutes",
    "item": "* Ectophial\n* 2 packages of The stuff\n* 4 buckets of water\n* 4 barley malts\n* 2 pots of ale yeast\n* 8 harralanders\n* 16 beer glasses",
    "quest": "* Ghosts Ahoy\n* The Giant Dwarf\n* Cabin Fever",
    "other": "None",
    "input1": "Bucket of water",
    "input1num": "4",
    "input2": "Barley malt",
    "input2num": "4",
    "input3": "The stuff",
    "input3num": "2",
    "input3value": "0",
    "input3note": "100 pieces of eight",
    "input4": "Ale yeast",
    "input4num": "2",
    "input4value": "25",
    "input5": "Harralander",
    "input5num": "8",
    "input6": "Beer glass",
    "input6num": "16",
    "output1": "Greenman's ale(m)",
    "output1num": "10.25",
    "output2": "Greenman's ale",
    "output2num": "3.75",
    "location": "Port Phasmatys and Keldagrim",
    "category": "Cooking",
    "details": "Note: \"The stuff\" must be acquired from the Trouble Brewing minigame; each game lasts 20 minutes and will yield 100 pieces of eight, assuming 100 resources are deposited. This is enough to buy two bags of \"the stuff\" from Honest Jimmy, which is necessary to make money from this method. Although greenman's ale can be brewed starting at level 29 Cooking, level 40 is required to participate in Trouble Brewing.\n\nThere are two locations equipped for brewing greenman's ale: upstairs of the Laughing Miner Pub on the eastern side of Keldagrim, and in the basement of The Green Ghost in Port Phasmatys. Start with the fermenting vat in Keldagrim.\n\nFill your inventory with two Buckets of water, two barley malts, one package of \"the stuff\", four cleaned harralanders, two pots of ale yeast, and eight empty beer glasses. Head to the vat in eastern Keldagrim via the trapdoor north-west of the Grand Exchange for quick access to the minecart system. Alternatively, the grouping tab can be used to teleport either to the Blast Furnace or the Keldagrim Rat Pits (upon completion of Ratcatchers). Head to the Laughing Miner north of the minecart station and go upstairs to the brewery. Pick up two pots from the pot spawn near the vat if you don't have them already, and talk to Blandebir to fill them up with ale yeast for 25 coins each. \n\nOnce you have all the necessary items, fill up the fermenting vat by putting in the ingredients in this order: \n*2 Buckets of water\n*2 Barley malts\n*1 The stuff\n*4 Harralanders\n*1 Ale yeast\n\nThe vat must be filled in the correct order — it is vital not to forget \"the stuff\", as it increases the chance of brewing the mature variant from 5% to 64%. \nAfter you put the ale yeast in, the ale will begin to ferment. The brewing process can take anywhere from one day to one week to finish (see the fermentation time section of the main brewing page for more information).\n\nHead back to the Grand Exchange via the mine carts, and withdraw the same items once again to fill the vat in Port Phasmatys. Withdraw an ectophial for the quickest access to the brewery, two barley malts, one package of \"the stuff\", four harralanders, eight empty glasses and two buckets of water if you don't have them already. You should have one pot of ale yeast in your inventory from your earlier trip to Keldagrim. Use your ectophial and head to The Green Ghost Inn, south-east of the Ectofuntus. Go downstairs to the brewery, and repeat the vat-filling process by putting in the two buckets of water, two barley malts, the stuff, four harralanders and the last pot of ale yeast, in that order. After you put the ale yeast in, the ale will begin to ferment.\n\n\n\nWhen a vat of greenman's ale(m) is done, the examine text will say There is a 64% chance for a vat of greenman's ale to successfully mature when the stuff has been added to the mixture (see the brewing outcomes section of the main brewing page for more information). Click the valve on the vat to empty the vat into the nearby barrel, and then use your empty glasses on the barrel to collect the ale. If you check the Port Phasmatys ale two days after it begins fermenting to see if it's done, you can go through the same vat-filling process to collect and refill the ale vats, starting with Keldagrim, in one go.",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Buying battlestaves from Zaff",
    "image": "Zaff's Superior Staffs!.png",
    "activity time": "1",
    "recurrence time": "1440 minutes",
    "skill": "None",
    "quest": "None",
    "other": "Elite Varrock Diary (lower is still helpful)",
    "other benefits": "None",
    "input1": "Coins",
    "input1num": "840000",
    "input1value": "1",
    "output1": "Battlestaff",
    "output1num": "120",
    "location": "Zaff's Superior Staves",
    "category": "Recurring",
    "details": "Zaff will sell battlestaves under-price to players every 24 hours, resetting at 00:00 GMT. The number depends on how many of the Varrock tasks the player has completed: 15 staves with the easy ones completed, 30 with the medium, 60 with the hard, and 120 with the elite tasks completed.\n\nThe profit above is based on the elite tasks being completed.\n\nTeleport to Varrock through the Varrock Teleport, enter Zaff's store north-west of the Square, buy the noted staves, and either bank them or sell them immediately. It could be helpful to wait a few weeks and accumulate staves and then sell them in bulk, as battlestaves have a low Grand Exchange buying limit, and many crafters will pay extra to get a lot of staves at once.",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Claiming dynamite from Thirus",
    "image": "Thirus Urkar's Fine Dynamite Store.png",
    "activity time": "1",
    "recurrence time": "1440 minutes",
    "skill": "None",
    "item": "Xeric's talisman recommended",
    "quest": "None",
    "other": "Elite Kourend & Kebos Diary",
    "other benefits": "None",
    "output1": "Dynamite",
    "output1num": "80",
    "location": "Lovakengj",
    "category": "Recurring",
    "details": "After completing the elite Kourend & Kebos Diary, Thirus will give you 80 dynamite every day, resetting at 00:00 . Getting to him quickly requires a xeric's talisman teleport to Xeric's Inferno. Run north then east to his [[File:Mining shop icon.png]] Mining shop. \n\n\nCompleting only the hard Kourend and Kebos Diary rewards 40 dynamite, while the medium rewards only 20.",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Claiming pure essence from Wizard Cromperty",
    "image": "East Ardougne.png",
    "activity time": "1",
    "recurrence time": "1440 minutes",
    "skill": "* Skills needed to complete all Ardougne Diary tasks:\n* 90, 50 , 50 , 50 , 91 , 85 , 50 , 81 , 69 , 45 \n* 59 , 94 , 52 , 42 , 60 , 65 , 91 , 50 , 82 , 50",
    "item": "Ardougne cloak recommended",
    "quest": "None",
    "other": "Elite Ardougne Diary (Medium is still helpful)",
    "other benefits": "None",
    "output1": "Pure essence",
    "output1num": "250",
    "location": "East Ardougne",
    "category": "Recurring",
    "details": "After completing the elite Ardougne Diary, Wizard Cromperty will give you 250 pure essence every day, resetting at 00:00 UTC. To get to Cromperty, teleport using the Ardougne cloak or Ardougne Teleport and go into the marketplace in East Ardougne. He is located in the building east of the Servants' Guild. Right-click him to claim the essence. You don't need to be wearing your Ardougne cloak to do it, but it's recommended to use the cloak's teleport option.\n\nIf you've only completed the medium tasks, you can still claim 100 essence per day. Also, doing the hard ones bumps it up to 150.",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Exchanging mole parts",
    "image": "Bird nest (empty) detail.png",
    "activity time": "1",
    "recurrence time": "240 minutes",
    "skill": "None",
    "quest": "None",
    "other": "None",
    "other benefits": "None",
    "input1": "Mole claw",
    "input1num": "50",
    "input2": "Mole skin",
    "input2num": "50",
    "output1": "Bird nest (empty)",
    "output1num": "100",
    "output2": "Sweetcorn seed",
    "output2num": "3865.26/60",
    "output3": "Strawberry seed",
    "output3num": "3789.47/60",
    "output4": "Acorn",
    "output4num": "505.26/60",
    "output5": "Limpwurt seed",
    "output5num": "1010.53/60",
    "output6": "Watermelon seed",
    "output6num": "884.21/60",
    "output7": "Snape grass seed",
    "output7num": "505.26/60",
    "output8": "Lantadyme seed",
    "output8num": "189.47/60",
    "output9": "Dwarf weed seed",
    "output9num": "189.47/60",
    "output10": "Cadantine seed",
    "output10num": "151.58/60",
    "output11": "Teak seed",
    "output11num": "126.32/60",
    "output12": "Mahogany seed",
    "output12num": "126.32/60",
    "output13": "Willow seed",
    "output13num": "101.05/60",
    "output14": "Pineapple seed",
    "output14num": "101.05/60",
    "output15": "Calquat tree seed",
    "output15num": "75.79/60",
    "output16": "Papaya tree seed",
    "output16num": "63.16/60",
    "output17": "Maple seed",
    "output17num": "37.89/60",
    "output18": "Torstol seed",
    "output18num": "25.26/60",
    "output19": "Ranarr seed",
    "output19num": "25.26/60",
    "output20": "Snapdragon seed",
    "output20num": "25.26/60",
    "output21": "Yew seed",
    "output21num": "25.26/60",
    "output22": "Palm tree seed",
    "output22num": "12.63/60",
    "output23": "Dragonfruit tree seed",
    "output23num": "12.63/60",
    "output24": "Magic seed",
    "output24num": "12.63/60",
    "output25": "Celastrus seed",
    "output25num": "6.32/60",
    "output26": "Redwood tree seed",
    "output26num": "6.32/60",
    "output27": "Sapphire ring",
    "output27num": "432/60",
    "output28": "Gold ring",
    "output28num": "378/60",
    "output29": "Emerald ring",
    "output29num": "162/60",
    "output30": "Ruby ring",
    "output30num": "97.2/60",
    "output31": "Diamond ring",
    "output31num": "10.8/60",
    "output32": "Spirit seed",
    "output32num": "25.26/60",
    "location": "Falador Park",
    "category": "Processing",
    "members": "Yes",
    "intensity": "Moderate",
    "details": "Wyson the gardener in Falador park will exchange noted mole claws and mole skins for boxes containing bird nests. These nests may contain various seeds and pieces of jewellery. Emptying the nests and selling these items can be profitable. Spirit seeds can be traded to Guildmaster Jane for additional seeds.\n\nTo begin, buy mole claws and mole skins on the Grand Exchange. Bring these items (in noted form) to Wyson the gardener who will exchange them for nest boxes. Around 72% of nest boxes received will be seed nests, 20% will be jewellery nests, and 8% will be empty nests.\n\nTake these boxes to a bank and in the bank deposit interface, right-click each box to deposit their contents directly into your bank. Then, begin the click-intensive process of separating the seeds and jewellery from the nests. For seed nests withdraw 16 at a time, for jewellery nests withdraw 14 at a time. Expect to open between 4000 to 6000 nests per hour.\n\nPlease note that mole claws and mole skins have a relatively low buying limit (50 for each). It will take roughly days to buy 6000 mole parts.\n\nPlease also note that if one is unlucky and mainly receives lower valued seeds without the more expensive seeds such as Dragonfruit seeds, Redwood tree seeds, and Spirit seeds, one can lose money with this method. Therefore it is recommended to save up a large number of mole parts before attempting this method.\n\nPlayers can also crush the nests for additional profit. With the inclusions of Dragonfruit tree seed, Redwood tree seed, and Celastrus seed the actual profit may vary, but more tests need to be done with these new seeds added to the pool.",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Farming Yanillian hops",
    "version": "Minimal requirements",
    "image": "Yanillian Hops (grown).png",
    "activity time": "5",
    "recurrence time": "60 minutes",
    "skill": "* \n* recommended for Watchtower Teleport, 45 for Camelot Teleport\n*  recommended for the underwall tunnel agility shortcut to the Yanille patch",
    "item": "* Farming equipment:\n* Magic secateurs recommended\n* Yanillian seeds\n* Staves and/or runes for teleportation\n* Transportation recommendations:\n* Amulet of glory for Draynor Village teleport or Balloon transport system access\n* Chronicle for Champions' Guild teleport\n* Camelot Teleport or access to Fairy rings\n* Watchtower Teleport or Yanille Teleport to House",
    "quest": "* Enlightened Journey if using the Balloon transport system\n* Fairytale I - Growing Pains\n* Fairytale II - Cure a Queen (started) if using the Fairy rings\n* Watchtower if using Watchtower Teleport",
    "other": "Tool leprechaun with a seed dibber, a spade, a rake, and some ultracompost",
    "input1": "Yanillian seed",
    "input1num": "16",
    "input2": "Ultracompost",
    "input2num": "4",
    "input3": "Tomatoes(5)",
    "input3num": "4",
    "output1": "Yanillian hops",
    "output1num": "80",
    "location": "Lumbridge, Seers' Village, Yanille, and Entrana hops patches",
    "category": "Farming",
    "intensity": "Low",
    "details": "This guide assumes 20 hops from each patch, thus 80 hops. Your profit per hour may vary depending on yield.\n\nFarming Yanillian hops can be a very profitable way to spend a few minutes at a time. Magic secateurs help increase profits slightly due to the 10% boost to crop yield.\n\nPlayers should have 16 Yanillian seeds, 4 baskets of tomatoes, and some means of teleportation. Then, players can start their hops run at any hops patch withdrawing any additional supplies needed from the tool leprechaun. If players have access to the Lunar Spellbook from Lunar Diplomacy, Fertile Soil (83 Magic) can be used in lieu of supercompost, but it will reduce the profit per patch.\n\nAfter planting, a player should pay the nearby farmer to protect the patch and then move on to the next patch in any order. An example of a hops run is provided below.\n*Cast the Camelot Teleport and run north-west to the Seers' Village hops patch, or use the fairy rings (code ) to McGrubor's Wood and run north to the patch.\n*Cast the Watchtower Teleport and run east from the Watchtower through the Underwall Tunnel shortcut to the patch. Alternatively, use the Nightmare Zone minigame teleport.\n*Teleport to the Champions' Guild using the Chronicle or a combat bracelet and run south to the Lumbridge patch. \n*Teleport to Draynor Village using an Amulet of glory and run west to Port Sarim. Deposit any weapons or armour and take the boat to Entrana by talking to the monks. Run west to the hops patch. If the Enlightened Journey quest has been done, it's quicker to teleport to the Crafting Guild with a Skills Necklace or Crafting Cape and take the balloon to Entrana, then run south to the patch.",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Farming Yanillian hops",
    "version": "Max Farming",
    "image": "Yanillian Hops (grown).png",
    "activity time": "5",
    "recurrence time": "60 minutes",
    "skill": "* \n* recommended for Watchtower Teleport, 45 for Camelot Teleport\n*  recommended for the underwall tunnel agility shortcut to the Yanille patch",
    "item": "* Farming equipment:\n* Magic secateurs recommended\n* Yanillian seeds\n* Staves and/or runes for teleportation\n* Transportation recommendations:\n* Amulet of glory for Draynor Village teleport or Balloon transport system access\n* Chronicle for Champions' Guild teleport\n* Camelot Teleport or access to Fairy rings\n* Watchtower Teleport or Yanille Teleport to House",
    "quest": "* Enlightened Journey if using the Balloon transport system\n* Fairytale I - Growing Pains\n* Fairytale II - Cure a Queen (started) if using the Fairy rings\n* Watchtower if using Watchtower Teleport",
    "other": "Tool leprechaun with a seed dibber, a spade, a rake, and some ultracompost",
    "input1": "Yanillian seed",
    "input1num": "16",
    "input2": "Ultracompost",
    "input2num": "4",
    "input3": "Tomatoes(5)",
    "input3num": "4",
    "input4": "Logs",
    "output1": "Yanillian hops",
    "output1num": "108",
    "location": "Lumbridge, Seers' Village, Yanille, and Entrana hops patches",
    "category": "Farming",
    "intensity": "Low",
    "details": "This guide assumes an average of 27 hops from each patch, hence 108 hops in total per run. Your profit per hour may vary depending on yield.\n\nFarming Yanillian hops can be a very profitable way to spend a few minutes at a time. Magic secateurs help increase profits slightly due to the 10% boost to crop yield. The expected yield at higher Farming levels is significantly higher than at the minimum Farming requirement. Players may also choose to plant an attas seed in the anima patch of the Farming Guild, which will increase the expected yield to 32 hops per plant on average, for a total of 128 hops per run.\n\nPlayers should have 16 Yanillian seeds, 4 baskets of tomatoes, and some means of teleportation. Then, players can start their hops run at any hops patch withdrawing any additional supplies needed from the tool leprechaun. If players have access to the Lunar Spellbook from Lunar Diplomacy, Fertile Soil (83 Magic) can be used in lieu of supercompost, but it will reduce the profit per patch.\n\nAfter planting, a player should pay the nearby farmer to protect the patch and then move on to the next patch in any order. An example of a hops run is provided below.\n*Cast the Camelot Teleport and run north-west to the Seers' Village hops patch, or use the fairy rings (code ) to McGrubor's Wood and run north to the patch.\n*Cast the Watchtower Teleport and run east from the Watchtower through the Underwall Tunnel shortcut to the patch. Alternatively, use the Nightmare Zone minigame teleport.\n*Teleport to the Champions' Guild using the Chronicle or a combat bracelet and run south to the Lumbridge patch. \n*Teleport to the Crafting Guild with a Skills Necklace or Crafting Cape and take the balloon to Entrana, then run south to the patch.",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Farming avantoe",
    "image": "[[File:Farming herbs.gif]]",
    "activity time": "6",
    "recurrence time": "90 minutes",
    "skill": "* \n* (Trollheim Teleport or troll stronghold teleport, 96 strongly recommended for Spellbook Swap)\n*  recommended for shortcuts to Troll Stronghold",
    "item": "* Farming equipment:\n* Amulet of nature\n* Magic secateurs\n* Avantoe seeds\n* Smoke/Mud/Steam/Lava staff with runes for teleportation and spells\n* Transportation recommendations:\n* Ectophial\n* Explorer's ring 3\n* Trollheim Teleport\n* Camelot Teleport or Catherby Teleport\n* Ardougne Teleport or Ardougne cloak 2/3/4",
    "quest": "* Ghosts Ahoy\n* My Arm's Big Adventure\n* Fairytale I - Growing Pains\n* Dream Mentor (optional)",
    "other": "Tool leprechaun with a seed dibber, a spade, a rake, and some ultracompost",
    "input1": "Avantoe seed",
    "input1num": "8",
    "input2": "Ultracompost",
    "input2num": "8",
    "output1": "Grimy avantoe",
    "output1num": "70",
    "location": "Port Phasmatys, Falador, Catherby, Trollheim, Ardougne, Harmony Island, Hosidius, Weiss and Farming Guild herb patches",
    "category": "Farming",
    "details": "This guide assumes 8.8 herbs from each patch, thus 70 (70.4) herbs. Your profit per hour may vary depending on the survival rate.\n\nFarming grimy avantoe can be a very profitable way to spend a few minutes at a time. Magic secateurs help increase profits slightly due to the 10% boost to crop yield. Generally, good harvests yield 5-14 herbs, but the norm is five to eight herbs per patch, so players can expect an average of 6.5 herbs each patch. There is also a 10% chance herbs will succumb to disease and die.\n\nPlayers should have five avantoe seeds, some runes, and a means of teleportation. Then, players can start their herb run at any herb patch withdrawing any additional supplies needed from the tool leprechaun. If players have access to the Lunar Spellbook from Lunar Diplomacy, Fertile Soil (83 Magic) can be used in lieu of ultracompost, but it will make the profit per patch, thus total. Also, Spellbook Swap can be used to access the standard spellbook and Trollheim Teleport, but it requires 96 Magic and Dream Mentor.\n\nAfter planting, a player can move onto the next patch in any order. An example of a herb run is provided below.\n*Use the Camelot Teleport and run east to the Catherby herb patch, or use the Catherby Teleport and run north to the patch.\n*Cast Ardougne Teleport and run north-east, or use the Ardougne cloak teleport to get to the patch instantly.\n*Empty the Ectophial to Port Phasmatys and run west of the undead farm to the patch.\n*Cast Trollheim Teleport and use the Agility shortcuts to the west continuing downhill and through an area filled with aggressive trolls and into Troll Stronghold. Run south through the stronghold and to a door in the south-west, and then go north to a ladder. Climb it to get to the patch. Alternatively the troll stronghold teleport can be used if the quest requirement is met.\n*Use the cabbage port option on the Explorer's ring to teleport to the patch south of Falador.\n*Use the Tithe Farm minigame teleport to teleport to the Hosidius patch. Alternatively, a Xerics glade talisman can be used to teleport quickly.\n*Teleport to Weiss patch via Icy basalt.",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Farming cadantine",
    "image": "[[File:Farming herbs.gif]]",
    "activity time": "6",
    "recurrence time": "90 minutes",
    "skill": "* \n* (Trollheim Teleport, 96 strongly recommended for Spellbook Swap)\n*  recommended for shortcuts to Troll Stronghold",
    "item": "* Farming equipment:\n* Amulet of nature\n* Magic secateurs\n* Cadantine seeds\n* Smoke/Mud/Steam/Lava staff with runes for teleportation and spells\n* Transportation recommendations:\n* Ectophial\n* Explorer's ring 3\n* Trollheim Teleport\n* Camelot Teleport or Catherby Teleport\n* Ardougne Teleport or Ardougne cloak 2/3/4\n* Tithe Farm minigame teleport or Kharedst's memoirs",
    "quest": "* Ghosts Ahoy\n* My Arm's Big Adventure\n* Fairytale I - Growing Pains\n* Dream Mentor (optional)",
    "other": "Tool leprechaun with a seed dibber, a spade, a rake, and some supercompost",
    "input1": "Cadantine seed",
    "input1num": "8",
    "input2": "Ultracompost",
    "input2num": "8",
    "output1": "Grimy cadantine",
    "output1num": "70",
    "location": "Port Phasmatys, Falador, Catherby, Trollheim, Ardougne, Harmony Island, Hosidius, Weiss and Farming Guild herb patches",
    "category": "Farming",
    "details": "This guide assumes 8.8 herbs from each patch, thus 70.4 herbs. Your profit per hour may vary depending on the survival rate.\n\nFarming grimy cadantine can be a very profitable way to spend a few minutes at a time. Magic secateurs help increase profits slightly due to the 10% boost to crop yield. Generally, good harvests yield 5-14 herbs, but the norm is five to eight herbs per patch, so players can expect an average of 6.5 herbs each patch. There is also a 10% chance herbs will succumb to disease and die.\n\nPlayers should have five cadantine seeds, some runes, and a means of teleportation. Then, players can start their herb run at any herb patch withdrawing any additional supplies needed from the tool leprechaun. If players have access to the Lunar Spellbook from Lunar Diplomacy, Fertile Soil (83 Magic) can be used in lieu of supercompost, but it will make the profit per patch, thus total. Also, Spellbook Swap can be used to access the standard spellbook and Trollheim Teleport, but it requires 96 Magic and Dream Mentor.\n\nAfter planting, a player can move onto the next patch in any order. An example of a herb run is provided below.\n*Use the Camelot Teleport and run east to the Catherby herb patch, or use the Catherby Teleport and run north to the patch.\n*Cast Ardougne Teleport and run north-east, or use the Ardougne cloak teleport to get to the patch instantly.\n*Empty the Ectophial to Port Phasmatys and run west of the undead farm to the patch.\n*Cast Trollheim Teleport and use the Agility shortcuts to the west continuing downhill and through an area filled with aggressive trolls and into Troll Stronghold. Run south through the stronghold and to a door in the south-west, and then go north to a ladder. Climb it to get to the patch.\n*Use the cabbage port option on the Explorer's ring to teleport to the patch south of Falador.\n*Use the Tithe Farm minigame teleport to teleport to the Hosidius patch.\n*Teleport to Weiss patch via Icy basalt.",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Farming dwarf weed",
    "image": "[[File:Farming herbs.gif]]",
    "activity time": "6",
    "recurrence time": "90 minutes",
    "skill": "* \n* (Trollheim Teleport, 96 strongly recommended for Spellbook Swap)\n*  recommended for shortcuts to Troll Stronghold",
    "item": "* Farming equipment:\n* Amulet of nature\n* Magic secateurs\n* Dwarf weed seeds\n* Smoke/Mud/Steam/Lava staff with runes for teleportation and spells\n* Transportation recommendations:\n* Ectophial\n* Explorer's ring 3\n* Trollheim Teleport\n* Camelot Teleport or Catherby Teleport\n* Ardougne Teleport or Ardougne cloak 2/3/4\n* Tithe Farm minigame teleport, Kharedst's memoirs or Xeric's Talisman (charged)",
    "quest": "* Ghosts Ahoy\n* My Arm's Big Adventure\n* Fairytale I - Growing Pains\n* Dream Mentor (optional)",
    "other": "Tool leprechaun with a seed dibber, a spade, a rake, and some ultracompost",
    "input1": "Dwarf weed seed",
    "input1num": "6",
    "input2": "Ultracompost",
    "input2num": "6",
    "output1": "Grimy dwarf weed",
    "output1num": "73",
    "location": "Port Phasmatys, Falador, Catherby, Trollheim, Ardougne, Harmony Island, Hosidius, Weiss and Farming Guild herb patches",
    "category": "Farming",
    "details": "This guide assumes 8.8 herbs from each patch, thus 73 herbs. Your profit per hour may vary depending on the survival rate.\n\nFarming grimy dwarf weed can be a very profitable way to spend a few minutes at a time. Magic secateurs help increase profits slightly due to the 10% boost to crop yield. Generally, good harvests yield 5-14 herbs, but the norm is five to eight herbs per patch, so players can expect an average of 6.5 herbs each patch. There is also a 10% chance herbs will succumb to disease and die.\n\nPlayers should have five dwarf weed seeds, some runes, and a means of teleportation. Then, players can start their herb run at any herb patch withdrawing any additional supplies needed from the tool leprechaun. If players have access to the Lunar Spellbook from Lunar Diplomacy, Fertile Soil (83 Magic) can be used in lieu of supercompost, but it will make the profit per patch, thus total. Also, Spellbook Swap can be used to access the standard spellbook and Trollheim Teleport, but it requires 96 Magic and Dream Mentor.\n\nAfter planting, a player can move onto the next patch in any order. An example of a herb run is provided below.\n*Use the Camelot Teleport and run east to the Catherby herb patch, or use the Catherby Teleport and run north to the patch.\n*Cast Ardougne Teleport and run north-east, or use the Ardougne cloak teleport to get to the patch instantly.\n*Empty the Ectophial to Port Phasmatys and run west of the undead farm to the patch.\n*Cast Trollheim Teleport and use the Agility shortcuts to the west continuing downhill and through an area filled with aggressive trolls and into Troll Stronghold. Run south through the stronghold and to a door in the south-west, and then go north to a ladder. Climb it to get to the patch.\n*Use the cabbage port option on the Explorer's ring to teleport to the patch south of Falador.\n*Use the Tithe Farm minigame teleport to teleport to the Hosidius patch.\n*Teleport to Weiss patch via Icy basalt.",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Farming irit leaves",
    "image": "[[File:Farming herbs.gif]]",
    "activity time": "6",
    "recurrence time": "90 minutes",
    "skill": "* \n* (Trollheim Teleport, 96 strongly recommended for Spellbook Swap)\n*  recommended for shortcuts to Troll Stronghold",
    "item": "* Farming equipment:\n* Amulet of nature\n* Magic secateurs\n* Irit seeds\n* Smoke/Mud/Steam/Lava staff with runes for teleportation and spells\n* Transportation recommendations:\n* Ectophial\n* Explorer's ring 3\n* Trollheim Teleport\n* Camelot Teleport or Catherby Teleport\n* Ardougne Teleport or Ardougne cloak 2/3/4\n* Tithe Farm minigame teleport or Kharedst's memoirs",
    "quest": "* Ghosts Ahoy\n* My Arm's Big Adventure\n* Fairytale I - Growing Pains\n* Dream Mentor (optional)",
    "other": "Tool leprechaun with a seed dibber, a spade, a rake, and some ultracompost",
    "input1": "Irit seed",
    "input1num": "6",
    "input2": "Ultracompost",
    "input2num": "6",
    "output1": "Grimy irit leaf",
    "output1num": "52",
    "location": "Port Phasmatys, Falador, Catherby, Trollheim, Ardougne, Harmony Island, Hosidius, Weiss and Farming Guild herb patches",
    "category": "Farming",
    "intensity": "Low",
    "details": "This guide assumes 8.8 herbs from each patch, thus 52 herbs. Your profit per hour may vary depending on the survival rate.\n\nFarming grimy irit leaves can be a very profitable way to spend a few minutes at a time. Magic secateurs help increase profits slightly due to the 10% boost to crop yield. Generally, good harvests yield 5-14 herbs, but the norm is five to eight herbs per patch, so players can expect an average of 6.5 herbs each patch. There is also a 10% chance herbs will succumb to disease and die.\n\nPlayers should have five irit seeds, some runes, and a means of teleportation. Then, players can start their herb run at any herb patch withdrawing any additional supplies needed from the tool leprechaun. If players have access to the Lunar Spellbook from Lunar Diplomacy, Fertile Soil (83 Magic) can be used in lieu of supercompost, but it will make the profit per patch, thus total. Also, Spellbook Swap can be used to access the standard spellbook and Trollheim Teleport, but it requires 96 Magic and Dream Mentor.\n\nAfter planting, a player can move onto the next patch in any order. An example of a herb run is provided below.\n*Use the Camelot Teleport and run east to the Catherby herb patch, or use the Catherby Teleport and run north to the patch.\n*Cast Ardougne Teleport and run north-east, or use the Ardougne cloak teleport to get to the patch instantly.\n*Empty the Ectophial to Port Phasmatys and run west of the undead farm to the patch.\n*Cast Trollheim Teleport and use the Agility shortcuts to the west continuing downhill and through an area filled with aggressive trolls and into Troll Stronghold. Run south through the stronghold and to a door in the south-west, and then go north to a ladder. Climb it to get to the patch.\n*Use the cabbage port option on the Explorer's ring to teleport to the patch south of Falador.\n*Use the Tithe Farm minigame teleport to teleport to the Hosidius patch.\n*Teleport to Weiss patch via Icy basalt.",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Farming jute fibre",
    "version": "Minimal requirements",
    "image": "[[File:Jute fibre.png]]",
    "activity time": "5",
    "recurrence time": "50 minutes",
    "skill": "* \n* recommended for Watchtower Teleport, 45 for Camelot Teleport\n*  recommended for the underwall tunnel agility shortcut to the Yanille patch",
    "item": "* Farming equipment:\n* Magic secateurs recommended\n* Jute seeds\n* Staves and/or runes for teleportation\n* Transportation recommendations:\n* Amulet of glory for Draynor Village teleport or Balloon transport system access\n* Chronicle for Champions' Guild teleport\n* Camelot Teleport or access to Fairy rings\n* Watchtower Teleport or Yanille Teleport to House",
    "quest": "* Enlightened Journey if using the Balloon transport system\n* Fairytale I - Growing Pains\n* Fairytale II - Cure a Queen (started) if using the Fairy rings\n* Watchtower if using Watchtower Teleport",
    "other": "Tool leprechaun with a seed dibber, a spade, a rake, and some ultracompost",
    "input1": "Jute seed",
    "input1num": "12",
    "input2": "Ultracompost",
    "input2num": "4",
    "output1": "Jute fibre",
    "output1num": "80",
    "location": "Lumbridge, Seers' Village, Yanille, and Entrana hops patches",
    "category": "Farming",
    "intensity": "Low",
    "details": "This guide assumes 20 hops from each patch, thus 80 hops. Your profit per hour may vary depending on yield.\n\nFarming jute fibers can be a very profitable way to spend a few minutes at a time. Magic secateurs help increase profits slightly due to the 10% boost to crop yield.\n\nPlayers should have 12 jute seeds, a seed dibber, a spade, and means of teleportation. Then, players can start their hops run at any hops patch withdrawing any additional supplies needed from the tool leprechaun. If players have access to the Lunar Spellbook from Lunar Diplomacy, Fertile Soil (83 Magic) can be used in lieu of supercompost, but it will reduce the profit per patch.\n\nProtecting the plot of jute seeds is not recommended, instead relying solely on ultracompost is more cost effective.\n\nAn example of a hops run is provided below.\n*Cast the Camelot Teleport and run north-west of Seers' Village to the hops patch, or use the fairy rings (code ) to McGrubor's Wood and run north, or use the music cape and run south.\n*Cast the Watchtower Teleport and run east from the Watchtower through the Underwall Tunnel shortcut to the patch. Alternatively, use the Nightmare Zone minigame teleport.\n*Teleport to the Champions' Guild using the Chronicle or a Combat Bracelet and run south to the Lumbridge patch.\n*Teleport to Draynor Village using an Amulet of glory and run west to Port Sarim. Deposit any weapons or armour and take the boat to Entrana by talking to the monks. Run west to the hops patch.\n**If the Enlightened Journey quest has been done, teleport to Castle Wars with a ring of dueling, run north-east and take the balloon to Entrana, requiring a log.\n**If the Lumbridge Medium diary is completed, use the Explorer's Ring 2 to teleport to the cabbage patch and run south to take the boat to Entrana",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Farming jute fibre",
    "version": "Max Farming",
    "image": "[[File:Jute fibre.png]]",
    "activity time": "5",
    "recurrence time": "50 minutes",
    "skill": "* \n* recommended for Watchtower Teleport, 45 for Camelot Teleport\n*  recommended for the underwall tunnel agility shortcut to the Yanille patch",
    "item": "* Farming equipment:\n* Magic secateurs recommended\n* Jute seeds\n* Staves and/or runes for teleportation\n* Transportation recommendations:\n* Amulet of glory for Draynor Village teleport or Balloon transport system access\n* Chronicle for Champions' Guild teleport\n* Camelot Teleport or access to Fairy rings\n* Watchtower Teleport or Yanille Teleport to House",
    "quest": "* Enlightened Journey if using the Balloon transport system\n* Fairytale I - Growing Pains\n* Fairytale II - Cure a Queen (started) if using the Fairy rings\n* Watchtower if using Watchtower Teleport",
    "other": "Tool leprechaun with a seed dibber, a spade, a rake, and some ultracompost",
    "input1": "Jute seed",
    "input1num": "12",
    "input2": "Ultracompost",
    "input2num": "4",
    "input3": "Logs",
    "output1": "Jute fibre",
    "output1num": "108",
    "location": "Lumbridge, Seers' Village, Yanille, and Entrana hops patches",
    "category": "Farming",
    "intensity": "Low",
    "details": "This guide assumes 27 bundles of fibre from each patch, hence 108 jute fibres in total for a full crop run on average. Keep in mind this average does not take into account losses resulting from dead crops. Your profit per hour may vary depending on yield.\n\nFarming jute fibers can be a very profitable way to spend a few minutes at a time. Magic secateurs help increase profits slightly due to the 10% boost to crop yield. The expected yield at higher Farming levels is significantly higher than at the minimum Farming requirement.\n\nPlayers should have 12 jute seeds, a seed dibber, a spade, and means of teleportation. Then, players can start their hops run at any hops patch withdrawing any additional supplies needed from the tool leprechaun. If players have access to the Lunar Spellbook from Lunar Diplomacy, Fertile Soil (83 Magic) can be used in lieu of supercompost, but it will reduce the profit per patch.\n\nProtecting the plot of jute seeds is not recommended, instead relying solely on ultracompost is more cost effective.\n\nAn example of a hops run is provided below.\n*Cast the Camelot Teleport and run north-west of Seers' Village to the hops patch, or use the fairy rings (code ) to McGrubor's Wood and run north, or use the music cape and run south.\n*Cast the Watchtower Teleport and run east from the Watchtower through the Underwall Tunnel shortcut to the patch. Alternatively, use the Nightmare Zone minigame teleport.\n*Teleport to the Champions' Guild using the Chronicle or a Combat Bracelet and run south to the Lumbridge patch.\n*Teleport to Castle Wars with a ring of dueling, run north-east and take the balloon to Entrana, then run south to the patch.",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Farming kwuarm",
    "image": "[[File:Farming herbs.gif]]",
    "activity time": "6",
    "recurrence time": "90 minutes",
    "skill": "* \n* (Trollheim Teleport, 96 strongly recommended for Spellbook Swap)\n*  recommended for shortcuts to Troll Stronghold",
    "item": "* Farming equipment:\n* Amulet of nature\n* Magic secateurs\n* Kwuarm seeds\n* Smoke/Mud/Steam/Lava staff with runes for teleportation and spells\n* Transportation recommendations:\n* Ectophial\n* Explorer's ring 3\n* Trollheim Teleport\n* Camelot Teleport or Catherby Teleport\n* Ardougne Teleport or Ardougne cloak 2/3/4",
    "quest": "* Ghosts Ahoy\n* My Arm's Big Adventure\n* Fairytale I - Growing Pains\n* Dream Mentor (optional)",
    "other": "Tool leprechaun with a seed dibber, a spade, a rake, and some ultracompost",
    "input1": "Kwuarm seed",
    "input1num": "8",
    "input2": "Ultracompost",
    "input2num": "8",
    "output1": "Grimy kwuarm",
    "output1num": "70",
    "location": "Port Phasmatys, Falador, Catherby, Trollheim, Ardougne, Harmony Island, Hosidius, Weiss and Farming Guild herb patches",
    "category": "Farming",
    "details": "This guide assumes eight herbs from each patch, thus 70.4 herbs. Your profit per hour may vary depending on the survival rate.\n\nFarming grimy kwuarm can be a very profitable way to spend a few minutes at a time. Magic secateurs help increase profits slightly due to the 10% boost to crop yield. Generally, good harvests yield 5-14 herbs, but the norm is five to eight herbs per patch, so players can expect an average of 6.5 herbs each patch. There is also a 10% chance herbs will succumb to disease and die.\n\nPlayers should have five kwuarm seeds, some runes, and a means of teleportation. Then, players can start their herb run at any herb patch withdrawing any additional supplies needed from the tool leprechaun. If players have access to the Lunar Spellbook from Lunar Diplomacy, Fertile Soil (83 Magic) can be used in lieu of ultracompost, but it will make the profit per patch, thus total. Also, Spellbook Swap can be used to access the standard spellbook and Trollheim Teleport, but it requires 96 Magic and Dream Mentor.\n\nAfter planting, a player can move onto the next patch in any order. An example of a herb run is provided below.\n*Use the Camelot Teleport and run east to the Catherby herb patch, or use the Catherby Teleport and run north to the patch.\n*Cast Ardougne Teleport and run north-east, or use the Ardougne cloak teleport to get to the patch instantly.\n*Empty the Ectophial to Port Phasmatys and run west of the undead farm to the patch.\n*Cast Trollheim Teleport and use the Agility shortcuts to the west continuing downhill and through an area filled with aggressive trolls and into Troll Stronghold. Run south through the stronghold and to a door in the south-west, and then go north to a ladder. Climb it to get to the patch.\n*Use the cabbage port option on the Explorer's ring to teleport to the patch south of Falador.\n*Use the Tithe Farm minigame teleport to teleport to the Hosidius patch.\n*Teleport to Weiss patch via Icy basalt.",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Farming lantadyme",
    "image": "[[File:Farming herbs.gif]]",
    "activity time": "6",
    "recurrence time": "90 minutes",
    "skill": "* \n* (Trollheim Teleport, 96 strongly recommended for Spellbook Swap)\n*  recommended for shortcuts to Troll Stronghold",
    "item": "* Farming equipment:\n* Amulet of nature\n* Magic secateurs\n* Lantadyme seeds\n* Smoke/Mud/Steam/Lava staff with runes for teleportation and spells\n* Transportation recommendations:\n* Ectophial\n* Explorer's ring 3\n* Trollheim Teleport\n* Camelot Teleport or Catherby Teleport\n* Ardougne Teleport or Ardougne cloak 2/3/4\n* Tithe Farm minigame teleport or Kharedst's memoirs",
    "quest": "* Ghosts Ahoy\n* My Arm's Big Adventure\n* Fairytale I - Growing Pains\n* Dream Mentor (optional)",
    "other": "Tool leprechaun with a seed dibber, a spade, a rake, and some supercompost",
    "input1": "Lantadyme seed",
    "input1num": "8",
    "input2": "Ultracompost",
    "input2num": "8",
    "output1": "Grimy lantadyme",
    "output1num": "70",
    "location": "Port Phasmatys, Falador, Catherby, Trollheim, Ardougne, Harmony Island, Hosidius, Weiss and Farming Guild herb patches",
    "category": "Farming",
    "details": "This guide assumes 8.8 herbs from each patch, thus 70.4 herbs. Your profit per hour may vary depending on the survival rate.\n\nFarming grimy lantadyme can be a very profitable way to spend a few minutes at a time. Magic secateurs help increase profits slightly due to the 10% boost to crop yield. Generally, good harvests yield 5-14 herbs, but the norm is five to eight herbs per patch, so players can expect an average of 6.5 herbs each patch. There is also a 10% chance herbs will succumb to disease and die.\n\nPlayers should have five lantadyme seeds, some runes, and a means of teleportation. Then, players can start their herb run at any herb patch withdrawing any additional supplies needed from the tool leprechaun. If players have access to the Lunar Spellbook from Lunar Diplomacy, Fertile Soil (83 Magic) can be used in lieu of supercompost, but it will make the profit per patch, thus total. Also, Spellbook Swap can be used to access the standard spellbook and Trollheim Teleport, but it requires 96 Magic and Dream Mentor.\n\nAfter planting, a player can move onto the next patch in any order. An example of a herb run is provided below.\n*Use the Camelot Teleport and run east to the Catherby herb patch, or use the Catherby Teleport and run north to the patch.\n*Cast Ardougne Teleport and run north-east, or use the Ardougne cloak teleport to get to the patch instantly.\n*Empty the Ectophial to Port Phasmatys and run west of the undead farm to the patch.\n*Cast Trollheim Teleport and use the Agility shortcuts to the west continuing downhill and through an area filled with aggressive trolls and into Troll Stronghold. Run south through the stronghold and to a door in the south-west, and then go north to a ladder. Climb it to get to the patch.\n*Use the cabbage port option on the Explorer's ring to teleport to the patch south of Falador.\n*Use the Tithe Farm minigame teleport to teleport to the Hosidius patch.\n*Teleport to Weiss patch via Icy basalt.",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Farming ranarr weed",
    "image": "[[File:Farming herbs.gif]]",
    "activity time": "6",
    "recurrence time": "90 minutes",
    "skill": "* (65 if using the Farming Guild herb patch)\n*  (Trollheim Teleport, 96 strongly recommended for Spellbook Swap)\n*  recommended for shortcuts to Troll Stronghold or  to use the shortcut to get on the roof of Troll Stronghold (if completed  Making Friends with My Arm  and  Hard Fremennik Diary then you will automatically be teleported on the roof using the Stony basalt)",
    "item": "* Farming equipment:\n* Amulet of nature\n* Magic secateurs\n* Ranarr seeds\n* Smoke/Mud/Steam/Lava staff with runes for teleportation and spells\n* Transportation recommendations:\n* Player-Owned House Themed World for access to all teleports\n* Ectophial\n* Explorer's ring 2/3/4\n* Trollheim Teleport or Stony basalt\n* Camelot Teleport or Catherby Teleport\n* Ardougne Teleport or Ardougne cloak 2/3/4\n* Xeric's Talisman (Highly recommended), Tithe Farm minigame teleport, or Kharedst's memoirs\n* Skills necklace \n* Icy basalt \n* Harmony Island Teleport if you can use the Harmony Island herb patch",
    "quest": "* Ghosts Ahoy\n* My Arm's Big Adventure\n* Fairytale I - Growing Pains\n* Partial completion of Making Friends with My Arm for the Weiss herb patch (optional)\n* Dream Mentor (optional)",
    "other": "Tool leprechaun with a seed dibber, a spade, a rake, and some Ultracompost \n60% Hosidius favor if using the Farming guild herb patch (optional) \n Medium Lumbridge & Draynor Diary (or higher) for Explorer's ring 2 teleport to cabbage patch adjacent to the Falador farm herb patch (optional) \n Medium Ardougne Diary (or higher) for Ardougne cloak 2 teleport to Ardougne herb patch (optional) \n Hard Fremennik Diary if using the Troll Stronghold herb patch to access the shortcut to the roof (optional)\n Elite Morytania Diary if using the Harmony Island herb patch (optional)",
    "other benefits": "- Using Fertile Soil: -",
    "input1": "Ranarr seed",
    "input1num": "8",
    "input2": "Ultracompost",
    "input2num": "8",
    "output1": "Grimy ranarr weed",
    "output1num": "70",
    "location": "Port Phasmatys, Falador, Catherby, Trollheim, Ardougne, Harmony Island, Hosidius, Weiss and Farming Guild herb patches",
    "category": "Farming",
    "details": "This guide assumes 8.8 herbs from each patch, thus 70 (70.4) herbs. Your profit per hour may vary depending on the survival rate. This also assumes you can access all the patches except the one in Harmony Island\n\nFarming grimy ranarr weed can be a very profitable way to spend a few minutes at a time. Magic secateurs help increase profits slightly due to the 10% boost to crop yield. Generally, good harvests yield 6-15 herbs, but the norm is six to ten herbs per patch, so players can expect an average of 8.8 herbs each patch.\n\nPlayers should have 5-9 ranarr seeds, some runes, and a means of teleportation. Then, players can start their herb run at any herb patch withdrawing any additional supplies needed from the tool leprechaun. If players have access to the Lunar Spellbook from Lunar Diplomacy, Fertile Soil (83 Magic) can be used in lieu of Ultracompost, but it will make the profit per patch, thus total. Also, Spellbook Swap can be used to access the standard spellbook and Trollheim Teleport, but it requires 96 Magic and Dream Mentor.\n\nPlayers can increase their profits:\n*If they attune an Amulet of Nature to one of their herb patches, and keep it with them while doing other tasks around the game, so that they can check frequently whether their crops are fully grown\n*If they use the Geomancy spell that can monitor the health of their patches and tell them when their patches are fully grown\n*If they plant Anima plants (76 Farming, boostable), like Iasor, Kronos, or Attas, which decrease the rate of disease, decrease the amount of time it takes for crops to grow, or increase the yield of their crops, respectively\n\nPlayers who have completed Dream Mentor, have 83 Magic (boost possible), and who have read the Ash covered tome (Volcanic Mine minigame) may use Fertile Soil instead of Ultracompost. This makes inventory management somewhat easier, however, 1 cast of Fertile Soil costs  at current prices, while Ultracompost costs  each at current prices. Considering that player can reduce their run times marginally with more inventory spaces freed up by only needing to use 3 inventory slots (a Rune Pouch, a slot for Staff of Earth/Magic Secateurs, and a slot for Volcanic ash), as opposed to 5-9 slots for each Ultracompost, the additional cost using Fertile Soil might still increase profits if run time can be reduced enough, considering that herb runs are very profitable in general. Players need only use 2 inventory slots if they opt to not bring a Staff of Earth, and instead fill their Rune Pouches with Earth Runes. This increases the cost of 1 Fertile Soil cast to .\n\nAlternatively, players may use a Bottomless compost bucket to make inventory management easier.\n\nAfter planting, a player can move onto the next patch in any order. An example of a herb run is provided below.\n\n*Use the Camelot Teleport and run east to the Catherby herb patch, or use the Catherby Teleport and run north to the patch.\n*Cast Ardougne Teleport and run north-east, or use the Ardougne cloak teleport to get to the patch instantly.\n*Empty the Ectophial to Port Phasmatys and run west of the undead farm to the patch.\n*Cast Trollheim Teleport and use the Agility shortcuts to the west continuing downhill and through an area filled with aggressive trolls and into Troll Stronghold. Run south through the stronghold and to a door in the south-west, and then go north to a ladder. Climb it to get to the patch. For a faster route, use a Stony basalt or Trollhiem teleport portal in POH to be teleported next to the shortcut up to the farming patch (requires completion of Making Friends with My Arm.)\n*Use the cabbage Teleport option on the Explorer's ring to teleport to the patch south of Falador.\n*Teleport to the Hosidius patch with Xeric's Talisman to Xeric's Glade, Tithe Farm minigame teleport, or skills necklace to woodcutting guild.\n*Teleport to Weiss patch with Icy basalt or Weiss portal in POH.\n*Teleport to Farming guild patch via the Farming cape teleport, Skills necklace or Fancy jewellery box/Spirit Tree in POH.\n*If you have the Morytania Elite Diary, cast Harmony Island Teleport and run south to the patch.",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Farming snapdragon",
    "image": "[[File:Farming herbs.gif]]",
    "activity time": "6",
    "recurrence time": "90 minutes",
    "skill": "* \n* (Trollheim Teleport, 96 strongly recommended for Spellbook Swap)\n*  recommended for shortcuts to Troll Stronghold",
    "item": "* Farming equipment:\n* Amulet of nature\n* Magic secateurs\n* Snapdragon seeds\n* Smoke/Mud/Steam/Lava staff with runes for teleportation and spells\n* Transportation recommendations:\n* Ectophial\n* Explorer's ring 3\n* Trollheim Teleport\n* Camelot Teleport or Catherby Teleport\n* Ardougne Teleport or Ardougne cloak 2/3/4\n* Xeric's Talisman, Tithe Farm minigame teleport or Kharedst's memoirs",
    "quest": "* Ghosts Ahoy\n* My Arm's Big Adventure\n* Making Friends With My Arm\n* Fairytale I - Growing Pains\n* Dream Mentor (optional)",
    "other": "Tool leprechaun with a seed dibber, a spade, a rake, and some Ultracompost",
    "input1": "Snapdragon seed",
    "input1num": "8",
    "input2": "Ultracompost",
    "input2num": "8",
    "output1": "Grimy snapdragon",
    "output1num": "70",
    "location": "Port Phasmatys, Falador, Catherby, Trollheim, Ardougne, Harmony Island, Hosidius, Weiss and Farming Guild herb patches",
    "category": "Farming",
    "details": "This guide assumes 8.8 herbs from each patch, thus 70.4 herbs. Your profit per hour may vary depending on the survival rate.\n\nFarming grimy snapdragon can be a very profitable way to spend a few minutes at a time. Magic secateurs help increase profits slightly due to the 10% boost to crop yield. Generally, good harvests yield 6-14 herbs, but the norm is five to eight herbs per patch, so players can expect an average of 7.5 herbs each patch. There is also a 10% chance herbs will succumb to disease and die.\n\nPlayers should have eight snapdragon seeds, some runes, and a means of teleportation. Then, players can start their herb run at any herb patch withdrawing any additional supplies needed from the tool leprechaun. If players have access to the Lunar Spellbook from Lunar Diplomacy, Fertile Soil (83 Magic) can be used in lieu of supercompost, but it will make the profit per patch, thus total. Also, Spellbook Swap can be used to access the standard spellbook and Trollheim Teleport, but it requires 96 Magic and Dream Mentor.\n\nAfter planting, a player can move onto the next patch in any order. An example of a herb run is provided below.\n*Use the Camelot Teleport and run east to the Catherby herb patch, or use the Catherby Teleport and run north to the patch.\n*Cast Ardougne Teleport and run north-east, or use the Ardougne cloak teleport to get to the patch instantly.\n*Empty the Ectophial to Port Phasmatys and run west of the undead farm to the patch.\n*Cast Trollheim Teleport and use the Agility shortcuts to the west continuing downhill and through an area filled with aggressive trolls and into Troll Stronghold. Run south through the stronghold and to a door in the south-west, and then go north to a ladder. Climb it to get to the patch.\n*Use the cabbage port option on the Explorer's ring to teleport to the patch south of Falador.\n*Use the Tithe Farm minigame teleport to teleport to the Hosidius patch.\n*Teleport to Weiss patch via Icy basalt.",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Farming toadflax",
    "image": "[[File:Farming herbs.gif]]",
    "activity time": "6",
    "recurrence time": "90 minutes",
    "skill": "* \n* (Trollheim Teleport, 96 strongly recommended for Spellbook Swap)\n*  recommended for shortcuts to Troll Stronghold",
    "item": "* Farming equipment:\n* Amulet of nature\n* Magic secateurs\n* Toadflax seeds\n* Smoke/Mud/Steam/Lava staff with runes for teleportation and spells\n* Transportation recommendations:\n* Ectophial\n* Explorer's ring 3\n* Trollheim Teleport\n* Camelot Teleport or Catherby Teleport\n* Ardougne Teleport or Ardougne cloak 2/3/4",
    "quest": "* Ghosts Ahoy\n* My Arm's Big Adventure\n* Fairytale I - Growing Pains\n* Dream Mentor (optional)",
    "other": "Tool leprechaun with a seed dibber, a spade, a rake, and some ultracompost",
    "input1": "Toadflax seed",
    "input1num": "8",
    "input2": "Ultracompost",
    "input2num": "8",
    "output1": "Grimy toadflax",
    "output1num": "70",
    "location": "Port Phasmatys, Falador, Catherby, Trollheim, Ardougne, Harmony Island, Hosidius, Weiss and Farming Guild herb patches",
    "category": "Farming",
    "details": "This guide assumes 8.8 herbs from each patch, thus 52 herbs. Your profit per hour may vary depending on the survival rate.\n\nFarming grimy toadflax can be a very profitable way to spend a few minutes at a time. Magic secateurs help increase profits slightly due to the 10% boost to crop yield. Generally, good harvests yield 5-14 herbs, but the norm is five to eight herbs per patch, so players can expect an average of 6.5 herbs each patch. There is also a 10% chance herbs will succumb to disease and die.\n\nPlayers should have five toadflax seeds, some runes, and a means of teleportation. Then, players can start their herb run at any herb patch withdrawing any additional supplies needed from the tool leprechaun. If players have access to the Lunar Spellbook from Lunar Diplomacy, Fertile Soil (83 Magic) can be used in lieu of ultracompost, but it will make the profit per patch, thus total. Also, Spellbook Swap can be used to access the standard spellbook and Trollheim Teleport, but it requires 96 Magic and Dream Mentor.\n\nAfter planting, a player can move onto the next patch in any order. An example of a herb run is provided below.\n*Use the Camelot Teleport and run east to the Catherby herb patch, or use the Catherby Teleport and run north to the patch.\n*Cast Ardougne Teleport and run north-east, or use the Ardougne cloak teleport to get to the patch instantly. Skills necklace to fishing guild then running east also works.\n*Empty the Ectophial to Port Phasmatys and run west of the undead farm to the patch. Fairy ring  and running north is also fast.\n*Cast Trollheim Teleport and use the Agility shortcuts to the west continuing downhill and through an area filled with aggressive trolls and into Troll Stronghold. Run south through the stronghold and to a door in the south-west, and then go north to a ladder. Climb it to get to the patch.\n*Use the cabbage port option on the Explorer's ring to teleport to the patch south of Falador.\n*Use the Tithe Farm minigame teleport to teleport to the Hosidius patch or travel to the Hosidius House Portal then run north. Alternatively, use a skills necklace to teleport to the Woodcutting Guild and run north-east, taking an agility shortcut across the river and straight to the Hosidius herb patch.\n*Teleport to Weiss patch via Icy basalt.",
    "input3": "Icy basalt",
    "input3num": "1",
    "input4": "Stony basalt",
    "input4num": "1",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Farming torstol",
    "image": "[[File:Farming herbs.gif]]",
    "activity time": "6",
    "recurrence time": "90 minutes",
    "skill": "* \n* (Trollheim Teleport, 96 strongly recommended for Spellbook Swap)\n*  recommended for shortcuts to Troll Stronghold\n*  needed to light the fire pit in Weiss",
    "item": "* Farming equipment:\n* Amulet of nature\n* Magic secateurs\n* Torstol seeds\n* Smoke/Mud/Steam/Lava staff with runes for teleportation and spells\n* Transportation recommendations:\n* Ectophial\n* Explorer's ring 3\n* Trollheim Teleport or Nexus with Stronghold roof teleport\n* Camelot Teleport or Catherby Teleport\n* Ardougne Teleport or Ardougne cloak 2/3/4\n* Xeric's Talisman (charged), Tithe Farm minigame teleport, or skills necklace\n* Icy basalt\n* Skills necklace or Fancy jewellery box in POH",
    "quest": "* Ghosts Ahoy\n* My Arm's Big Adventure\n* Making Friends with My Arm\n* Fairytale I - Growing Pains\n* Hard tier of the Fremennik Diary (recommended)\n* Hard tier of the Kourend Diary (recommended)\n* Kandarin Diary, the higher tier the better (recommended)\n* Dream Mentor (optional)",
    "other": "Tool leprechaun with a seed dibber, a spade, a rake, and some ultracompost",
    "input1": "Torstol seed",
    "input1num": "8",
    "input2": "Ultracompost",
    "input2num": "8",
    "output1": "Grimy torstol",
    "output1num": "72",
    "location": "Port Phasmatys, Falador, Catherby, Trollheim, Ardougne, Harmony Island, Hosidius, Weiss and Farming Guild herb patches",
    "category": "Farming",
    "details": "This guide assumes 9 herbs from each patch, thus 72 herbs. Your profit per hour may vary depending on the survival rate.\n\nFarming grimy torstol can be a very profitable way to spend a few minutes at a time. Magic secateurs help increase profits slightly due to the 10% boost to crop yield. Generally, good harvests yield 5-14 herbs, but the norm is five to eight herbs per patch, so players can expect an average of 6.5 herbs each patch. There is also a 10% chance herbs will succumb to disease and die.\n\nCompleting Kandarin Diary is very useful, since it increases herb yield on the Catherby herb patch: +5%, +10%, +15% for Medium, Hard and Elite respectively.\nCompleting Kourend & Kebos Diary increases Hosidius and Farming guild herb patch yield +5% and +10% for Hard and Elite diaries respectively. Having both elite diaries completed, player should be getting 2-3 additional herbs per Farming trip.\nHaving an Attas seed planted in the anima patch at the farming guild further increases herb yield, but it is yet unknown by how much.\n\nPlayers should have eight torstol seeds, some runes, and means of teleportation. Then, players can start their herb run at any herb patch, withdrawing any additional supplies needed from the tool leprechaun. If players have access to the Lunar Spellbook from Lunar Diplomacy, Fertile Soil (83 Magic) can be used in lieu of ultracompost, but it will make the profit per patch, thus total. Also, Spellbook Swap can be used to access the standard spellbook and Trollheim Teleport, but requires 96 Magic and Dream Mentor.\n\nAfter planting, a player can move onto the next patch in any order. An example of a herb run is provided below.\n*Use the Camelot Teleport and run east to the Catherby herb patch, or use the Catherby Teleport and run north to the patch.\n*Cast Ardougne Teleport and run north-east, or use the Ardougne cloak teleport to get to the patch instantly.\n*Empty the Ectophial to Port Phasmatys and run west of the undead farm to the patch.\n*Cast Trollheim Teleport and use the Agility shortcuts to the west continuing downhill and through an area filled with aggressive trolls and into Troll Stronghold. Run south through the stronghold and to a door in the south-west, and then go north to a ladder. Climb it to get to the patch. Alternatively, use a stony basalt to be teleported next to the shortcut up to the farming patch (requires completion of Making Friends with My Arm.\n*Use the cabbage port option on the Explorer's ring to teleport to the patch south of Falador.\n*Teleport to the Hosidius patch with Xeric's Talisman to Xeric's Glade, Tithe Farm minigame teleport, or skills necklace to woodcutting guild.\n*Teleport to Weiss patch with Icy basalt.\n*Teleport to Farming guild patch via Skills necklace or Fancy jewellery box in POH.",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Growing magic saplings",
    "category": "Processing",
    "activity time": "10",
    "recurrence time": "240 minutes",
    "input1": "Magic seed",
    "input1num": "200",
    "input2": "Filled plant pot",
    "input2num": "200",
    "input3": "Astral rune",
    "input3num": "8",
    "intensity": "Moderate",
    "item": "+ recommended Steam battlestaff Gardening trowel",
    "location": "Grand Exchange",
    "members": "Yes",
    "other": "Lunar Spellbook",
    "output1": "Magic sapling",
    "output1num": "200",
    "quest": "Dream Mentor",
    "skill": "needed for Dream Mentor, to unlock the spell \"Humidify\"",
    "details": "Magic saplings are used to train Farming. Because it is time consuming and gives little to no experience, planting the magic seeds in filled plant pots to grow saplings is often skipped in favour of buying the saplings directly from the Grand Exchange. This opens up an opportunity to grow magic saplings for profit. Like all methods involving large amounts of buying and selling, which require a relatively high capital to start, it is recommended to test the market by growing one sapling first to make sure it is profitable. This guide assumes all magic seeds are purchased on the Grand Exchange.\n\nTo plant the seeds in the pots, use one of them on the other with a gardening trowel in your inventory. This produces a seedling. When all the plant pots are filled with seeds, cast Humidify to water them. These watered seedlings will take approximately five minutes to turn into saplings, but this will happen even when banked. Repeating this process quickly will make around 1,700 saplings an hour.\n\nSaplings can also be watered with watering cans instead of Humidify, however this makes the process far more click-intensive and time-consuming.\n\nPlease note that magic seeds have a relatively low buying limit, so you may want to stock up on them beforehand, or grow several different trees at once. \nIt is especially recommended to put in low buy offers overnight and slow sell the finished saplings, as the margins are already small relative to the price of a magic seed, and the GE tax eats heavily into the profit anyway.\n\nOnce you've finished making the saplings, sell them on the Grand Exchange. Maximise your profit by buying one sapling instantly, and selling all of yours for slightly less than that.",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Managing Miscellania",
    "image": "Throne_of_Miscellania.png",
    "activity time": "2",
    "recurrence time": "1440 minutes",
    "skill": "Recommended for approval gaining: to cut Maple trees,  to rake flax and  to rake herb patch.",
    "item": "Rake and any axe",
    "quest": "Throne of Miscellania",
    "input1": "coins",
    "input1num": "75000",
    "input1value": "1",
    "output1": "Mahogany logs",
    "output1num": "223",
    "output2": "Coal",
    "output2num": "273",
    "location": "Miscellania",
    "category": "Collecting",
    "details": "After completing the quest Throne of Miscellania the citizens of Miscellania can be used to collect various resources. This costs 10% of the gold within the coffer daily, up to a maximum of . Advisor Ghrim acts as an interface for the coffer and resource management of Miscellania. Usually mahogany logs and coal yield highest profits. For more detailed information, see Managing Miscellania.",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Opening 15 herb boxes",
    "image": "Nightmare Zone lobby.png",
    "activity time": "2",
    "recurrence time": "1440 minutes",
    "skill": "For getting Nightmare Zone points, see this section.",
    "item": "15 Herb boxes",
    "quest": "See Nightmare Zone/Strategies.",
    "other": "142,500 Nightmare Zone points",
    "other benefits": "None except the experience gained when earning the Nightmare Zone points.",
    "input1": "Herb box",
    "input1num": "15",
    "input1value": "0",
    "input1note": "142,500 Nightmare Zone points",
    "output1": "Grimy guam leaf",
    "output2": "Grimy marrentill",
    "output3": "Grimy tarromin",
    "output4": "Grimy harralander",
    "output5": "Grimy ranarr weed",
    "output6": "Grimy irit leaf",
    "output7": "Grimy avantoe",
    "output8": "Grimy kwuarm",
    "output9": "Grimy cadantine",
    "output10": "Grimy lantadyme",
    "output11": "Grimy dwarf weed",
    "location": "Nightmare Zone",
    "category": "Minigame",
    "details": "After amassing a total of 142,500 Nightmare Zone points to purchase 15 herb boxes at 9,500 points each, opening a box yields an assortment of ten random grimy herbs. Players may only buy 15 boxes per day resetting at 00:00 UTC.",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Picking cactus spines",
    "image": "[[File:Cactus patch.png]]",
    "recurrence time": "75 minutes",
    "activity time": "1",
    "skill": "(higher recommended)",
    "quest": "None",
    "item": "Ring of dueling/amulet of glory, and skills necklace/Farming cape",
    "other": "Grown cactus in patch",
    "input1": "Cactus seed",
    "input1num": "2",
    "input1note": "(only needed once)",
    "output1": "Cactus spine",
    "output1num": "14",
    "location": "Al-Kharid, Farming Guild",
    "category": "Farming",
    "details": "Plant a cactus seed in the cactus patch in Al-Kharid, easiest travelled to using a ring of dueling, gnome glider or amulet of glory. The patch is found just north of the crafting shop. The seed takes about 9.3 hours to grow and once fully grown, it can be harvested for cactus spines. \n\nThere is also a cactus patch found in the eastern wing of the Farming Guild, using a skills Necklace or a Farming skillcape will grant you the quickest way of travel. \n(you can also plant your own Spirit Tree within the guild though you would need to have level 85 farming to access the advanced tier of the guild )\nNote that you need to have earned at least 45% favour with Hosidius.\n\nSpines can be harvested every 75 minutes. The minimum yield is always three, higher farming levels yield a higher average, but at 99 farming, the average is around ten spines.\n\nCactus spines are used to make weapon poison(+) and to pay farmers to care for yew trees. To get to the patch, simply use a ring of dueling or an amulet of glory to teleport to Al-Kharid. Pick the spines, possibly noting them with the tool leprechaun, and then bank them.\n\nThis method works well with other harvesting money-makers, such as picking papayas or coconuts. The 75 minute timer also makes it coincide well with herb-farming runs (which can be done every 80 minutes).",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Picking coconuts",
    "image": "Coconut.png",
    "activity time": "3",
    "recurrence time": "270 minutes",
    "quest": "The Grand Tree Started Mourning's End Part I",
    "item": "Teleport crystal",
    "other": "Fully grown Palm tree in fruit tree patches",
    "output1": "Coconut",
    "output1num": "36",
    "location": "Catherby, Brimhaven, Tree Gnome Stronghold, Tree Gnome Village, Lletya, and Farming Guild (85 Farming required) fruit tree patches",
    "category": "Farming",
    "details": "Coconuts grow on palm trees, and are used to make coconut milk, used in high-level Herblore, being the secondary ingredients used to make Weapon Poison++ and Antidote++. They're also used to pay farmers to look after magic trees. Once a palm tree has grown fully, it can be harvested repeatedly, with a coconut growing back every 45 minutes on average, for a maximum of six per palm tree.\n\nHarvesting trips are most efficient when the player has at the most, 4 items in their inventory, to minimise time spent running to the tool leprechauns to note coconuts. An efficient inventory setup includes a construction cape, farming cape, and a teleportation crystal. This way, the player only needs to use the noting function of the tool leprechaun once. Alternative methods to get to each fruit tree patch are provided below the most efficient route.\n\nMost efficient route:\nBegin the trip by using the construction cape to teleport to the Brimhaven house portal and run north, harvesting all 6 coconuts from the palm tree. Next, use a teleport crystal to teleport to Lletya. Harvest the palm tree and note 12 coconuts with the tool leprechaun located 2 tiles north of the tree. Then, use the farming cape to teleport to the Farming Guild. Run north into the advanced tier of the guild to harvest the palm tree. Next, cast Catherby Teleport and harvest the coconuts growing on the palm tree found on the east side of the shore. Then, teleport to your player-owned house and use the Spirit tree to teleport to the Gnome Stronghold. Harvest the palm tree to the east and return back to the Spirit tree, travelling finally to the Tree Gnome Village. Squeeze through the fence to the south-west and exit the maze quickly by following Elkoy. Travel south-west and harvest the coconuts of the final palm tree. \n\nAlternative methods:\n\nBrimhaven: Brimhaven teleport tablet, teleporting outside a player-owned house located in Brimhaven, charting a ship from Catherby, or using the Spirit Tree network to teleport to Brimhaven. \n\nFarming Guild: Skills necklace teleport, use of the Spirit Tree network to teleport to the Farming Guild, or fairy ring (code ). Note that the fruit tree patch is located in the advanced tier of the Farming Guild which requires 85 farming (boostable) to enter. This money-making method otherwise only requires 68 Farming, the skill level needed to plant and harvest palm trees.\n\nCatherby: Catherby teleport portal in a portal chamber, Catherby teleport using a Portal nexus, Camelot teleport, or Charter ship.\n\nGnome Stronghold: Royal seed pod teleport, use of a Spirit tree, Slayer ring teleport to Stronghold slayer cave, Achievement Diary Cape teleport to the Elder gnome child location, or use of a gnome glider to the Grand tree.\n\n\nAs this uses the same patches as papaya trees, it cannot be used at the same time as the picking papayas method. Whichever one is more profitable should be used.",
    "template": "mmgtable recurring"
  },
  {
    "activity": "Picking papayas",
    "image": "Papaya fruit detail.png",
    "activity time": "3",
    "recurrence time": "180 minutes",
    "quest": "The Grand Tree Started Mourning's End Part I",
    "item": "Teleport crystal",
    "other": "Fully grown Papaya tree in fruit tree patches",
    "output1": "Papaya fruit",
    "output1num": "36",
    "location": "Catherby, Brimhaven, Tree Gnome Stronghold, Tree Gnome Village, Lletya, and Farming Guild (85 Farming required) fruit tree patches",
    "category": "Farming",
    "details": "Papaya fruits grow on papaya trees, and are used to pay farmers to look after palm trees. Once a papaya tree has grown fully, it can be harvested repeatedly, with a papaya growing back every 30 minutes on average, for a maximum of six per papaya tree.\n\nHarvesting trips are most efficient when the player has at the most, 4 items in their inventory, to minimise time spent running to the tool leprechauns to note papayas. An efficient inventory setup includes a construction cape, farming cape, and a teleportation crystal. This way, the player only needs to use the noting function of the tool leprechaun once. Alternative methods to get to each fruit tree patch are provided below the most efficient route.\n\nMost efficient route:\nBegin the trip by using the construction cape to teleport to the Brimhaven house portal and run north, harvesting all 6 papayas from the papaya tree. Next, use a teleport crystal to teleport to Lletya. Harvest the papaya tree and note 12 papayas with the tool leprechaun located 2 tiles north of the tree. Then, use the farming cape to teleport to the Farming Guild. Run north into the advanced tier of the guild to harvest the papaya tree. Next, cast Catherby Teleport and harvest the papayas growing on the papaya tree found on the east side of the shore. Then, teleport to your player-owned house and use the Spirit tree to teleport to the Gnome Stronghold. Harvest the papaya tree to the east and return back to the Spirit tree, travelling finally to the Tree Gnome Village. Squeeze through the fence to the south-west and exit the maze quickly by following Elkoy. Travel south-west and harvest the papayas of the final papaya tree. \n\nAlternative methods:\n\nBrimhaven: Brimhaven teleport tablet, teleporting outside a player-owned house located in Brimhaven, charting a ship from Catherby, or using the Spirit Tree network to teleport to Brimhaven. \n\nFarming Guild: Skills necklace teleport, use of the Spirit Tree network to teleport to the Farming Guild, or fairy ring (code ). Note that the fruit tree patch is located in the advanced tier of the Farming Guild which requires 85 farming (boostable) to enter. This money-making method otherwise only requires 57 Farming, the skill level needed to plant and harvest papaya trees.\n\nCatherby: Catherby teleport portal in a portal chamber, Catherby teleport using a Portal nexus, Camelot teleport, or Charter ship.\n\nGnome Stronghold: Royal seed pod teleport, Slayer ring teleport to Stronghold slayer cave, Achievement Diary Cape teleport to the Elder gnome child location, or use of a gnome glider to the Grand tree.\n\n\nAs this uses the same patches as palm trees, it cannot be used at the same time as the picking coconuts method. Whichever one is more profitable should be used.",
    "template": "mmgtable recurring"
  }
]