[
  {
    "list": [
      "20 Coins (provided) if Prince Ali Rescue is not completed."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Empty cape slot"
    ],
    "recommended": "8 free inventory slots",
    "template": "needed"
  },
  {
    "list": [
      "Shears"
    ],
    "recommended": "Necklace of Passage, Lumbridge Teleport, Draynor Manor Teleport and Explorer's ring 2 or higher",
    "template": "needed"
  },
  {
    "recommended": "Food and combat equipment to defeat the level 168 Judge of Yama with melee.",
    "template": "needed"
  },
  {
    "list": [
      "Axe, runes to cast a fire spell higher than Fire Strike (Fire Bolt works)."
    ],
    "recommended": "Xeric's talisman or Kharedst's memoirs for quick transport around Kourend, games necklace, food and combat equipment to defeat a level 132 Assassin.",
    "template": "needed"
  },
  {
    "list": [
      "Weapon and armour to kill Xamphur, food and prayer potions."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Weapon and armour to kill a level 132 assassin"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Weapon and armour to kill a level 91 Barbarian Warlord."
    ],
    "template": "needed"
  },
  {
    "list": [
      "molten glass, dark essence block or a pickaxe and a chisel"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Defence potion (3 or more doses) and Volcanic sulphur"
    ],
    "recommended": "Games Necklace",
    "template": "needed"
  },
  {
    "list": [
      "Melee gear, food and potions, 1 free inventory space"
    ],
    "recommended": "Xeric's talisman, Kharedst's memoirs, Arceuus Library Teleport, Kourend Castle Teleport",
    "template": "needed"
  },
  {
    "list": [
      "Runes for fire bolt or better, any axe, combat equipment"
    ],
    "recommended": "Xeric's talisman or access to one, skills necklace, games necklace, Kharedst's memoirs, use of fairy rings",
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment melee or ranged (as Xamphur has high melee defence, ranged is the preferred method)"
    ],
    "recommended": "Xeric's talisman or access to one, anti-poison, Kharedst's memoirs, use of fairy rings, Arceuus Library Teleport",
    "template": "needed"
  },
  {
    "list": [
      "A defence potion with (3) or (4) doses, volcanic sulphur (face mask/slayer helmet/gas mask required to mine), combat equipment, molten glass, dark essence block (or any pickaxe), broken redirector"
    ],
    "recommended": "Lockpick, chisel, pickaxe, Battlefront teleports or Rada's blessing 3+, games necklace, Xeric's talisman, access to fairy rings, Rada's blessing 1+",
    "template": "needed"
  },
  {
    "list": [
      "Combat gear, some food, Ivandis flail or Blisterwood flail, Saw, one dose of anti-venom or two doses of antipoison, Drakan's medallion"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Ghostspeak amulet, any axe, items (armour, food, antipoison) to kill a level 302 Hespori, druid pouch recommended to protect food from ghasts"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Combat gear, some food, ivandis flail or blisterwood flail, Saw, one dose of anti-venom or two doses of antipoison"
    ],
    "recommended": "Ectophial for fast access to Port Phasmatys, Drakan's medallion, Super energy or Stamina potions",
    "template": "needed"
  },
  {
    "list": [
      "Ghostspeak amulet or Morytania legs 2+, any axe, equipment and food to kill a level 302 hespori"
    ],
    "recommended": "Dramen staff for fast travel to the Grotto, Super combat potion, Antipoison, Drakan's medallion, Druid pouch or a lit Fire of Dehumidification to protect food from ghasts",
    "template": "needed"
  },
  {
    "list": [
      "High-level combat gear of all styles, food, potions, etc. to do a Theatre of Blood raid if never completed one, optionally more party members if you have trouble alone"
    ],
    "template": "needed"
  },
  {
    "list": [
      "None"
    ],
    "recommended": "Amulet of glory, Explorer's ring 2 or above, stamina potion",
    "template": "needed"
  },
  {
    "list": [
      "Rope, Ned sells these for 18gp in his shop or 15 through dialogue in Draynor Village."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Reinforced goggles and combat equipment. (Optional: Knife or slash weapon, except abyssal whip and dragon claws)"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Sourhog foot"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Rope, knife or slash weapon (not a whip or claws), combat equipment (Sourhog is resistant to slash and magic)"
    ],
    "recommended": "Amulet of glory, Explorer's ring 2 or above, stamina potion",
    "template": "needed"
  },
  {
    "list": [
      "Sickle or Knife"
    ],
    "recommended": "Ectophial and 10,000 Coins for the fastest way to get to Ver Sinhaza; Pickaxe, Vyrewatch outfit.",
    "template": "needed"
  },
  {
    "recommended": "Ectophial and 10,000 Coins (to return to Ver Sinhaza, Pickaxe (to return to the Myreque hideout via the mines). As there will not be any bank nearby when you reach the next section of the quest, also consider bringing the recommended items for the next two sections: pestle and mortar, vial of water, knife or sickle, battle gear for shorter trip back to the hideout, weapon to fight a Combat Level 149 monster, super restore potion",
    "list": [
      "1,000 Coins"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Pestle and mortar, vial of water (both obtainable during quest) knife or sickle. battle gear for shorter trip back to hideout."
    ],
    "template": "needed"
  },
  {
    "list": [
      "A weapon, super restore and some food to fight a level 149 monster."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Rod of ivandis (you will get it back if you gave it to Veliaf at the end of In Aid of the Myreque), emerald, chisel; either 3 air runes and 1 cosmic rune or an Enchant emerald or jade tablet"
    ],
    "recommended": "Combat equipment",
    "template": "needed"
  },
  {
    "list": [
      "Camulet, big banana, eldritch ashes, fang, scarab dung, spade, bucket of water"
    ],
    "template": "needed"
  },
  {
    "list": [
      "A ghostspeak amulet and 20 ecto-tokens (or 4 bones, 4 empty pots and 4 empty buckets to obtain the ecto-tokens during the quest)"
    ],
    "template": "needed"
  },
  {
    "list": [
      "5 iron bars, a hammer and your two undead chickens."
    ],
    "recommended": "Quick-travel to Rimmington, such as a House Teleport",
    "template": "needed"
  },
  {
    "list": [
      "Mithril axe and a holy symbol."
    ],
    "recommended": "Games Necklace to teleport to Burthorpe",
    "template": "needed"
  },
  {
    "list": [
      "Hard leather and polished buttons."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Box trap, hammer"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Needle, jerboa tail"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Fishing bait or feathers"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Any standard bow made with logs, and one set of oak logs"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Any woodcutting axe, tinderbox or suitable bow"
    ],
    "recommended": "One-click teleport, food and armour to kill level 304 mithril dragons.",
    "template": "needed"
  },
  {
    "list": [
      "Any seed that can be planted with a seed dibber, 1 free Farming patch."
    ],
    "recommended": "A rake to clear any weeds on the patch.",
    "template": "needed"
  },
  {
    "list": [
      "A spade, any sapling, 1 free Farming patch."
    ],
    "recommended": "An axe or 200 coins to clear the required patch if it is occupied",
    "template": "needed"
  },
  {
    "list": [
      "two bars, two corresponding logs, and a hammer"
    ],
    "template": "needed"
  },
  {
    "list": [
      "a normal attack potion (2 doses), roe (can be obtained during Barbarian Fishing), and a knife"
    ],
    "template": "needed"
  },
  {
    "list": [
      "3 coins or a beer"
    ],
    "template": "needed"
  },
  {
    "list": [
      "knife, cooked meat and bread"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Some food for low combat players, and any pickaxe or a weapon and armour to kill a level 25 monster"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment, one empty inventory space"
    ],
    "recommended": "Stamina potion, Pharaoh's sceptre, a means to combat desert heat",
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment, coal, tinderbox, spade, iron bar"
    ],
    "recommended": "A means to cure/prevent poison and desert heat, food and a stamina potion",
    "template": "needed"
  },
  {
    "recommended": "Ranged combat gear, 4-6 stamina potions + 1 antipoison OR 6-8 strange fruits, prayer potions, antipoison, food",
    "template": "needed"
  },
  {
    "list": [
      "Raw beef or cooked meat"
    ],
    "recommended": "A means to combat desert heat",
    "template": "needed"
  },
  {
    "list": [
      "Melee armour, 2-3 prayer potions/super restores, a (super) combat potion, and an accurate melee weapon"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment, food, combat potions"
    ],
    "recommended": "Stamina potion, Pharaoh's sceptre, and means to combat desert heat",
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment, coal, tinderbox (obtainable), spade (obtainable), iron bar"
    ],
    "recommended": "A means to cure/prevent poison, protection from desert heat, Stamina potion and lots of food",
    "template": "needed"
  },
  {
    "list": [
      "Rusty key, Range combat equipment"
    ],
    "recommended": "Stamina potion, Pharaoh's sceptre, anti-poison, and means to combat desert heat",
    "template": "needed"
  },
  {
    "list": [
      "Raw beef or cooked meat (can be purchased)"
    ],
    "recommended": "A means to combat desert heat; teleports to Nardah and Sophanem",
    "template": "needed"
  },
  {
    "list": [
      "Melee combat equipment"
    ],
    "recommended": "Means to combat desert heat",
    "template": "needed"
  },
  {
    "list": [
      "Ring of charos (a) or 2 coins."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Any pickaxe, weapon to kill a scorpion."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Ammo mould, 1 gold bar."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Schematic, 3 gold bars, hammer."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Gold helmet, Schematic, Schematics, Base schematics."
    ],
    "recommended": "Camelot Teleport.",
    "template": "needed"
  },
  {
    "list": [
      "Gold helmet, Schematics, 2 coins, food, armour, your best wield-able pickaxe, 6 free inventory spaces."
    ],
    "recommended": "15 total free inventory spaces.",
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment to kill the level 13 Mourner."
    ],
    "template": "needed"
  },
  {
    "list": [
      "An iron chainbody, a bronze med helm, and a cabbage not from Draynor Manor."
    ],
    "template": "needed"
  },
  {
    "list": [
      "A bucket of water or ice gloves."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Ice Gloves or Bucket of water."
    ],
    "template": "needed"
  },
  {
    "list": [
      "10 oak planks, 10 steel nails, a hammer, and a spade."
    ],
    "recommended": "Dramen or Lunar staff (as well as a teleport to access the Fairy ring network), Ardougne teleport runes or Ardougne cloak 1 or higher (to get to Ardougne and start the quest).",
    "template": "needed"
  },
  {
    "list": [
      "A plank, a piece of silk, and a clockwork or a steel bar to make one (access to a crafting table 3 or better is also required. It must either be built by the player in their own player-owned house (also requiring the prerequisites to do so, those being having a workshop and crafting table 2 to upgrade) or one must be accessed in another player's house)."
    ],
    "template": "needed"
  },
  {
    "recommended": "To avoid unnecessary banking, bring a Dramen or Lunar staff and teleport runes to access the Fairy ring network (Alternative: Varrock/GE teleport runes to take the Kelda mine cart back to Larry), a raw cod or ring of charos (a), and multiple teleportations to Lumbridge.",
    "template": "needed"
  },
  {
    "list": [
      "Raw cod or ring of charos (a)."
    ],
    "recommended": "Teleportation methods to Lumbridge.",
    "template": "needed"
  },
  {
    "list": [
      "Swamp tar, five white feathers, (both can be obtained during this part, but the Swamp tar is some distance away), and the Mission Report."
    ],
    "template": "needed"
  },
  {
    "recommended": "Food (if low combat level level or at the minimum agility requirement for the quest)",
    "template": "needed"
  },
  {
    "list": [
      "Mahogany plank, Leather, cowbell."
    ],
    "recommended": "Combat equipment and food (if low level)",
    "template": "needed"
  },
  {
    "recommended": "Food, prayer potions and combat equipment to defeat a level 191 Giant Scarab.",
    "template": "needed"
  },
  {
    "list": [
      "vial, wool, mithril bar"
    ],
    "template": "needed"
  },
  {
    "list": [
      "banana, tin ore, wool, tiara, steel set (lg), onion, ashes"
    ],
    "template": "needed"
  },
  {
    "list": [
      "thread, tiara, iron arrow, ornate legs, trout"
    ],
    "template": "needed"
  },
  {
    "list": [
      "spade, staff, limpwurt root, chef's hat, chisel"
    ],
    "template": "needed"
  },
  {
    "list": [
      "body tiara, diamond amulet, bronze platebody, ornate legs, leather boots"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Tile, beer, trout, pot, sardine, potato, tiara"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Beer, banana"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Spade"
    ],
    "template": "needed"
  },
  {
    "list": [
      "x7 willow shortbow, x3 tiara mould"
    ],
    "template": "needed"
  },
  {
    "list": [
      "x3 kebab, x2 red bead, x1 needle, x1 spade, x1 pike, x1 sapphire, x1 big bones, x1 cake tin, x2 banana, x1 black bead"
    ],
    "template": "needed"
  },
  {
    "list": [
      "iron axe, uncooked berry pie, mithril scimitar"
    ],
    "template": "needed"
  },
  {
    "list": [
      "None"
    ],
    "template": "needed"
  },
  {
    "list": [
      "iron dagger, leather gloves, white apron"
    ],
    "template": "needed"
  },
  {
    "list": [
      "x3 of each: bronze chainbody, chisel, fire rune, iron battleaxe, steel arrow, uncut sapphire"
    ],
    "template": "needed"
  },
  {
    "list": [
      "x1 bucket, x1 blue wizard hat, x1 fire rune, x1 small fishing net, x3 staff, x1 steel med helm, x2 steel pickaxe"
    ],
    "template": "needed"
  },
  {
    "list": [
      "x1 tin ore, x2 logs, x3 eggs, x1 skull, x2 fur, x1 bowl, x1 coal"
    ],
    "template": "needed"
  },
  {
    "list": [
      "None"
    ],
    "template": "needed"
  },
  {
    "list": [
      "spade"
    ],
    "template": "needed"
  },
  {
    "list": [
      "x6 onions, x2 iron longswords, x732 coins"
    ],
    "template": "needed"
  },
  {
    "list": [
      "strength potion(2), wine of Zamorak, law rune, fish food, earth tiara, coal, logs"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Iron ore, rope, pie shell"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Ornate helm, grapes, feather, air tiara, law rune, needle, shears, spade"
    ],
    "template": "needed"
  },
  {
    "list": [
      "raw sardine, blue dye, pie shell, tin ore, raw rat meat, shrimps, purple dye, mind tiara, water rune, leather cowl, bowl, amulet of defence, poisoned fish food, spade, steel arrow, hammer, redberry pie, redberries, red bead, fire tiara, raw beef, fish food, iron chainbody, potato, chaos rune, emerald amulet, feather, steel scimitar"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Ghostspeak amulet, spade. (Armour, food, and a holy symbol is recommended for protection against Feral Vampyres and leeches.)"
    ],
    "template": "needed"
  },
  {
    "list": [
      "50 coins or runes for Telekinetic Grab."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Spade"
    ],
    "recommended": "some armour, food, weapon.",
    "template": "needed"
  },
  {
    "list": [
      "Ghostspeak amulet, decapitated head, pickled brain, arms, legs, torso, needle, 5 thread, 3 bronze wire, silver bar, hammer."
    ],
    "template": "needed"
  },
  {
    "list": [
      "2 planks, 8 nails and a hammer"
    ],
    "recommended": "Vyrewatch outfit or 1,950gp to purchase one once you get to the city (only if your Thieving or Hitpoints is low)",
    "template": "needed"
  },
  {
    "list": [
      "A knife or a sickle (knife can be acquired in the agility course)"
    ],
    "template": "needed"
  },
  {
    "list": [
      "A knife or a sickle"
    ],
    "recommended": "Any pickaxe (the strongest you can wield) and three free spaces for mining Daeyalt ores",
    "template": "needed"
  },
  {
    "list": [
      "4 free inventory spaces."
    ],
    "recommended": "Armour and food if you cannot use Protect from Melee.",
    "template": "needed"
  },
  {
    "list": [
      "Be on the normal spellbook. A knife or a sickle"
    ],
    "recommended": "Any pickaxe (the strongest you can wield) and three free spaces for mining Daeyalt ores",
    "template": "needed"
  },
  {
    "list": [
      "Asgarnian ale, 60+ coins"
    ],
    "recommended": "Blurberry special or Premade blurb' sp.",
    "template": "needed"
  },
  {
    "list": [
      "Iron bar and empty inventory slot. (If you need to drop an item to free up a space, drop the combination as you can receive another from Harold.)"
    ],
    "template": "needed"
  },
  {
    "list": [
      "10 loaves of bread, 10 cooked trout, combination, and Tenzing's spiked climbing boots"
    ],
    "template": "needed"
  },
  {
    "list": [
      "A pickaxe, light source (candles, torches and oil lamps will explode), tinderbox, rope (if entering from Lumbridge swamp), antipoison, and spiny helmet (if unfamiliar with Lumbridge Swamp Caves)"
    ],
    "template": "needed"
  },
  {
    "list": [
      "None"
    ],
    "recommended": "Lumberyard teleport, stamina potions, graceful set",
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment, 3 free inventory spaces"
    ],
    "recommended": "Varrock Teleports, Salve Amulet",
    "template": "needed"
  },
  {
    "list": [
      "Barronite deposit, chaos core, pickaxe, combat equipment"
    ],
    "recommended": "Mind Altar Teleport, Varrock Teleports",
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment, 3 free inventory spaces"
    ],
    "recommended": "Varrock Teleports",
    "template": "needed"
  },
  {
    "list": [
      "Barronite deposit and chaos core or a pickaxe and combat equipment"
    ],
    "recommended": "Mind Altar Teleport, Varrock Teleports",
    "template": "needed"
  },
  {
    "list": [
      "None"
    ],
    "recommended": "Stamina or super energy potions",
    "template": "needed"
  },
  {
    "list": [
      "3 empty inventory spaces, 1 gold coin."
    ],
    "template": "needed"
  },
  {
    "list": [
      "25 unnoted bones."
    ],
    "template": "needed"
  },
  {
    "list": [
      "bucket of water."
    ],
    "template": "needed"
  },
  {
    "recommended": "food and armour.",
    "template": "needed"
  },
  {
    "list": [
      "Two Shantay passes (or another method of entering the Kharidian Desert), 650 coins, blood rune, ashes, bones, charcoal, 6 molten glass (noted works), 12 magic logs (noted works), 6 steel bars (noted works)"
    ],
    "recommended": "Waterskins, desert clothing, coins for magic carpet rides (bring a ring of charos (a) for discounted rides), teleportation methods to the Exam Centre (digsite pendant, Varrock teleport) and Al-Kharid (ring of dueling, amulet of glory).",
    "template": "needed"
  },
  {
    "list": [
      "Shantay passes, waterskins, a tinderbox; a gas mask, face mask, or slayer helmet; two or more Energy potions or a stamina potion, ice gloves or water spell runes (staves do not work without ice gloves), prayer potions, a weapon (only if wearing ice gloves; otherwise your weapon will be unequipped), armour (Magic-defence armour or armour with Prayer bonus), food, and an emergency teleport."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Shantay passes, waterskins, 20&mdash;50+ lockpicks, noted lockpicks and 5 coins per to exchange at Tiles"
    ],
    "recommended": "Teleportation method to Rasolo (skills necklace to teleport to the Fishing Guild or Barbarian Assault grouping teleport), teleport method to Al Kharid (amulet of glory or ring of dueling), multiple antipoison, super restore if using melee, food. Additional noted supplies may be preferable.",
    "template": "needed"
  },
  {
    "list": [
      "Gilded cross"
    ],
    "recommended": "Combat equipment, prayer potions, runes to cast spells such as Entangle, stamina potions, and an emergency teleport.",
    "template": "needed"
  },
  {
    "list": [
      "Garlic powder (created by using your pestle and mortar with garlic), silver bar, spice."
    ],
    "recommended": "Good food (swordfish or better), 1-2 prayer potions, druid pouches, and a Draynor teleport method.",
    "template": "needed"
  },
  {
    "list": [
      "A sweet (cake, chocolate cake (partial cakes work), or chocolate bar), Spiked boots, a way to get to Troll child (Trollheim Teleport, climbing boots, or Ghommal's hilt 1+), several super restore, menaphite remedy or restore potions, equipment and supplies to kill 5 Ice trolls and Kamil (if using magic, runes for fire spells and be on the standard spellbook. Kamil is immune to all other spells, including Iban Blast and Flames of Zamorak)."
    ],
    "recommended": "Several prayer potions, good food (lobsters or better), and an emergency one-click teleport that doesn't have a Magic requirement, such as the Ectophial or a magic tablet.",
    "template": "needed"
  },
  {
    "list": [
      "Shantay passes, waterskins, blood diamond, ice diamond, smoke diamond, shadow diamond, coins for magic carpet rides (bring a ring of charos (a) for discounted rides)"
    ],
    "recommended": "Weight-reducing equipment such as graceful clothing, prayer boosting equipment, 2+ prayer potions, 1 super antipoison (or some strange fruit), several energy potions or 1 stamina potion, food (summer pies recommended), and an emergency teleport, 80,000 coins if buying Ancient Staff.",
    "template": "needed"
  },
  {
    "list": [
      "Combat gear, a pickaxe (a bronze one is provided), rope, and runes to cast the four burst spells (or better)."
    ],
    "recommended": "Runes for Senntisten Teleport, Digsite teleports, stamina potions, Dramen staff, desert amulet/Nardah teleport, protection from desert heat.",
    "template": "needed"
  },
  {
    "list": [
      "Melee combat gear(slash weapon), food, a way to restore Prayer, two free inventory spaces, and a hammer."
    ],
    "recommended": "Stamina potion, runes for ice spells, coins for the Lovakengj Minecart Network, Xeric's talisman, lockpick for the Stone chest.",
    "template": "needed"
  },
  {
    "recommended": "Ranged gear, food, potions, Prayer restores, anti-venom, stamina potion.",
    "template": "needed"
  },
  {
    "list": [
      "Combat gear, slayer helmet or facemask."
    ],
    "recommended": "Stamina potion, amulet of the eye.",
    "template": "needed"
  },
  {
    "list": [
      "Melee combat gear, food, combat potions for lower levels, and a method of restoring 50 or so Prayer points."
    ],
    "recommended": "Icy basalt, stamina potion, three or more free inventory spaces.",
    "template": "needed"
  },
  {
    "list": [
      "Combat gear (preferably magic), ring of visibility, food and potions."
    ],
    "recommended": "Runes or tablets for Mind altar or Lassar teleports, stamina potion, at least 8 free inventory spaces.",
    "template": "needed"
  },
  {
    "list": [
      "Gear for two combat styles (Ranged and Melee recommended)"
    ],
    "recommended": "Food and a prayer potion, as well as any stat-boosting potions desired. Players returning to the quarry will benefit from an Amulet of Glory to teleport to Al Kharid, and 5 coins to buy a Shantay Pass after taking the boat to Unkah.",
    "template": "needed"
  },
  {
    "recommended": "Melee equipment with high ranged defence, ranged weapon swap, knives/darts, antipoison, Prayer potions, food, combat boosting potions (preferable to pre-pot then run to the fight).",
    "template": "needed"
  },
  {
    "list": [
      "Melee combat gear, a pickaxe (a bronze one is provided), and runes to cast the four burst spells (or better)"
    ],
    "recommended": "Senntisten Teleport x1, stamina potion x2, Dramen staff, desert amulet, or Nardah teleport x1, Digsite teleport or Digsite pendant x1, and a Circlet of water / waterskins or other protection from desert heat.",
    "template": "needed"
  },
  {
    "list": [
      "Magic gear (freeze Strangleds), Melee gear, slash weapon, range gear."
    ],
    "recommended": "Xeric's talisman, freezes, Food, Prayer Potion, Stamina potions, Lockpick, Hammer, Dramen Staff, and 2 free inventory spaces.",
    "template": "needed"
  },
  {
    "list": [
      "Combat gear, Slayer helmet or Facemask, Tinderbox, Food and Potions to kill a few enemies: Greater demons lvl 92, Abyssal walkers lvl 109, Black demons lvl 176."
    ],
    "recommended": "1 – 2 Stamina potions for each scar.",
    "template": "needed"
  },
  {
    "list": [
      "Food and combat gear, Ranged equipment, runes to cast Shadow spells, access to Ancient Magicks."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Melee combat gear, food, combat potions for lower levels, and a method of restoring at least 50 or so Prayer points."
    ],
    "recommended": "Icy basalt x1, stamina potion x2, and three or more free inventory spaces.",
    "template": "needed"
  },
  {
    "list": [
      "Combat gear (preferably mage equipment), Ring of visibility, Foods and Potions."
    ],
    "recommended": "Runes for Lassar teleport, Mind altar teleport or Combat bracelet for monastery teleport, 1 stamina potion, and at least 8 free inventory slots.",
    "template": "needed"
  },
  {
    "list": [
      "Gear for two combat styles, darts"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Pickaxe (Can be obtained during quest)"
    ],
    "recommended": "Amulet of glory, 600 coins (to travel to Corsair Cove on a charter ship), Digsite pendant, weapons and armour",
    "template": "needed"
  },
  {
    "list": [
      "None."
    ],
    "recommended": "7+ free inventory spaces. Optional: 24 free inventory spaces will minimise walking.",
    "template": "needed"
  },
  {
    "list": [
      "A hammer, saw, 8 oak planks, 10 swamp paste, 12+ nails of any kind (bring more to be safe)."
    ],
    "recommended": "Digsite pendant.",
    "template": "needed"
  },
  {
    "list": [
      "Catspeak amulet, Teleports or runes: Nardah teleport, Desert amulet 2, Seal of Passage, Pollnivneach teleport and coins for the magic carpet, enchanted lyre, Fremennik sea boots, or Rellekka teleport."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Seal of passage, tinderbox, goutweed, 1 astral rune, hammer, pestle and mortar, fighting equipment (good ranged defensive armour and food) Note: Ranged attacks are ineffective. 100,000 coins and teleport to Lunar Isle per death (recommended for safety)."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Axe and machete if below 79 Agility"
    ],
    "recommended": "Food, energy restoration (stamina potions and Saradomin brews recommended), and prayer potions",
    "template": "needed"
  },
  {
    "list": [
      "Spade, ghostspeak amulet, glassblowing pipe, cut dragonstone, 2 molten glass, chisel"
    ],
    "recommended": "Teleports to Varrock, Port Phasmatys, Draynor Manor, and Mort Myre Swamp, Dramen or Lunar staff, and food (Saradomin brews or druid pouches recommended if the fire of dehumidification has not been built)",
    "template": "needed"
  },
  {
    "list": [
      "Melee or ranging equipment, two types of dragonfire protection, venom protection, food, prayer potions"
    ],
    "recommended": "Salve amulet (ei), runes for Crumble Undead, a divine super combat potion or divine bastion potion, 100,000 coins and a teleport to Rellekka in the bank to reclaim items from Torfinn if you die",
    "template": "needed"
  },
  {
    "list": [
      "Magic and Ranged protective armour, food, prayer potions, a light source, a tinderbox and a dramen staff (recommended)."
    ],
    "template": "needed"
  },
  {
    "list": [
      "All four key pieces, hammer or imcando hammer, ancient key, runes for 3 Fire Wave or 3 Fire Surge spells, dragonfire protection."
    ],
    "recommended": "Food, armour, anti-dragon shield or dragonfire shield AND antifire potion, Barbarian Outpost teleport, stamina potion, Digsite pendant",
    "template": "needed"
  },
  {
    "list": [
      ""
    ],
    "recommended": "Ardougne teleport, Varrock teleport x2, Falador teleport, transportation to Rellekka",
    "template": "needed"
  },
  {
    "list": [
      "4 free inventory spaces, dragonfire protection, combat gear, plenty of food."
    ],
    "recommended": "Antidote++, ranged gear, toxic blowpipe, 2 super antifire potion, stamina potion, insulated boots, summer pie or agility potion.",
    "template": "needed"
  },
  {
    "recommended": "Ruby dragon bolts (e) or Ruby bolts (e), Diamond bolts (e), Stamina potion, Extended antifire potion, Anti-dragon shield or better, an emergency teleport, Ranging potion, the remaining slots should be filled with Super restores (or Menaphite Remedy) and Saradomin brews in 1:3 ratio. Note: The effects of super antifire potion do not work against Galvek's special attacks. Galvek is also immune to Ring of recoil's effect.",
    "template": "needed"
  },
  {
    "list": [
      "3 kinds of food (6-7 of each, or log in and out 21 times) and a Seal of passage"
    ],
    "recommended": "Runes for casting NPC Contact (air, cosmic, and astral)",
    "template": "needed"
  },
  {
    "recommended": "Food (lower levels) and a skills necklace.",
    "template": "needed"
  },
  {
    "recommended": "A Falador teleport (tablet)/amulet of glory/combat bracelet and a Camelot teleport (tablet)/Ardougne teleport (tablet)/skills necklace.",
    "template": "needed"
  },
  {
    "list": [
      "10 eagle feathers, swamp tar, a yellow dye, and 50 coins."
    ],
    "template": "needed"
  },
  {
    "list": [
      "A pickaxe, chisel."
    ],
    "template": "needed"
  },
  {
    "list": [
      "A pickaxe, chisel."
    ],
    "recommended": "8 Inventory slots if mining granite pieces including an extra for King's Ransom, otherwise 7. An Elemental staff to save inventory space.",
    "template": "needed"
  },
  {
    "list": [
      "A chisel, 8 Inventory slots."
    ],
    "template": "needed"
  },
  {
    "list": [
      "A chisel, soft clay, 5kg granite piece, the stone head, bread, runes to cast Fire bolt, Wind bolt, Blast or Wave, Tinderbox, Logs, Oak logs, Willow logs, Maple logs, Candle, Coal."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Runes for Crumble undead, chisel."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Dramen staff or Lunar staff"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Dramen staff or Lunar staff"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Dramen or Lunar staff, Nuff's certificate"
    ],
    "recommended": "Armour, weapons, food and restore potions to kill Goraks",
    "template": "needed"
  },
  {
    "list": [
      "Dramen or Lunar staff, Nuff's certificate, star flower, gorak claw, pestle and mortar, vial of water"
    ],
    "template": "needed"
  },
  {
    "list": [
      ""
    ],
    "recommended": "Fast travel methods to farm patches around Asgarnia and Misthalin.",
    "template": "needed"
  },
  {
    "list": [
      "Dramen staff."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Spade and the symptoms list"
    ],
    "recommended": "Falador teleport and a skills necklace",
    "template": "needed"
  },
  {
    "list": [
      "Three assigned items from the list below, secateurs, and the amulet of ghostspeak"
    ],
    "recommended": "Mort'ton teleport",
    "template": "needed"
  },
  {
    "list": [
      "Dramen staff and the magic secateurs"
    ],
    "template": "needed"
  },
  {
    "list": [
      "None."
    ],
    "template": "needed"
  },
  {
    "list": [
      "dramen staff or Lunar staff, and one free inventory space."
    ],
    "template": "needed"
  },
  {
    "list": [
      "3 assigned items (see link), secateurs, Ghostspeak amulet, Draynor skull (or spade to dig one)"
    ],
    "recommended": "Salve graveyard teleport, a filled druid pouch (so items that may be rotten by ghasts are protected)",
    "template": "needed"
  },
  {
    "list": [
      "dramen staff, magic secateurs, food, and armour."
    ],
    "template": "needed"
  },
  {
    "recommended": "A Camelot/Catherby Teleport to move onto the next section quickly.",
    "template": "needed"
  },
  {
    "list": [
      "Shrimps, bass, salmon, tuna and a swordfish (all cooked)."
    ],
    "template": "needed"
  },
  {
    "list": [
      "necklace mould, ring mould, any pickaxe, 2 cut rubies, food (optional), armour (optional), a method to get to Falador and Ardougne (optional but will save running) and a Mining boost (if boosting)."
    ],
    "template": "needed"
  },
  {
    "list": [
      "An antipoison potion, runes and Wizard's mind bomb/magic potion (if boosting). Combat equipment for the battle with Chronozon."
    ],
    "recommended": "An amulet of glory for quick access to the Edgeville Dungeon from Jolly Boar Inn.",
    "template": "needed"
  },
  {
    "list": [
      "5 coins"
    ],
    "template": "needed"
  },
  {
    "list": [
      "A spade"
    ],
    "template": "needed"
  },
  {
    "list": [
      "A fishing pass, fishing rod, garlic, 10 coins, and 1 red vine worm"
    ],
    "template": "needed"
  },
  {
    "list": [
      "100 coins."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Seasoned sardine OR raw sardine and doogle leaves, and a bucket of milk."
    ],
    "recommended": "Lumberyard teleport and Varrock teleport. An axe to complete an easy Varrock Diary task.",
    "template": "needed"
  },
  {
    "list": [
      "Pot of flour"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Soft clay, knife, bear fur, needle, thread, red dye, hammer, saw, two planks, six nails of any kind"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Pot of flour"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Soft clay, knife, bear fur, needle, thread, red dye, hammer, saw, two planks, six nails of any kind"
    ],
    "template": "needed"
  },
  {
    "list": [
      "boost for Thieving if below level 58, boost for Agility if below level 59."
    ],
    "template": "needed"
  },
  {
    "list": [
      "leather gloves (optional), 2 tarromin potions (unf) or 2 tarromins and 2 vials of water, door key, boost for Herblore if below level 52."
    ],
    "template": "needed"
  },
  {
    "list": [
      "a seed dibber, a watering can (with at least 1 dose), Rupert's helmet and equipment to fight Glod. Also, bank your follower if you have one out, you won't be able to have it in your inventory either."
    ],
    "template": "needed"
  },
  {
    "list": [
      "the other shrinking potion, any axe, boost for Woodcutting if below level 71."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Leather gloves (optional), 2 tarromin potions (unf), door key from Witch's House, 3 free inventory spaces"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment, any woodcutting axe, a seed dibber, a watering can, Rupert's helmet and a shrink potion."
    ],
    "template": "needed"
  },
  {
    "recommended": "Camelot teleport, charged amulet of glory for quick travel to Draynor Village/Draynor manor teleport tablet. You can also use the minigame teleport to Pest Control (40 Combat required), and take the boat back to Port Sarim saving time if you do not own a glory. The Explorer's ring 2 is also a quick option. Remember not to take any weapons or armour.",
    "template": "needed"
  },
  {
    "list": [
      "Excalibur, magic whistle"
    ],
    "recommended": "Camelot teleport, food, a weapon, and armour. A halberd gives Melee users the ability to defeat the titan without suffering damage. Bring anti-poison if you're under level 41 Combat. 1600gp/30gp/480gp if travelling from Port Sarim to Brimhaven/Karamja or Catherby to Brimhaven or Amulet of Glory.",
    "template": "needed"
  },
  {
    "list": [
      "Both magic whistles."
    ],
    "recommended": "Falador teleport, Camelot teleport, and Ardougne teleport or fairy rings teleport. Bring antipoison if under combat level 41.",
    "template": "needed"
  },
  {
    "list": [
      "2 magic whistles, Falador teleport"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Waterskin (4), tinderbox and a cat (or kitten)."
    ],
    "template": "needed"
  },
  {
    "recommended": "Several stamina potion or super energy and some food.",
    "template": "needed"
  },
  {
    "list": [
      "A cat."
    ],
    "template": "needed"
  },
  {
    "list": [
      "A cat, combat equipment."
    ],
    "recommended": "Several stamina potion or super energy and some food.",
    "template": "needed"
  },
  {
    "list": [
      "Bucket of sap, pile of salt or bag of salt, linen, willow logs."
    ],
    "template": "needed"
  },
  {
    "list": [
      "A cat, combat equipment."
    ],
    "recommended": "Several stamina potion or super energy and some food.",
    "template": "needed"
  },
  {
    "list": [
      "food you don't mind losing (1 piece of food is required to enter Burgh de Rott for the first time) (5 pieces is recommended if running past ghasts, or 1 piece of food with full druid pouches), a hammer, a pickaxe, a spade, 1-5 buckets, 6 planks, 44 nails. Keep at least 6 inventory spaces semi-free. If you have completed Shades of Mort'ton you can get the hammer and planks from the Mort'ton builder shop."
    ],
    "template": "needed"
  },
  {
    "list": [
      "A hammer, 5 planks, 2 swamp paste, 20 nails."
    ],
    "template": "needed"
  },
  {
    "list": [
      "a hammer, 2 steel bars, 1 piece of coal, 1 tinderbox, Efaritay's aid or a silver weapon such as the Silver sickle (b), and some food for lower-levelled players."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Armour, food, 10 coins if taking the swamp boat back to Canifis, and a weapon to kill the vampyres. The blessed silver sickle has no attack stats, so it is recommended to use the Wolfbane dagger from Priest in Peril, Blessed axe from Animal Magnetism or a demonbane weapon such as Silverlight or Darklight. Players may also choose to use an Efaritay's aid to damage the vampyres with any weapon."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Hammer, soft clay, mithril bar, silver bar, 1 water rune (or water staff), 1 cosmic rune (make sure you have the normal spellbook activated for lvl-1 Enchant), a cut sapphire, and a rope."
    ],
    "recommended": "Ectophial, Amulet of glory, Dramen Staff, or Mort'ton teleport''",
    "template": "needed"
  },
  {
    "list": [
      "At least 1 piece of food you don't mind losing (5 pieces is recommended if running past ghasts without a druid pouch), a pickaxe, a spade, 1-5 buckets, a hammer, 44 nails, 11 planks, 1 swamp paste, 3 tinderboxes, 10 bronze axes, 10 raw mackerels or 10 snails (depending on what is asked). If Shades of Mort'ton has been completed, a hammer, planks, and swamp paste can be purchased from Razmire Builders Merchants in Mort'ton and the tinderboxes, axes, and mackerels/snails can be brought noted then sold to Razmire General Store to unnote them. If using this trick make sure you bring extra gold for the buy back process and to do it fast as the quantities deteriorate if you do not. You cannot use the general store trick as an ironman.''"
    ],
    "recommended": "Mort'ton teleport or fairy ring",
    "template": "needed"
  },
  {
    "list": [
      "Hammer, tinderbox, 2 steel bars, 1 coal, Efaritay's aid or a silver weaponry such as a silver sickle (b), and some food for lower-levelled players."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment, including silver weaponry or Efaritay's aid to defeat 2 level 75 or 4 level 50 Vampyre Juvinates. Deposit any followers you have into your bank as Ivan Strom will refuse to leave if you have one, even in your inventory.''"
    ],
    "recommended": "To give to Ivan Strom: Steel med helm, Steel chainbody, Steel platelegs, Silver sickle, 15 pieces of cooked food (snail, salmon, slimy eel, or stew)",
    "template": "needed"
  },
  {
    "list": [
      "Hammer, soft clay, mithril bar, silver bar, a water rune or staff, a cosmic rune, a cut sapphire, and a rope."
    ],
    "recommended": "Teleports to a furnace and back to Burgh de Rott",
    "template": "needed"
  },
  {
    "list": [
      "Criminal's thread"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Bronze med helm, Iron chainbody, Animate rock scroll, Granite (any size), Black full helmet, Black platebody, Black platelegs/skirt, Holy Grail"
    ],
    "recommended": "Ardougne tab, Mind altar tab, Camelot tab",
    "template": "needed"
  },
  {
    "recommended": "Light source",
    "template": "needed"
  },
  {
    "recommended": "Dorgesh-kaan sphere, skills necklace",
    "template": "needed"
  },
  {
    "list": [
      "Toadflax potion (unf), pharmakos berries, goblin mail, black dye, don't bring any armour for this part because you will need to unequip it"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Fishing rod, raw slimy eel, 5 coins, blue dye, orange dye, purple dye, yellow dye, black goblin mail, goblin potion, combat equipment for the next section"
    ],
    "recommended": "Two teleports to Draynor Village",
    "template": "needed"
  },
  {
    "list": [
      "Light source"
    ],
    "recommended": "Dorgesh-kaan sphere, Dramen or lunar staff if players have access to the fairy rings",
    "template": "needed"
  },
  {
    "list": [
      "Light source, no pets following the player"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Toadflax potion (unf)"
    ],
    "recommended": "Skills necklace, enough inventory space to unequip all of your items.",
    "template": "needed"
  },
  {
    "list": [
      "No pets following the player or in your inventory, Goblin potion, black dye (or a black mushroom, an empty vial and a pestle and mortar), goblin mail (obtainable during quest)"
    ],
    "recommended": "Enough inventory space to unequip your gear, Dorgesh-kaan sphere",
    "template": "needed"
  },
  {
    "list": [
      "Fishing rod, raw slimy eel, 5 coins, blue dye, orange dye, purple dye, yellow dye, black goblin mail, goblin potion, black key from previous section, combat equipment for the next section"
    ],
    "recommended": "Two teleports to Draynor Village, Combat Bracelet for Ranging Guild teleport",
    "template": "needed"
  },
  {
    "list": [
      "A light source"
    ],
    "recommended": "Dorgesh-kaan sphere or a dramen or lunar staff (with Fairytale II - Cure a Queen started to the point of unlocking fairy rings)",
    "template": "needed"
  },
  {
    "list": [
      "Tinderbox, Bullseye lantern (or swamp tar)"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Guam leaf, Marrentill, Pestle and mortar, Suqah tooth"
    ],
    "recommended": "Combat equipment to kill Suqahs if you do not already have the tooth",
    "template": "needed"
  },
  {
    "list": [
      "Dramen staff (will turn into a lunar staff - bring several if you want multiple lunar staves), necessary items to access all four (air, fire, water, and earth) elemental rune altars (either the corresponding talismans or tiaras, an elemental talisman, access to the Abyss, or Guardians of the Rift minigame)."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Seal of passage, 400 coins, Pickaxe, Hammer, Needle, 2 pieces of Thread, 4 Suqah hide, Tinderbox, Spade"
    ],
    "recommended": "Combat equipment to kill several Suqah.",
    "template": "needed"
  },
  {
    "list": [
      "Seal of passage, all 9 pieces of lunar equipment, tinderbox, soaked kindling."
    ],
    "recommended": "Food, an axe, runes to cast combat spells (without use of an elemental staff), an Agility boost such as a Summer pie if your Agility level is low.",
    "template": "needed"
  },
  {
    "list": [
      "Tinderbox, Bullseye lantern (one that you can light)"
    ],
    "recommended": "House teleport tablet or runes.",
    "template": "needed"
  },
  {
    "list": [
      "Guam leaf, marrentill, a pestle and mortar, seal of passage, and combat equipment and food for Suqah. There is a bank available on the island."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Dramen staff, (air, fire, water, and earth talisman) or (air, fire, water, and earth tiara) or (elemental talisman) or access to the Abyss."
    ],
    "recommended": "Amulet of glory or ring of dueling (if using the abyss)",
    "template": "needed"
  },
  {
    "list": [
      "600 coins, Seal of passage, a pickaxe, hammer, a needle, 2 thread, a spade, 4 Suqah hide, and combat equipment and food for Suqah"
    ],
    "recommended": "Amulet of glory or ring of dueling (if using the abyss), runes for Superheat Item",
    "template": "needed"
  },
  {
    "list": [
      "Tinderbox, axe (optional), Seal of passage, kindling, lunar gear, Waking sleep vial, combat spells to fight Me (level 79), food (recommended)"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Slash weapon or knife if using Edgeville or Ardougne lever"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Item to cut web outside of Mage Arena bank, such as knife, slash weapon or any Wilderness sword."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Enchanted symbol, energy potions such as stamina, food, item to cut web"
    ],
    "recommended": "Teleport item such as amulet of glory, an antipoison.",
    "template": "needed"
  },
  {
    "list": [
      "Enchanted symbol, god staff, runes for 50+ casts of a god spell ([[File:Blood rune.png]] blood runes, [[File:Fire rune.png]] fire runes, [[File:Air rune.png]] air runes), food, restore potions, energy potions such as stamina, item to cut web"
    ],
    "recommended": "Teleport item such as amulet of glory, an antipoison potion if near poison spiders.",
    "template": "needed"
  },
  {
    "list": [
      "Ranged equipment, bucket of water"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Spade."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Ghostspeak amulet, Sapphire amulet."
    ],
    "recommended": "Ectophial (If Ghosts Ahoy has been completed.)",
    "template": "needed"
  },
  {
    "list": [
      "Gold bar, Ball of wool and 2 empty inventory spaces."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Monkey dentures, M'amulet mould, Ball of Wool, and Gold bar"
    ],
    "recommended": "Good food, prayer potions, antipoison, and stamina potion or energy potions",
    "template": "needed"
  },
  {
    "list": [
      "Monkey bones or corpse, monkey talisman. (Bring extra monkey bones and monkey talismans if planning to do Freeing King Awowogei section of Recipe for Disaster)"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Karamjan monkey greegree, M'speak amulet, at least one empty inventory slot"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment, 10th squad sigil"
    ],
    "recommended": "Teleportation, prayer potions and high healing food are highly recommended",
    "template": "needed"
  },
  {
    "list": [
      "3 inventory spaces, a lemon, grapes, pestle and mortar, translation book (Monkey Madness I or obtained from King Narnode), no weapons or armour."
    ],
    "recommended": "Magic logs, normal logs (for flying to Entrana and back). Note: You need to have opened the Balloon Transport to Gnome Stronghold before you can start.",
    "template": "needed"
  },
  {
    "list": [
      "Pickaxe, m'speak amulet, monkey talisman, ninja monkey greegree or ancient gorilla greegree, light source, slash weapon. Note: The pickaxe and slash weapon are not required for the Agility route."
    ],
    "recommended": "Food, antipoison, one-click teleport, combat equipment, super combat, stamina, and prayer potions.",
    "template": "needed"
  },
  {
    "list": [
      "A slash weapon to break webs and a pickaxe to clear rocks."
    ],
    "recommended": "Good tanking equipment",
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment to kill Kruk."
    ],
    "recommended": "Food, prayer potions, and an emergency teleport.",
    "template": "needed"
  },
  {
    "list": [
      "Weapon, armour to kill Kob and Keef, and 20 coins (unless the player has 71 Agility)."
    ],
    "recommended": "Trollheim teleport or stony basalt, ring of dueling, Yanille or Castle Wars teleports for fast access to Gu'Tanoth, some food.",
    "template": "needed"
  },
  {
    "list": [
      "Kruk greegree and M'speak amulet."
    ],
    "recommended": "Ape atoll teleport, weight-reducing clothing, energy, super energy, or stamina potions, hammer, chisel, food.",
    "template": "needed"
  },
  {
    "list": [
      "Weapon and armour in two combat styles to defeat tortured and demonic gorillas."
    ],
    "recommended": "Food, prayer potions, and an emergency teleport.",
    "template": "needed"
  },
  {
    "list": [
      "Weapon and armour to fight Glough, food and prayer potions."
    ],
    "recommended": "An emergency teleport.",
    "template": "needed"
  },
  {
    "list": [
      "rope, plank"
    ],
    "recommended": "staff, Camelot Teleport",
    "template": "needed"
  },
  {
    "list": [
      "A pickaxe"
    ],
    "template": "needed"
  },
  {
    "list": [
      "A pair of gloves"
    ],
    "recommended": "A ring of dueling or a Camelot Teleport",
    "template": "needed"
  },
  {
    "list": [
      "An axe, combat equipment, a staff (or pole found by Jokul), and a plank"
    ],
    "template": "needed"
  },
  {
    "list": [
      "5 muddy rocks, a staff (or pole found by Jokul), and a plank"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Bucket of water, 2 silk, bear fur and 7 empty inventory spaces."
    ],
    "recommended": "Weapon, food (if low combat stats), necklace of passage, ring of dueling, Fast travel to Taverley (House teleport, Balloon network, Falador teleport), and a teleport crystal",
    "template": "needed"
  },
  {
    "list": [
      "Mourner letter, the full mourner gear, feather, magic logs, leather and toad crunchies or premade t'd crunch."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Fixed device, red dye, blue dye, yellow dye, green dye and an ogre bellows."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Full mourner gear and a barrel of naphtha (or at least 10 coal to make the barrel)."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Full mourner gear, barrel of naphtha, apple barrel and the sieve."
    ],
    "recommended": "Teleport crystal.",
    "template": "needed"
  },
  {
    "list": [
      "A bucket of water, bloody mourner top"
    ],
    "recommended": "teleportation method to Taverley and to a bank",
    "template": "needed"
  },
  {
    "list": [
      "2 pieces of silk, bear fur, mourner trousers, coins (if you need dyes), teleport crystal"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Mourner outfit, mourner letter, feather, soft leather, magic log, toad crunchies or premade t'd crunch, 2 free inventory spaces"
    ],
    "recommended": "West Ardougne Teleport, or East Ardougne Teleport and walk west; alternatively, use the Edgeville Wilderness teleport lever to reach Ardougne",
    "template": "needed"
  },
  {
    "list": [
      "at least 1 red, green, blue, and yellow dye; ogre bellows; fixed device"
    ],
    "recommended": "West Ardougne Teleport, or East Ardougne Teleport and walk west; alternatively, use the Edgeville Wilderness teleport lever to reach Ardougne",
    "template": "needed"
  },
  {
    "list": [
      "Full mourner gear, chisel."
    ],
    "recommended": "Elf teleport crystal, teleport to Ardougne, food and armour/prayer potions to run past high level monsters, 3 free inventory spaces",
    "template": "needed"
  },
  {
    "list": [
      "Full mourner gear, the new key, rope. If you're planning to complete the puzzles in a single trip, bring a death talisman/death tiara/catalytic talisman and the newly made crystal too. A death talisman can be obtained from dark beasts. Ironmen without a death talisman will have to bring a list of 50 items instead after completing the puzzles."
    ],
    "recommended": "Weight-reducing clothing, high prayer bonus gear, prayer potions, stamina potions, food, summer pies/agility potions, a weapon, pure essence (for the hard Ardougne Diary task), 5 empty inventory spaces.",
    "template": "needed"
  },
  {
    "list": [
      "Bucket (can be found next to the cooking pot at Death Plateau)"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Three buckets of Ugthanki dung (obtainable with three empty buckets and either red hot sauce or the Camulet), seven supercompost and a spade."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Machete (only if you lack 60% favour in Tai Bwo Wannai Cleanup)"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment, the hardy gout tubers, and 69 coins or a rake, seed dibber, spade and either plant cure or supercompost"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Ghostspeak amulet"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Druidic spell (given to you by Filliman), a Silver sickle, and your ghost speak amulet"
    ],
    "template": "needed"
  },
  {
    "list": [
      "A weapon, Ghostspeak amulet, druid pouch, and prayer points (the more the better)."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Ghostspeak amulet"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Silver sickle, Ghostspeak amulet"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment and food to defeat the Sulphur Nagua."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Combat gear to kill Sulphur Nagua (Perilous Moons) (level 98)"
    ],
    "template": "needed"
  },
  {
    "recommended": "Stamina potion",
    "template": "needed"
  },
  {
    "list": [
      "30 coins."
    ],
    "template": "needed"
  },
  {
    "list": [
      "10 bananas and 30 coins."
    ],
    "template": "needed"
  },
  {
    "list": [
      "White apron"
    ],
    "recommended": "a teleport to Varrock and Falador.",
    "template": "needed"
  },
  {
    "list": [
      "Spade, pirate message"
    ],
    "recommended": "A weapon.",
    "template": "needed"
  },
  {
    "list": [
      "Dwellberries, 4 Buckets of water, a spade, and a rope."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Elena's Picture."
    ],
    "template": "needed"
  },
  {
    "list": [
      "A bucket of milk, chocolate dust, and snape grass."
    ],
    "template": "needed"
  },
  {
    "list": [
      "3 balls of wool, ashes, pot of flour, Bucket of water, yellow dye (or 2 onions and coins), and redberries"
    ],
    "template": "needed"
  },
  {
    "list": [
      "soft clay, and a bronze bar"
    ],
    "template": "needed"
  },
  {
    "list": [
      "3 beers, rope, bronze key, wig, paste, and a pink skirt"
    ],
    "template": "needed"
  },
  {
    "list": [
      "A cat (not an overgrown cat)."
    ],
    "template": "needed"
  },
  {
    "list": [
      "A cat (not an overgrown cat), 1 free inventory space.",
      "recommendedFast travel to Ardougne and Varrock."
    ],
    "template": "needed"
  },
  {
    "list": [
      "A cat with decent combat stats, four pieces of cheese, rat poison or the ingredients for it (a vial, red spiders' eggs, and a kwuarm), a bucket of milk, a marrentill and unicorn horn dust."
    ],
    "recommended": "If you have one, an overgrown cat can be an advantage due to its 10 HP and 5 strength. Also, the catspeak amulet and fish to heal your cat (about 6 will suffice -- leaping trout/salmon does not work) raw karambwanji may be used as an alternative food source for healing your cat as well stacks nicely freeing inventory space.",
    "template": "needed"
  },
  {
    "list": [
      "A cat (not an overgrown cat), a catspeak amulet, a pot of weeds and a tinderbox."
    ],
    "template": "needed"
  },
  {
    "list": [
      "A catspeak amulet, a snake charm (comes with the music scroll that you buy or from The Feud) and 101 coins (or 51 with a ring of charos (a))."
    ],
    "recommended": "Fast travel to Port Sarim and Pollnivneach.",
    "template": "needed"
  },
  {
    "list": [
      "3,000 coins or 3 monkey talismans"
    ],
    "recommended": "Combat equipment to kill a ninja monkey and a zombie monkey, Ranged or Magic equipment to kill a monkey guard, Prayer potions, stamina potions and food for combat and running through Ape Atoll dungeon",
    "template": "needed"
  },
  {
    "list": [
      "Any greegree, M'speak amulet, Monkey nuts, Banana"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment to kill a level 84 Big Snake"
    ],
    "recommended": "Antipoison",
    "template": "needed"
  },
  {
    "list": [
      "Arrows that can be made into fire arrows, a bow that can shoot them, a rope, a spade, gear and items to kill a level 110 enemy that uses melee, and at least 2-3 Agility boosts (such as 1-2 Summer pies) if you are below level 56 Agility."
    ],
    "recommended": "An axe or coins to buy food, a form of antipoison (4 doses should be enough), weight-reducing clothing, and a pickaxe if mining the limestone before it is required, though it can be obtained in the Limestone Mine instead. Armour is not required when using a safespot or Protect from Melee. Prayer potions or a Falador shield may be used if using Prayer.",
    "template": "needed"
  },
  {
    "list": [
      "The Big book of bangs, the barrels of coal tar and at least 5 coal per barrel. Noted coal can be unnoted at Phials for 5 coins per coal or use the Corsair Cove bank."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Spade, bow, arrows, 2-3 ropes, a cooked rabbit (obtainable if you bring an axe), tinderbox (even if you already have a cooked rabbit), barrel bomb, agility potions or Summer pies (if boosting)."
    ],
    "recommended": "food, antipoison, axe (if you need to get a cooked rabbit), runes for telegrab to make obstacles and gap jumps easier (especially if you have less than 50 Thieving), an Ardougne teleport, Stamina potions and weight-reducing gear (such as Boots of Lightness or the Graceful outfit).",
    "template": "needed"
  },
  {
    "list": [
      "Agility potions or Summer pies (if boosting), bow and several arrows (cannot use Broad arrows or ice arrows or amethyst arrows), at least one rope, plank (can be obtained during the quest), tinderbox, spade, antipoison(s), pickaxe (if you do not have a limestone in bank), combat equipment to defeat Tyras guard (level 110), 3 empty inventory spaces."
    ],
    "recommended": "High-healing food, 1-2 stamina/energy potions, coins to buy food in the Pass, any axe (cut logs for fire to cook rabbits for food as last resort in forest), a method to teleport out of Tirannwn.",
    "template": "needed"
  },
  {
    "list": [
      "Agility potions or Summer pies (if boosting), antipoison(s), pickaxe (if you do not have a limestone in bank), combat equipment to defeat Tyras guard (level 110), 3 empty inventory spaces."
    ],
    "recommended": "High-healing food, 1-2 stamina/energy potions, coins to buy food in the Pass, any axe (cut logs for fire to cook rabbits for food as last resort in forest), a method to teleport out of Tirannwn.",
    "template": "needed"
  },
  {
    "list": [
      "Limestone, gloves, sulphur, pot, pestle and mortar, 4 balls of wool (only if strip of cloth is needed)."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Pot of quicklime, ground sulphur, strip of cloth, 1-2 barrels of coal-tar, \"Big book of bangs\", 15-20 coal, ~100 coins if planning to bring noted coal."
    ],
    "recommended": "Method of teleportation to Rimmington.",
    "template": "needed"
  },
  {
    "list": [
      "Agility potions or summer pies (if boosting), bow and several arrows, at least one rope, tinderbox (can be bought at Tyras camp/chartership), spade, antipoison(s), plank (optional), cooked rabbit (or logs/axe to cook your own), and the completed barrel bomb."
    ],
    "recommended": "High-healing food, stamina potions, coins to buy food in the Pass, a method to teleport out of Tirannwn, summer pies, weight-reducing gear.",
    "template": "needed"
  },
  {
    "list": [
      "Rope, Spade, Key (found in the Waterfall Dungeon) and the enchanted consecration seed."
    ],
    "template": "needed"
  },
  {
    "recommended": "teleport to Ardougne and either: ring of charos(a) & 1600gp or 3200gp for each trip.",
    "template": "needed"
  },
  {
    "list": [
      "Glarial's pebble"
    ],
    "recommended": "skills necklace, food, prayer potions, ring of recoil",
    "template": "needed"
  },
  {
    "list": [
      "rope, spade, consecration seed"
    ],
    "recommended": "games necklace (to Barbarian Outpost), Ardougne teleport.",
    "template": "needed"
  },
  {
    "list": [
      "Rake and seed dibber."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Bucket."
    ],
    "template": "needed"
  },
  {
    "recommended": "Means to deal damage at range (Magic, Ranged or a Halberd) or means to negate disease (such as Slayer gloves or a Relicym's balm).",
    "template": "needed"
  },
  {
    "list": [
      "100 coins, Combat equipment to defeat Evelot (level 148)"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Lockpick or hair clip"
    ],
    "recommended": "Ardougne cloak (for fast teleport to Hazeel)",
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment to defeat the assassin"
    ],
    "recommended": "Antipoison, icy basalt (to teleport to Weiss)",
    "template": "needed"
  },
  {
    "list": [
      "Tinderbox - obtainable from a crate near where it is needed."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Ranged and Magic combat equipment to defeat the Strange Creature (level 368)"
    ],
    "recommended": "Stamina potions, prayer potions, ranging potions, magic potions or ancient/forgotten brews",
    "template": "needed"
  },
  {
    "list": [
      "100 coins, Combat equipment to defeat Evelot (level 148)"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Lockpick or hair clip"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Tinderbox (can be obtained shortly after required), combat equipment to defeat assassin (level 262)"
    ],
    "recommended": "Antipoison or better",
    "template": "needed"
  },
  {
    "list": [
      "combat equipment to defeat Strange Creature"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Silverlight, demonic sigil, equipment to defeat Agrith-Naar (level 100)"
    ],
    "template": "needed"
  },
  {
    "list": [
      "100 coins"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Plague jacket, plague trousers"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Plague jacket, plague trousers, poisoned sheep food"
    ],
    "template": "needed"
  },
  {
    "list": [
      "None"
    ],
    "recommended": "Drakan's medallion or an Ectophial alongside 10,000 coins. Combat equipment for the next section.",
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment"
    ],
    "recommended": "Food and prayer potions",
    "template": "needed"
  },
  {
    "list": [
      "Knife (obtainable by searching knapsack), axe (obtainable by killing zombie), hammer, a few inventory spaces, combat equipment and a weapon to harm tier 2 vampyres (such as the Ivandis flail)."
    ],
    "recommended": "Two Salve Graveyard Teleports, one Fenkenstrain's Castle Teleport and food to heal yourself and Ivan Strom.",
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment to kill a Mutated Bloodveld (level 123) and some free inventory space."
    ],
    "recommended": "Pickaxe, Drakan's medallion, Morytania legs 3 or Mort'ton teleport",
    "template": "needed"
  },
  {
    "list": [
      "Ivandis flail, armour, Vyrewatch outfit or 1,950 coins"
    ],
    "recommended": "Drakan's medallion, Morytania legs 3 or Mort'ton teleport, some food, an antipoison, 1-2 prayer potions, and 1 super combat potion.",
    "template": "needed"
  },
  {
    "list": [
      "Vyre noble disguise, an axe, eight free inventory spaces"
    ],
    "recommended": "Weight reducing gear, stamina potion, ways to restore run energy.",
    "template": "needed"
  },
  {
    "list": [
      "8 blisterwood logs, knife, chisel, ruby, Ivandis flail and either 5 fire runes and a cosmic rune or an enchant ruby tablet."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Blisterwood flail, combat equipment."
    ],
    "recommended": "High magic defence gear, equipment with crush attack bonuses, a fast ranged weapon, 43 prayer to use protection prayers (70+ recommended for Piety), high healing food, prayer potions, super combat potions and an emergency teleport.",
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment (preferably ranged)"
    ],
    "recommended": "Food, prayer potions, stamina potion for following Carl, Drakan's medallion or an Ectophial alongside 10,000 coins, teleport to Drezel (Fairy ring, Salve Graveyard Teleport tablet, Slayer ring), teleport to Fenkenstrain's Castle (Fenkenstrain's Castle Teleport tablet).",
    "template": "needed"
  },
  {
    "list": [
      "Knife, hammer and an axe (or 3 logs which is slightly faster), combat equipment and a weapon to harm tier 2 vampyres (such as the Ivandis flail)"
    ],
    "recommended": "Three empty spaces and food to heal yourself and Ivan Strom. Bring druid pouches in case you run into the Ghast event which will turn your food rotten.",
    "template": "needed"
  },
  {
    "list": [
      "Pickaxe, combat equipment to kill a Mutated Bloodveld (level 123) and some free inventory space."
    ],
    "recommended": "Drakan's medallion and either Morytania legs 3 or Mort'ton teleport",
    "template": "needed"
  },
  {
    "list": [
      "1950 coins (or Vyrewatch outfit), melee combat equipment, Ivandis flail"
    ],
    "recommended": "Drakan's medallion, some food, an antipoison, 1-2 prayer potions, and 1 super combat potion, 3 empty inventory slots for the outfit.",
    "template": "needed"
  },
  {
    "list": [
      "Vyre noble clothing, an axe, eight free inventory spaces"
    ],
    "recommended": "Drakan's medallion, weight reducing gear, stamina potion, ways to restore run energy, at least 10k coins for the boat from the ectofuntus",
    "template": "needed"
  },
  {
    "list": [
      "8 blisterwood logs, knife, chisel, ruby, Ivandis flail, or 20,000 coins if you don't have one, and either 5 fire runes and a cosmic rune or an enchant ruby tablet."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Blisterwood flail, combat equipment."
    ],
    "recommended": "High magic defence gear, equipment with crush attack bonuses, a fast ranged weapon, 43 prayer to use protection prayers (70+ recommended for Piety), high healing food, prayer potions, super combat potions and an emergency teleport.",
    "template": "needed"
  },
  {
    "list": [
      "3 oak logs, 1 wool, 10 nails, 1 hammer, 1 chisel, 1 bucket of water or ice gloves, 20 empty inventory spaces"
    ],
    "template": "needed"
  },
  {
    "list": [
      "3 oak logs, 1 wool, 10 nails, 1 hammer, 1 chisel, 1 bucket of water or ice gloves, 20 free inventory spaces after the repairs (there is a bank)"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Steel full helm, steel platebody, steel platelegs, red dye, purple dye and one piece of silk. You can grab your mourner gear and a tinderbox to save time."
    ],
    "recommended": "Stamina potion, Weight-reducing clothing, Ardougne teleport, West ardougne teleport",
    "template": "needed"
  },
  {
    "list": [
      "Ardougne knight armour, mourner gear, tinderbox"
    ],
    "recommended": "Stamina potion, prayer potion, armour, weapon, food",
    "template": "needed"
  },
  {
    "list": [
      "Nature rune, rope, flowers from mithril seeds or adamant seeds or irit leaf, cabbage, Wine of Zamorak or Zamorak brew(4), adamant chainbody, black knife or black dagger"
    ],
    "recommended": "Games necklace, teleport crystal (to get back to Lletya)",
    "template": "needed"
  },
  {
    "list": [
      "Cadantine seed, seed dibber, runite bar, hammer, pickaxe, pestle and mortar, vial of water"
    ],
    "recommended": "Antipoison, teleport crystal (only if searching for Lord Amlodd before Lady Trahaearn)",
    "template": "needed"
  },
  {
    "list": [
      "An axe"
    ],
    "recommended": "Iorwerth camp teleport, antipoison, teleport crystal, weight-reducing clothing.",
    "template": "needed"
  },
  {
    "list": [
      "Armour and weapons"
    ],
    "recommended": "Food and prayer potions (if low level), charged teleport crystal to return quickly, Iorwerth camp teleport",
    "template": "needed"
  },
  {
    "recommended": "Food and Antipoison, gear and items for The attack on Lletya",
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment"
    ],
    "recommended": "Food and prayer potion (if low level), emergency teleport, charged teleport crystal to return quickly",
    "template": "needed"
  },
  {
    "list": [
      "Spade, 8 limestone bricks, saw, hammer"
    ],
    "recommended": "Anti-poison, stamina potions, fairy ring access, charged teleport crystal to Lletya, Iorwerth camp teleport, or Catherby teleport and 800–3,200 coins for a charter ship, Zul-Andra teleport",
    "template": "needed"
  },
  {
    "list": [
      "One free inventory spot"
    ],
    "recommended": "Combat equipment, food, prayer potions and at least one super restore for battle with Essyllt, emergency/bank teleport, anti-poison, stamina potion. Note: Tanking the battle and teleporting out after is a viable method",
    "template": "needed"
  },
  {
    "list": [
      "Spade, 8 limestone bricks, saw, hammer"
    ],
    "recommended": "Anti-poison, stamina potions, charged teleport crystal to Lletya, Iorwerth camp teleport, fairy ring access and 76 Agility (71 with summer pie) or a Zul-andra teleport. To save banking, for the next part bring combat gear, food, super restores.",
    "template": "needed"
  },
  {
    "list": [
      "Combat gear"
    ],
    "recommended": "Magic gear, Saradomin brews, super restores, fast ranged weapons such knives, darts, or chinchompas.",
    "template": "needed"
  },
  {
    "recommended": "Weight-reducing clothing, stamina potions, summer pies, 8 empty inventory slots.",
    "template": "needed"
  },
  {
    "recommended": "Weight-reducing clothing, stamina potions, summer pies, 8 empty inventory slots.",
    "template": "needed"
  },
  {
    "list": [
      "Needle and thread, runes for Telekinetic Grab, 4 empty spaces."
    ],
    "recommended": "Nardah teleport or fairy ring (with Lunar or Dramen staff) or Shantay pass and some coins for magic carpet.",
    "template": "needed"
  },
  {
    "list": [
      "Robe of elidinis, rope, ancestral key, the 3 attack styles weapons, bow and arrows, pickaxe, ballad."
    ],
    "recommended": "Armour and some food.",
    "template": "needed"
  },
  {
    "list": [
      "knife, light source, rope."
    ],
    "template": "needed"
  },
  {
    "recommended": "50 coins or a ring of charos unless using fairy rings. A teleport to Draynor Village or nearby.",
    "template": "needed"
  },
  {
    "list": [
      "10 lava runes, 10 mist runes, and 5 blood runes."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment to fight 8 level 79 Sea trolls with no Ranged/Magic safespots."
    ],
    "recommended": "A teleport to Yanille, 5 iron bars, logs, a hammer and a tinderbox. Fishing level boosting item if you're below 62.",
    "template": "needed"
  },
  {
    "list": [
      "A pickaxe (to mine the clay, needed only if you didn't bring any)."
    ],
    "recommended": "7 bones, a pot and a pot lid. (If making a pot lid, bring a pickaxe.)",
    "template": "needed"
  },
  {
    "list": [
      "Bone seeds, Combat equipment to defeat a level 170 Sea Troll Queen, which is able to use Magic, Melee and can drain Prayer. Ranged/Magic safespots are available but not advisable."
    ],
    "template": "needed"
  },
  {
    "list": [
      "5 Blood runes, 10 Mist runes, 10 Lava runes."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Food, Armour, Melee or Ranged weapon, Prayer potions to kill Sea Trolls."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Logs, Tinderbox, 5 Iron bars, Hammer, Small fishing net, Fishing level boosting item if you're below 62, Smithing level boosting item if you're below 45, combat equipment to fight Sea Trolls"
    ],
    "template": "needed"
  },
  {
    "list": [
      "7 bones, airtight pot OR pot with pot lid, brown apron (can ask Malignius for one). If not banking afterwards: Food, Armour, Melee or Ranged weapon, Prayer potions."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Food, Armour, Melee or Ranged weapon, Prayer potions, Bone seeds."
    ],
    "template": "needed"
  },
  {
    "list": [
      "A knife, Karamjan rum (or 30 coins), and a banana."
    ],
    "recommended": "Amulet of glory",
    "template": "needed"
  },
  {
    "list": [
      "A Karambwan vessel, and a Raw karambwanji. Logs and Tinderbox, and a Ranged or Magic method to kill a Monkey if you want to save time."
    ],
    "template": "needed"
  },
  {
    "list": [
      "A banana, Karamjan rum, and a knife. Note that the knife is not strictly required. A slashing weapon seems to work as well."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Seaweed, and a monkey skin or a Ranged or Magic method to kill a monkey."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Jogre bones, a raw karambwanji, a pestle and mortar. Recommended: logs, and a tinderbox (for cooking the pasty jogre bones)."
    ],
    "template": "needed"
  },
  {
    "list": [
      "A ranged weapon with ammunition (darts and throwing knives also work), and runes to cast any magic combat spell. Note: Bring enough runes for more than one cast - it's possible to \"fail\" the attack spell. A swamp lizard or equivalent may be used; just swap between each combat style."
    ],
    "template": "needed"
  },
  {
    "list": [
      "A pickaxe and rope. Equipment and food to defeat a level 46 enemy. Note: Bring an antipoison for your fight with the corrupt lizardman. 50 coins if using the minecart to Mount Quidamortem."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Weight reducing clothing (to weigh less than -1 kg)."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Yew bow or higher and 20 unnoted limpwurt roots."
    ],
    "recommended": "Ava's Accumulator and Armour or Protect from Melee",
    "template": "needed"
  },
  {
    "list": [
      "Ice arrows and a yew bow or better to wield them or darts or throwing knives with at least one ice arrow equipped, the Pendant of Lucien and 20 unnoted Limpwurt roots."
    ],
    "recommended": "Ranged armour and Protect from Magic.",
    "template": "needed"
  },
  {
    "list": [
      "1 free inventory slot"
    ],
    "recommended": "Varrock Teleport",
    "template": "needed"
  },
  {
    "list": [
      "Eye Amulet (Obtained during the quest), a Bucket of Water, 1 free inventory slot"
    ],
    "recommended": "Ring of Dueling or Lumbridge Teleport",
    "template": "needed"
  },
  {
    "list": [
      "Chisel (Obtainable during the quest), Pickaxe (Obtainable during the quest)"
    ],
    "template": "needed"
  },
  {
    "list": [
      "A bucket of water, 1 free inventory slot"
    ],
    "recommended": "Ring of dueling, Lumbridge Teleport, Varrock Teleport",
    "template": "needed"
  },
  {
    "list": [
      "Eye amulet & abyssal incantation"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Chisel and pickaxe (both obtainable during the relevant section)"
    ],
    "template": "needed"
  },
  {
    "recommended": "A weapon to kill 5 Tormented Souls (Level 16).",
    "template": "needed"
  },
  {
    "recommended": "A Varrock teleport, and energy potions.",
    "template": "needed"
  },
  {
    "list": [
      "A cup of tea. (Can be stolen from tea shop or there is a spawn in Taverley north of the Herbalist's store.)"
    ],
    "template": "needed"
  },
  {
    "list": [
      "An opal (cut or uncut)."
    ],
    "template": "needed"
  },
  {
    "list": [
      "A trowel, a specimen brush, and a specimen jar."
    ],
    "template": "needed"
  },
  {
    "list": [
      "2 Ropes, trowel, vial, specimen jar, pestle and mortar, invitation letter and a tinderbox."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Chemical compound, and a tinderbox."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Hammer, Pestle and Mortar, Saw, Mud rune, Bucket of sap, Maple logs, Oak logs"
    ],
    "template": "needed"
  },
  {
    "recommended": "Games necklace, Xeric's talisman, Battlefront teleport",
    "template": "needed"
  },
  {
    "list": [
      "Tinderbox"
    ],
    "template": "needed"
  },
  {
    "recommended": "Antipoison and Food.",
    "template": "needed"
  },
  {
    "list": [
      "Mirror shield, Combat equipment to kill a level 53 Basilisk Youngling (NOT a two-handed weapon), 3 inventory slots"
    ],
    "recommended": "+ to purchase 2 kegs of beer from Thora the Barkeep (also can be purchased at the Grand Exchange)",
    "template": "needed"
  },
  {
    "list": [
      "Rune thrownaxe (bring 5-10), Pet rock for reaching Bardur unless you already have a Fremennik shield or wish to kill market guards to obtain one"
    ],
    "recommended": "Stamina potions, Combat equipment, Food, ring of charos (a) unless you already have a Fremennik shield or wish to kill market guards to obtain one",
    "template": "needed"
  },
  {
    "list": [
      "Seal of passage (Unless elite Fremennik Diary is completed), molten glass, 100 Astral runes, 3 Lunar bars (or ores/any pickaxe), hammer"
    ],
    "recommended": "Teleports to Lunar Isle, Teleports to Rellekka (Enchanted lyre or Fremennik Sea boots)",
    "template": "needed"
  },
  {
    "list": [
      "Pet rock, Fishing rod, Ice gloves, Glassblowing pipe"
    ],
    "recommended": "2 teleports to the Mountain Camp (Slayer ring or fairy ring access, Teleports back to Rellekka (Enchanted lyre or Fremennik Sea boots)",
    "template": "needed"
  },
  {
    "list": [
      "polishing rock, V sigil (e), lunar glass, Fremennik Shield, Glassblowing pipe, 2 Kegs of beer"
    ],
    "template": "needed"
  },
  {
    "list": [
      "V's shield, Combat equipment, Food"
    ],
    "recommended": "Teleports to Lunar Isle, Teleports back to Rellekka (Enchanted lyre or Fremennik Sea boots)",
    "template": "needed"
  },
  {
    "list": [
      "V's shield, Combat equipment to fight Typhor (level 218) and The Jormungand (level 363), High-healing food, 1-2 Super restore(4)"
    ],
    "template": "needed"
  },
  {
    "list": [
      "raw tuna, ores as above, catspeak amulet if you wish to hear what the cat is saying."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Silly jester costume"
    ],
    "template": "needed"
  },
  {
    "list": [
      "8 ropes (can be obtained during this part), an axe, 8 arctic pine logs or 8 split logs (can be obtained during this part), a knife."
    ],
    "recommended": "armour and food.",
    "template": "needed"
  },
  {
    "list": [
      "5,000 coins (optional)"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Silly jester costume"
    ],
    "template": "needed"
  },
  {
    "list": [
      "A set of yak-hide armour OR 3 yak-hides (can be obtained on Neitiznot), 15 coins, a needle and two thread. You will also need a Neitiznot shield OR 2 arctic pine logs, one bronze nail, a hammer, and a rope."
    ],
    "template": "needed"
  },
  {
    "list": [
      "A Neitiznot shield, food, and armour."
    ],
    "recommended": "A means to teleport out of the cave after killing the Troll King.",
    "template": "needed"
  },
  {
    "list": [
      "Tinderbox, beer, and 250 coins."
    ],
    "recommended": "Camelot Teleport.",
    "template": "needed"
  },
  {
    "recommended": "Some food, armour, a weapon (a halberd is best, Ranged is not effective), and prayer potions.",
    "template": "needed"
  },
  {
    "list": [
      "5,000 coins."
    ],
    "template": "needed"
  },
  {
    "list": [
      "None"
    ],
    "recommended": "Food, prayer potions, and combat potions. If you have low combat stats you may bring a god book, rings of recoil (7 minimum), goblin paint cannon, phoenix necklaces, a dramen branch and knife.",
    "template": "needed"
  },
  {
    "list": [
      "Secateurs or Magic secateurs"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Ring of visibility, Severed leg"
    ],
    "template": "needed"
  },
  {
    "list": [
      "200 coins, coal, logs and a tinderbox."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Means to cast Telekinetic Grab (air and law rune)."
    ],
    "template": "needed"
  },
  {
    "list": [
      "An iron bar, 3 sapphires, and a redberry pie (if you have not given Thurgo a free redberry pie in the past, with the required redberry pie for The Knight's Sword not counting)."
    ],
    "template": "needed"
  },
  {
    "list": [
      "4 soft clay or a bracelet of clay and a pickaxe"
    ],
    "recommended": "Digsite pendant or Digsite teleport, a woodcutting axe and a Bird Snare",
    "template": "needed"
  },
  {
    "list": [
      "An empty vial, pestle and mortar, statuette, black mushroom (obtainable in Uzer dungeon), Strange implement, papyrus, Phoenix feather (obtainable near the clay mines north of Uzer), chisel and hammer (optional, for cutting gems)."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Bark sample"
    ],
    "recommended": "Ring of dueling, necklace of passage for teleportation to the Outpost",
    "template": "needed"
  },
  {
    "list": [
      "1,000 coins (if you haven't helped Femi)"
    ],
    "recommended": "Teleport out of Karamja",
    "template": "needed"
  },
  {
    "list": [
      "Lumber order"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment and food to last in a fight against a level 172 Black demon"
    ],
    "template": "needed"
  },
  {
    "recommended": "Teleportation methods to Tree Gnome Stronghold and Yanille.",
    "template": "needed"
  },
  {
    "list": [
      "1000 coins (if you haven't helped Femi)"
    ],
    "recommended": "A teleport out of Karamja.",
    "template": "needed"
  },
  {
    "list": [
      "Lumber order."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment and food to last in a fight against a level 172 Black demon."
    ],
    "template": "needed"
  },
  {
    "list": [
      "4 planks, ~20 nails, a hammer, fishbowl helmet, diving apparatus. Good food and some armour to defend from aggressive level 57 zombie pirates."
    ],
    "recommended": "2 Mos le'harmless teleports or Ectophial, 3 Watermelon seeds, rake, seed dibber, and ultracompost if doing the hard Morytania Diary.",
    "template": "needed"
  },
  {
    "list": [
      "Holy symbol."
    ],
    "recommended": "charged Combat bracelet or Amulet of glory (teleport to Edgeville), Mos le'harmless teleport or Ectophial.",
    "template": "needed"
  },
  {
    "list": [
      "Ring of charos, 10 wooden cats (or the materials to make them), ~50 nails, 4 planks, hammer"
    ],
    "recommended": "Ectophial, Runes for 2 Fenkenstrain's Castle Teleports or 2 tablet equivalents, Kharyll tab (if Desert Treasure I has been completed), armour, food, weapon and/or Wolfbane dagger.",
    "template": "needed"
  },
  {
    "list": [
      "Hammer, fishbowl helmet, diving apparatus"
    ],
    "recommended": "Weapon, armour to kill 4 Sorebones (safespottable), Salve Amulet",
    "template": "needed"
  },
  {
    "list": [
      "4 planks, at least 20 nails, a hammer, fishbowl helmet, and diving apparatus."
    ],
    "recommended": "A teleport to Edgeville Monastery if continuing to the next section immediately, and bring 3 watermelon seeds, a rake, and a seed dibber to complete the hard Morytania Diary task.",
    "template": "needed"
  },
  {
    "list": [
      "A Holy symbol"
    ],
    "recommended": "Ectophial",
    "template": "needed"
  },
  {
    "list": [
      "Ring of Charos, 4 planks (14 if making the wooden cats, 10 pieces of fur), 10 wooden cats, 100 nails (to be sure you have enough), and a hammer, 2 free spaces. Crate parts and wolf whistle are needed but obtained during this section."
    ],
    "recommended": "Ectophial or Mos' Le Harmless teleport scroll to teleport away once the final step is complete.",
    "template": "needed"
  },
  {
    "list": [
      "A hammer (the Imcando hammer does not work), fishbowl helmet, diving apparatus, combat equipment and 7 empty inventory slots."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment, fishbowl helmet and diving apparatus."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Beer"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Bert's rota, Sandy's rota, white berries, redberries, lantern lens, sand (pickpocketed from Sandy), empty vial."
    ],
    "recommended": "A second empty vial",
    "template": "needed"
  },
  {
    "list": [
      "Truth serum, magical orb"
    ],
    "template": "needed"
  },
  {
    "list": [
      "5 earth runes, a bucket of sand."
    ],
    "template": "needed"
  },
  {
    "list": [
      "A beer (obtainable for 2 gp)"
    ],
    "template": "needed"
  },
  {
    "list": [
      "2 vials, a lantern lens, Bert's rota, Sandy's rota, redberries and white berries, sand"
    ],
    "template": "needed"
  },
  {
    "list": [
      "magical orb, truth serum"
    ],
    "template": "needed"
  },
  {
    "list": [
      "5 earth runes and a bucket of sand"
    ],
    "template": "needed"
  },
  {
    "list": [
      "None"
    ],
    "recommended": "10-14 free inventory spaces to make room for crystalline disks.",
    "template": "needed"
  },
  {
    "list": [
      "A crossbow and mith grapple, crystal chime, combat equipment"
    ],
    "template": "needed"
  },
  {
    "list": [
      "None"
    ],
    "recommended": "10-14 free inventory spaces to make room for crystalline disks.",
    "template": "needed"
  },
  {
    "list": [
      "A crossbow and mith grapple, crystal chime, combat equipment",
      "recommended",
      "Earmuffs or a Slayer helm"
    ],
    "template": "needed"
  },
  {
    "list": [
      "An axe"
    ],
    "template": "needed"
  },
  {
    "list": [
      "6 normal logs."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment for two different styles, or a poisoned weapon"
    ],
    "template": "needed"
  },
  {
    "list": [
      "A bow, arrows, spade, and rope. Bring the rest of your supplies now, including the spade as after this section there is no turning back unless you want to restart the entire dungeon."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Food (strongly recommended) and 1 or more rope."
    ],
    "template": "needed"
  },
  {
    "list": [
      "A plank (optional but suggested)."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Spade and food."
    ],
    "template": "needed"
  },
  {
    "list": [
      "None."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Food, combat equipment and the unicorn horn. A plank is suggested, but not required."
    ],
    "template": "needed"
  },
  {
    "list": [
      "None."
    ],
    "template": "needed"
  },
  {
    "list": [
      "A bucket and a tinderbox."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Food, combat equipment, and the doll of Iban."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment and the doll of Iban."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Klank's gauntlets and the doll of Iban."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Doll of Iban."
    ],
    "template": "needed"
  },
  {
    "list": [
      "10,000 coins or 1 law rune, 1 molten glass, and 1 enchanted gem."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Combat equipment to kill Black Knights, the Commorb, and Antipoison for low-level players."
    ],
    "recommended": "Teleport method to Falador.",
    "template": "needed"
  },
  {
    "list": [
      "The Commorb and either 20 unnoted rune OR pure essence (must all be of the same type)."
    ],
    "template": "needed"
  },
  {
    "list": [
      "1 inventory space. Either bat bones or a slash weapon or a knife."
    ],
    "template": "needed"
  },
  {
    "list": [
      "2 ropes, dragon bones, combat equipment to defeat a level 68 enemy and 3 empty inventory space. (Ironmen: dragon bones can be obtained by defeating Elvarg in the Nightmare Zone after Dragon Slayer I.)"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Ogre relic, a gold bar, 20 coins (27 if buying pestle and mortar & vial), death rune, light source (depending on your light source you may need a tinderbox as well), 3 empty inventory spaces."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Cave nightshade, guam potion (unf), jangerberries, bat bones, and a pestle and mortar."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Magic ogre potion, an anti-dragon shield, Cave nightshade, a pickaxe, and combat equipment."
    ],
    "template": "needed"
  },
  {
    "list": [
      "Wand"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Chaos talisman or tiara"
    ],
    "template": "needed"
  },
  {
    "list": [
      "Chaos talisman or tiara"
    ],
    "template": "needed"
  }
]