[
  {
    "start": "Speak to Martin Holt at the entrance to Kourend Castle in Kingstown.",
    "startmap": "1664,3672",
    "difficulty": "Experienced",
    "description": "Great Kourend: a land of wealth, comfort and security. Across its five cities, the people of this Kingdom work to bring peace and prosperity. However, all is not as it seems. Beneath this delicate façade lies an uncomfortable truth: the kingdom of Great Kourend is A Kingdom Divided.\n\nSince the death of the last king, Great Kourend has been ruled by the Kourend Council. Under the watchful gaze of the Council, Kourend has enjoyed a golden age of progression. But not all of its citizens are happy, and, spurred by the recent arrest of Councillor Sophia Hughes, allegations of corruption are growing.\n\nHowever, the political games of the Council may be the least of Kourend's concerns. A darker power is gathering in the Kingdom - one that could change the face of Gielinor forever...",
    "length": "Long",
    "requirements": "*Completion of the Architectural Alliance miniquest\n*Completion of the following quests:\n**The Depths of Despair\n**The Queen of Thieves\n**The Ascent of Arceuus\n**The Forsaken Tower\n**Tale of the Righteous\n**The above quests all require the following quests to be completed:\n***Client of Kourend\n****X Marks the Spot\n* \n* \n* \n* \n* \n* \n*",
    "items": "* Normal spellbook, and runes to cast a fire spell (fire bolt or better)\n* Melee / Ranged equipment (weapons/armour/potions/food) to defeat a level 239 enemy, and a level 168 creature that can only be damaged with Melee.)\n* Any axe\n* A defence potion (3 or more doses)\n* Volcanic sulphur\n* Molten glass\n* A dark essence block or a pickaxe and chisel (the latter is found at the mine) to obtain one",
    "kills": "* Judge of Yama (Level 168)\n* 2 Assassins (Level 132)\n* Lizardman brute (Level 75)\n* Xamphur (level 239)\n* Barbarian Warlord (Level 91)",
    "recommended": "* \n* for overhead protection Prayers\n* Stamina or energy potions\n* Antipoison\n* Kharedst's memoirs\n* Xeric's talisman or access to it\n* Games necklace to teleport to Wintertodt\n* Skills necklace to teleport to Woodcutting Guild\n* Rada's blessing 3+ to teleport to Mount Karuulm,or Rada's blessing 1+ to teleport to Kourend Woodland\n* Access to fairy rings\n* A lockpick",
    "template": "quest details"
  },
  {
    "start": "Speak to Martin Holt at the entrance to Kourend Castle in Kingstown.",
    "difficulty": "Experienced",
    "description": "Great Kourend: a land of wealth, comfort and security. Across its five cities, the people of this Kingdom work to bring peace and prosperity. However, all is not as it seems. Beneath this delicate façade lies an uncomfortable truth: the kingdom of Great Kourend is A Kingdom Divided.\n\nSince the death of the last king, Great Kourend has been ruled by the Kourend Council. Under the watchful gaze of the Council, Kourend has enjoyed a golden age of progression. But not all of its citizens are happy, and, spurred by the recent arrest of Councillor Sophia Hughes, allegations of corruption are growing.\n\nHowever, the political games of the Council may be the least of Kourend's concerns. A darker power is gathering in the Kingdom - one that could change the face of Gielinor forever...",
    "length": "Long",
    "requirements": "These skills are given upon setting up the speedrun:\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*",
    "items": "These items are provided upon setting up the speedrun:\n* Mid-level melee and ranged equipment\n* 12,000 coins\n* Xeric's talisman (fully charged)\n* Kharedst's memoirs (fully charged)\n* 1 defence potion(4)\n* 4 stamina potion(4)\n* 2 super restore(4)\n* 1 superantipoison(4)\n* 10 shark\n* In bank:\n** 4 stamina potion(4)\n** 2 super restore(4)\n** 20 shark",
    "kills": "* Judge of Yama (Level 168)\n* 2 assassins (Level 132)\n* Xamphur (level 239)\n* Barbarian Warlord (Level 91)",
    "template": "quest details"
  },
  {
    "start": "You can start this quest by talking to the Mysterious Stranger inside Ver Sinhaza, south-east of Meiyerditch.",
    "startmap": "3673,3224",
    "difficulty": "Master",
    "description": "The Mysterious Stranger lurks outside of the mighty Theatre of Blood, the centrepiece of Ver Sinhaza. This shadowy figure has a new request for you – to humiliate a vampyre noble by the name of Lady Verzik Vitur. Take on the challenges that lie within the Theatre to reach her and bring a blush to her bloodless face!",
    "length": "Medium",
    "requirements": "*Completion of the following quests:\n**A Taste of Hope\n***Darkness of Hallowvale\n****In Aid of the Myreque\n*****In Search of the Myreque\n******Nature Spirit\n*******Priest in Peril\n*******The Restless Ghost",
    "items": "*Ivandis flail or Blisterwood flail\n*Saw (crystal saw also works)\n*Ghostspeak amulet (Morytania legs 2 or better also work)\n*Any axe besides the blessed axe",
    "recommended": "*\n*Stamina or Energy Potions\n*Drakan's medallion\n*Anti-venom or 2 doses of antipoison to cure venom.\n**Additional antipoison when fighting the hespori.\n*Access to fairy rings for quick access to the Nature Grotto.\n*Druid pouch to protect food whilst in Mort Myre Swamp, or have lit the Fire of Dehumidification\n*High-end combat equipment with the ability to poison or venom, and high healing food. Bringing all combat styles is highly recommended.",
    "kills": "*Vyrewatch (Level 105)\n*Several venomous spiders (Levels 87 and 123) (can be avoided)\n*Hespori (Level 302)\n*The Maiden of Sugadinti \n*Pestilent Bloat\n*Nylocas Vasilias\n*Sotetseg\n*Xarpus\n*Verzik Vitur",
    "template": "quest details"
  },
  {
    "start": "Read the town notice board in Draynor Village, behind Fortunato's Wine Shop.",
    "startmap": "3086,3251",
    "difficulty": "Novice",
    "description": "Ah, the Falador Farm - filled with cabbages, cows, and even a sleepy sheepdog. A peaceful place, where you can learn to churn butter, give a dog a bone, or purchase various Farming supplies. What was once a place of happiness, joy and wholesome dairy goods has of late become dominated by a vile presence. Each morning Sarah wakes to find her crops destroyed, her cows cowering, and her loyal sheepdog looking... sheepish. \nShe's had enough, but she thinks she's got the culprit on the trot. Can you help her track down... A Porcine of Interest?",
    "length": "Very Short",
    "items": "* Rope\n* Knife or a slash weapon (except abyssal whip, abyssal tentacle, or dragon claws) (obtainable during the quest)",
    "recommended": "*\n*Stamina or energy potions\n*Combat equipment and some food\n*Amulet of Glory for fast travel to Draynor Village\n*Explorer's ring 2 or above for fast travel to the Falador farm\n* and a Chronicle or Combat bracelet to the Champions' Guild for a shortcut",
    "kills": "Sourhog (level 37)",
    "template": "quest details"
  },
  {
    "start": "Go east of Varrock, through the gate by the Earth Altar and just south of there, speak to Launa.",
    "startmap": "3308,3454",
    "difficulty": "Intermediate",
    "description": "A rift in the ground has opened up releasing all manner of strange monsters into the lands near the Digsite. A sorrowful mother waits at the top of the rift for her long lost son, who has been missing for 25 years. You can journey down into the rift for an adventure full of twisted monsters all created from the mind of a young boy driven to madness through incarceration.",
    "length": "Short",
    "requirements": "The ability to defeat level 45+ enemies.",
    "items": "*Rope\n*Some form of a weapon",
    "recommended": "*\n*Food\n*Digsite Pendant or Digsite Teleport\n*(multiple) Antidote++/Antipoison\n*Armour\n*Ranged or Magic method of attacking\n*A fast attack speed weapon, such as bronze darts",
    "kills": "Multiple level 40 to 46 enemies",
    "template": "quest details"
  },
  {
    "start": "Talk to Unferth at his house in Burthorpe.",
    "startmap": "2919,3558",
    "difficulty": "2",
    "description": "Missing: small black cat, answers to the name of Bob.\n\nLast seen on the 19th of Bennath. Please contact Unferth in Burthorpe.",
    "length": "Medium",
    "requirements": "*Completion of the following quests:\n**Icthlarin's Little Helper\n***Gertrude's Cat",
    "items": "*Cat or kitten (Hellcats work. Be sure to bring fish for your kitten if you're using one.)\n*Catspeak amulet\n*5 death runes\n*Chocolate cake\n*Logs\n*Tinderbox\n*Bucket of milk\n*Shears\n*4 potato seeds\n*Rake\n*Seed dibber\n*Vial of water\n*Desert shirt (obtainable during quest) or Druid's robe top (The desert outfit does not work)\n*Desert robe (obtainable during quest) or Druid's robe (The desert outfit does not work)",
    "recommended": "*Fast travel to Burthorpe (Games Necklace or Burthorpe Games Room minigame teleport)\n*Fast travel to Varrock (Varrock teleport)\n*Fast travel to Sophanem (Magic carpets, Nardah teleport or Pharaoh's Sceptre) or fairy ring AKP and run north.\n**Ring of charos (a) for discounted magic carpet rides or hard Desert Diary completed\n* Waterskin (one is enough) or a Circlet of water\n* Stamina Potion or full Graceful outfit",
    "template": "quest details"
  },
  {
    "start": "Speak to Garth in Ver Sinhaza by the entrance to the Theatre of Blood.",
    "startmap": "3668,3215",
    "difficulty": "Experienced",
    "description": "For many years, the Myreque have fought back against the reign of the Drakans. To many, they act as a glimmer of hope in an otherwise miserable existence. In recent times, the Myreque have been beset by disaster, with numerous members meeting a gruesome end at the hands of Vanstrom Klause, the brutal henchman of the Drakans. However, while the Myreque may be in their darkest hour, hope still remains. Thanks to a recent discovery in the laboratories deep beneath Meiyerditch, the Myreque may have finally found a way to take the fight to the vampyres.",
    "length": "Medium",
    "requirements": "*Completion of the following quests:\n**Darkness of Hallowvale\n***In Aid of the Myreque\n****In Search of the Myreque\n*****Nature Spirit\n******Priest in Peril\n******The Restless Ghost\n* \n* \n* \n* \n*",
    "items": "*1,000 coins (More if taking Andras' boat from the Ectofuntus, 10,000 each trip)\n*Knife or sickle\n*Emerald\n*Chisel\n*Either:\n**3 air runes, 1 cosmic rune and having your magic set to the standard Spellbook\n**An enchant emerald or jade tablet\n*Rod of ivandis (can be obtained during the quest)\n*Pestle and mortar (can be obtained during the quest)\n*Vial of water (obtained during the quest)\n*Weapons and armour",
    "recommended": "*\n*Pickaxe (can be obtained during the quest)\n*Stamina potion and weight-reducing clothing\n*Explorer's ring for the run-energy regeneration function\n*Morytania legs 3 or 4 or another means of reaching Burgh de Rott quickly to reach Meiyerditch\n**Alternatively: An ectophial and an additional 10,000 coins per trip for taking Andras' boat ride from Port Phasmatys\n** Consider the Shades of Mort'ton (minigame) teleport as well.\n*Restore potion or super restore to restore stats during the abomination fight.",
    "kills": "*Abomination (Level 149)\n*Ranis Drakan (level 233) (must be fought using melee)\n*4 vyrewatch (level 87)",
    "template": "quest details"
  },
  {
    "start": "Speak to Garth in Ver Sinhaza by the entrance to the Theatre of Blood.",
    "difficulty": "Experienced",
    "description": "For many years, the Myreque have fought back against the reign of the Drakans. To many, they act as a glimmer of hope in an otherwise miserable existence. In recent times, the Myreque have been beset by disaster, with numerous members meeting a gruesome end at the hands of Vanstrom Klause, the brutal henchman of the Drakans. However, while the Myreque may be in their darkest hour, hope still remains. Thanks to a recent discovery in the laboratories deep beneath Meiyerditch, the Myreque may have finally found a way to take the fight to the vampyres.",
    "length": "Medium",
    "requirements": "These skills are given upon setting up the speedrun:\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*",
    "items": "These items are provided upon setting up the speedrun:\n* Mid-level melee equipment\n* 12,000 coins\n* 1 Enchant emerald or jade\n* 1 Emerald\n* 1 Ghostspeak amulet\n* Ectophial\n* 1 Rod of Ivandis\n* 3 stamina potion(4)\n* 2 super restore(4)\n* 10 shark\n* In bank:\n** 2 stamina potion(4)\n** 2 super restore(4)\n** 20 shark",
    "kills": "*Abomination (Level 149)\n*Ranis Drakan (level 233) (must be fought using melee)\n*4 vyrewatch (level 87)",
    "template": "quest details"
  },
  {
    "start": "Speak to the barbarian guard at the entrance of the Barbarian Agility Training Course.",
    "startmap": "2544,3569",
    "difficulty": "1",
    "length": "Medium",
    "description": "Go to bars and buy alcohol.",
    "requirements": "None",
    "items": "*208 coins to buy all the required alcohol",
    "recommended": "*Restore potions to restore skills that are lowered\n*Food to recover any lost hitpoints\n*Stamina or energy potions\n*Fast travel to several locations\n**Barbarian Outpost (Games Necklace)\n**Varrock (Varrock teleport, Chronicle or Combat Bracelet to the Champions' Guild)\n**Lumberyard (Lumberyard teleport, Digsite pendant or Digsite teleport)\n**Tree Gnome Stronghold (Balloon Transport System, Gnome Glider, Spirit Tree or Slayer Ring to the Slayer Cave)\n**Brimhaven (Brimhaven teleport, Teleport to House if your house is in Brimhaven, or ship from Ardougne)\n**Musa Point (Amulet of Glory to Karamja or ship from Port Sarim)\n**Port Sarim (Explorer's Ring 2, Amulet of Glory to Draynor Village or Rat Pits minigame teleport)\n**Yanille (Watchtower teleport or Nightmare Zone minigame teleport)\n**Ardougne (Ardougne teleport or Ardougne cloak)\n**Falador (Falador teleport)\n**Seers' Village (Camelot teleport or Combat Bracelet to the Ranging Guild)",
    "template": "quest details"
  },
  {
    "start": "Speak to Ava in Draynor Manor.",
    "startmap": "3093,3358",
    "difficulty": "Intermediate",
    "description": "Draynor Manor has a new resident and, adventurers rejoice, she is a damsel in distress. Far from being Sleeping Beauty, she finds the Manor's beds not to her liking and is suffering from insomniac nights. If you fancy yourself able to aid Ava in her search for a good night's sleep, who knows what the budding scientist will produce as a reward?",
    "length": "Medium",
    "requirements": "*Completion of the following quests:\n**The Restless Ghost\n**Ernest the Chicken\n**Priest in Peril\n* \n* \n* \n*",
    "items": "*Mithril axe (required to obtain the blessed axe, no other type of axe will do)\n*5 iron bars\n*Ghostspeak amulet (Morytania legs will not work)\n*20 Ecto-tokens (or 4 bones, 4 buckets and 4 pots to gain the tokens)\n*Hammer\n*Hard leather\n*Holy symbol\n*Polished buttons",
    "recommended": "*10 more ecto-tokens to purchase an undead chicken that you can keep\n*Stamina or energy potion\n*Fast travel to several locations\n**Draynor Manor (Draynor Manor teleport or Amulet of Glory to Draynor Village)\n**Port Phasmatys (Ectophial, Charter ships or Fairy ring code )\n**Slayer Tower (Slayer Ring, Fenkenstrain's Castle Teleport, Kharyrll teleport, Salve Graveyard teleport or Fairy ring code )\n**Burthorpe (Games Necklace, Burthorpe Games Room grouping teleport, Combat Bracelet to the Warriors' Guild, Taverley teleport or Teleport to House if it is in Taverley)\n**Rimmington (Rimmington teleport, Teleport to House if it is in Rimmington, Skills Necklace to the Crafting Guild or Rat Pits grouping teleport)",
    "ironman": "*Mithril axe (,  for the Isle of Souls dungeon chest, or   purchase axe from Woodcutting Guild, or access to Fairy rings  and killing Tree spirits, Blue Dragons, or King Sand Crabs)\n* Holy symbol",
    "template": "quest details"
  },
  {
    "start": "Go to Ur-tag's house in Dorgesh-Kaan. (Can be reached either via Kazgar from the Lumbridge cellar or via Dartog from the water mill by telling either NPC to take the player to the mines. Afterwards, go south past the sword icon and enter the door.)",
    "startmap": "2733,5365,plane:1",
    "difficulty": "2",
    "description": "The dwarves are building a new underground rail link between their city of Keldagrim and the cave goblins' Dorgesh-Kaan, but work is being held up by the discovery of ancient goblin artefacts, and they need the help of a qualified archaeologist. Helping them out should be simple enough - unless you stumble upon another H.A.M. plot against the city.",
    "length": "Short",
    "requirements": "* \n* \n*Completion of the following quests:\n**Death to the Dorgeshuun\n***The Lost Tribe\n****Goblin Diplomacy\n****Rune Mysteries\n**The Giant Dwarf\n**The Dig Site\n*The ability to defeat a level 64 (using any combat style) and two level 30 enemies using either Ranged or Magic.",
    "items": "*A light source\n*A tinderbox\n*Magic or Ranged gear for enemy fight (cannot use Melee on them)",
    "recommended": "*\n*Fast teleports to Lumbridge Swamp (amulet of glory to Draynor Village, Lumbridge teleport, or Home Teleport)\n*Food\n*Stamina potions\n*At least eight empty inventory spaces at the start of the quest",
    "kills": "*H.A.M. Archer (level 30)\n*H.A.M. Mage (level 30)\n*Sigmund (level 64)",
    "template": "quest details"
  },
  {
    "start": "Speak to Hosa by the statue outside Kourend Castle.",
    "startmap": "1632,3669",
    "difficulty": "Experienced",
    "description": "Prove yourself to the five houses of Great Kourend and gain the support of several architects to rebuild the statue of King Rada I.",
    "length": "Long",
    "requirements": "Various skills depending on the favour activities done\n* for any Lovakengj activity",
    "recommended": "*Completion of Client of Kourend; distribution of the rewarded 20% favour to Piscarilius\n* for hunting sandworms\n* for making stews in the Mess\n*Ability to kill large numbers of poisonous level 53-75 lizardmen and lizardman brutes\n*Kharedst's memoirs will speed up this quest significantly",
    "items": "Various items depending on the favour activities done",
    "kills": "Lizardmen (level 53 and 62) - optional",
    "template": "quest details"
  },
  {
    "start": "Speak to Aretha after reading a book called soul journey in the Arceuus Library.",
    "startmap": "1815,3856",
    "release": "19 May 2016",
    "update": "Sand Crabs & Soul Bearers",
    "length": "Short",
    "members": "Yes",
    "requirements": "None",
    "items": "*Spade\n*Dusty key or  or Key master teleport",
    "recommended": "*Transportation to the Key Master, such as Key master teleport or Falador Teleport\n*Transportation to Arceuus via Kharedst's memoirs (Book of the dead) or the fairy ring code if Trossa has already been paid\n*Anti-dragon shield if going through Taverley Dungeon without access to Agility shortcuts",
    "difficulty": "Intermediate",
    "template": "quest details"
  },
  {
    "start": "Willow on the path south of Ice Mountain",
    "startmap": "3002,3436",
    "difficulty": "Novice",
    "description": "Willow, an energetic archaeologist (perhaps suspiciously so) is hunting for her next big discovery. She believes she has found the entrance to ancient underground ruins found to the west of Ice Mountain. There's a catch though - the entrance is sealed tight and she needs to re-unite her old crew to help her break in. Naturally, she has to stay close to the ruins in order to lay claim to the find, so it falls to you to bring her rag-tag group back together for one last caper and a final big pay-off.\n\nBurntof is an old dwarf with a penchant for demolition, Checkal is a well-built lifter of heavy things and Marley is a cunning thief with a knack for disarming traps.\n\nTogether, they have the talents it will take to gain entry to the secret ruins. But persuading them might not be easy. See, the gang aren't all too keen on working with Willow again, and her intentions might not be as honourable as she claims...",
    "length": "Short",
    "requirements": "*",
    "items": "* Cooked meat (can be obtained during the quest)\n* Bread\n* Knife\n* Beer (can be obtained during the quest)\n** Alternatively Asgarnian ale, Dwarven stout, or a Wizard's mind bomb",
    "recommended": "* \n* Armour and some food\n* Pickaxe and  to kill the Ancient Guardian without combat\n* Fast travel to Falador (Falador teleport)\n* Fast travel to Varrock (Varrock teleport, Chronicle or (members only) combat bracelet to the Champions' Guild)\n* Fast travel to Edgeville, the Ice Mountain and the Barbarian Village (Skull Sceptre or (members only) combat bracelet to the Monastery or amulet of glory to Edgeville)\n* Energy potions or (members only) stamina potions\n* (Members only) Weight-reducing clothing",
    "kills": "Ancient Guardian (level 25) (Note: You can skip the fight with a pickaxe and )",
    "template": "quest details"
  },
  {
    "start": "Willow on the path south of Ice Mountain",
    "difficulty": "Novice",
    "description": "Willow, an energetic archaeologist (perhaps suspiciously so) is hunting for her next big discovery. She believes she has found the entrance to ancient underground ruins found to the west of Ice Mountain. There's a catch though - the entrance is sealed tight and she needs to re-unite her old crew to help her break in. Naturally, she has to stay close to the ruins in order to lay claim to the find, so it falls to you to bring her rag-tag group back together for one last caper and a final big pay-off.\n\nBurntof is an old dwarf with a penchant for demolition, Checkal is a well-built lifter of heavy things and Marley is a cunning thief with a knack for disarming traps.\n\nTogether, they have the talents it will take to gain entry to the secret ruins. But persuading them might not be easy. See, the gang aren't all too keen on working with Willow again, and her intentions might not be as honourable as she claims...",
    "length": "Short",
    "requirements": "These skills are given upon setting up the speedrun:\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*",
    "items": "These items are provided upon setting up the speedrun:\n* 500 Coins\n* 1 Stamina potion(4)\n* 3 Energy potion(4)\n* 5 Tuna",
    "kills": "Ancient Guardian (level 25)",
    "template": "quest details"
  },
  {
    "start": "Speak to Jamila at her stall in Sophanem.",
    "startmap": "3309,2779",
    "difficulty": "Master",
    "description": "When Sophanem was beset by a series of plagues, the gates to the golden city of Menaphos quickly closed. The city has been locked down ever since, with no one allowed to leave or enter. However, rumours have escaped of strange happenings inside Menaphos and there are stories of citizens mysteriously disappearing. These odd happenings need to be investigated, but few are willing to do so. Maisa, a spy from Al Kharid, has grown tired of inaction. She is determined to solve this mystery herself, but she won't be able to do it alone... are you up for the challenge?",
    "length": "Medium",
    "requirements": "*Completion of the following quests:\n**Contact!\n***Prince Ali Rescue\n***Icthlarin's Little Helper\n****Gertrude's Cat\n* \n* \n*",
    "recommended": "*\n* Protection against the desert heat, such as waterskins or Desert amulet 4\n* Some form of antipoison\n* Dramen staff to use fairy ring \n* A pharaoh's sceptre for a direct teleport to the necropolis (Once you arrive in the necropolis, use the Commune option on the obelisk by the mine).\n* Food and both melee and ranged combat gear.\n* Stamina potions are helpful in the dungeon\n* A method of teleporting to Nardah (e.g: Nardah teleport or Desert amulet 2+)",
    "items": "* Coal\n* Iron bar\n* Tinderbox (obtainable during quest)\n* Spade (obtainable during quest) \n* Any cooked or raw meat (fish will not work; raw yak meat will not work; purchasable from shop during quest)",
    "kills": "* Head Menaphite Guard (level 174) without the use of protection prayers\n* Two Scarab Mages (level 119)\n* The Champion of Scabaras (level 379) \n* Menaphite Akh (level 351)",
    "template": "quest details"
  },
  {
    "start": "Speak to Jamila in Sophanem.",
    "difficulty": "Master",
    "description": "When Sophanem was beset by a series of plagues, the gates to the golden city of Menaphos quickly closed. The city has been locked down ever since, with no one allowed to leave or enter. However, rumours have escaped of strange happenings inside Menaphos and there are stories of citizens mysteriously disappearing. These odd happenings need to be investigated, but few are willing to do so. Maisa, a spy from Al Kharid, has grown tired of inaction. She is determined to solve this mystery herself, but she won't be able to do it alone... are you up for the challenge?",
    "length": "Medium",
    "requirements": "These skills are given upon setting up the speedrun:\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*",
    "items": "These items are provided upon setting up the speedrun:\n* Melee and ranged combat equipment\n* 3 stamina potion(4)\n* 4 Saradomin brew(4)\n* 2 super restore(4)\n* 1 superantipoison(4)\n* 4 waterskin(4)\n* 5 shark\n* In bank:\n** 3 stamina potion(4)\n** 8 Saradomin brew(4)\n** 4 super restore(4)\n** 8 waterskin(4)\n** 25 shark",
    "template": "quest details"
  },
  {
    "start": "Speak to Dondakan the Dwarf at the Keldagrim south-west mine.",
    "startmap": "2821,10168",
    "difficulty": "3",
    "description": "Hidden away from the fearsome trolls and the roaming Fremennik, the dwarves delve deep beneath the mountains in search for the ore they need to support their home of Keldagrim. One dwarf in particular, however, has for years been trying to crack open a rock that seems to be impervious to any material that he's tried on it. Convinced that solving the riddle of the rock will lead him to unimaginable wealth, he has spent the later part of his life on just this lump of stone. Help him out, but take care you don't end up in a tight spot!",
    "length": "Medium",
    "requirements": "* Completion of the following quests:\n** Dwarf Cannon\n** Fishing Contest\n*  (not needed for starting the quest)\n*  \n*  \n* The ability to defeat a level 75-125 enemy (depends on how much gold you mine)",
    "items": "* A pickaxe\n* 4 gold bars\n* A hammer\n* An ammo mould (can be bought for 5 coins during the quest) or a double ammo mould\n* ~830 coins (for cart and ferry)",
    "recommended": "* \n* A Falador teleport\n* A Combat bracelet (to teleport to the Monastery)\n* A Camelot Teleport\n* Ring of charos (a)\n* A lunar or dramen staff\n* An Amulet of Glory for a teleport to Edgeville for the furnace\n* Stamina Potion to reduce travel time",
    "kills": "* Scorpion(s) (level 14)\n* Arzinian Being of Bordanzan (level 75-125)",
    "template": "quest details"
  },
  {
    "start": "Speak to Rantz, far east of Feldip Hills.",
    "startmap": "2630,2981",
    "difficulty": "2",
    "description": "Rantz the Ogre needs to feed his demanding children, Fycie and Bugs, so he wants to go Big Chompy Bird hunting. Problem is, he's all fingers and thumbs when it comes to making ogre arrows.\n\nCould someone please give him a hand?",
    "length": "Short",
    "requirements": "* \n*  \n*  \n* The ability to defend against level 64 wolves and level 53 ogres",
    "items": "* Any axe that you can use (Blessed axe does not work)\n* Feathers (100 to be safe; coloured feathers from work)\n* Knife\n* Hammer\n* Chisel\n* 4 wolf bones (can be obtained from level 64 wolves during the quest or from level 14 wolves in the Stronghold of Security)\n* Cabbage (can be obtained during the quest, Draynor cabbage will not work)\n* Tomato (can be obtained during the quest)\n* Onion (can be obtained during the quest)\n* Potato (can be obtained during the quest)\n* Equa leaves (can be obtained during the quest)\n* Doogle leaves (can be obtained during the quest)",
    "recommended": "* \n* Armour and weapons (but not gear that reduces your chance to hit with Ranged, as this can cause you not to hit the chompy bird)\n* Stamina or energy potions and some food\n* Feldip hills teleport or Fairy Rings to (or Gnome Glider after completion of One Small Favour)",
    "kills": "* Chompy bird (level 6)\n* Wolves (level 64) (optional)",
    "template": "quest details"
  },
  {
    "start": "Talk to Elena in her house in East Ardougne.",
    "startmap": "2592,3336",
    "difficulty": "1",
    "description": "This is the second part of an ongoing adventure. Help Elena discover the truth about the infamous Ardougne plague.\n\nSmuggle test samples across Ardougne to Elena's old mentor.",
    "length": "Short",
    "requirements": "*Completion of Plague City",
    "items": "* Bird feed (Can be obtained during the quest. Found in a cupboard in Jerico's house)\n* Pigeon cage (Can be obtained during the quest. Found behind Jerico's house)\n* Priest gown top and bottom (can be obtained during the quest for a total of 12 coins from Asyff's Fancy Clothes Store)\n* Gas mask (can be obtained for free from the cupboard in Edmond and Alrena's house in East Ardougne)",
    "recommended": "* \n* Stamina or energy potions\n* Fast travel to several locations\n**Rimmington (Rimmington teleport, Teleport to House if your house is in Rimmington, Explorer's Ring 2, Skills necklace to the Crafting Guild or Rat Pits minigame teleport)\n**Varrock (Varrock teleport, Chronicle or Combat bracelet to the Champions' Guild)\n**Ardougne (Ardougne teleport)",
    "kills": "* Mourner (level 13)",
    "template": "quest details"
  },
  {
    "start": "Speak to Sir Amik Varze on the of the White Knights' Castle's western tower in Falador.",
    "startmap": "2959,3336,plane:2",
    "difficulty": "Intermediate",
    "description": "The Black Knights are up to no good. You are hired by the white knights to spy on them and destroy their secret weapon.",
    "length": "Very Short",
    "requirements": "* Quest points\n* The ability to evade level 33 Black Knights",
    "items": "* Cabbage (can be obtained from the cabbage patch in Edgeville Monastery and Lumbridge cellar. Cabbages obtained from Draynor Manor CANNOT be used)\n* Iron chainbody (can be purchased at Horvik's Armour Shop in Varrock and from Wayne's Chains in Falador)\n* Bronze med helm (can be purchased in the helmet shop in Barbarian Village, spawns by the backdoor of Draynor Manor)",
    "recommended": "* \n* Food\n* Armour\n* Falador teleports\n* (Members only) Combat bracelet to the Monastery and head west towards the Black Knights' Fortress",
    "kills": "None",
    "template": "quest details"
  },
  {
    "start": "Speak to Sir Amik Varze on the of the White Knights' Castle's western tower in Falador.",
    "difficulty": "Intermediate",
    "description": "The Black Knights are up to no good. You are hired by the white knights to spy on them and destroy their secret weapon.",
    "length": "Very Short",
    "requirements": "These skills are given upon setting up the speedrun:\n*\n*\n*\n*\n*\n*\n*\n*",
    "items": "These items are provided upon setting up the speedrun:\n* 300 Coins\n* 3 Energy potion(4)\n* 5 Tuna",
    "kills": "None",
    "template": "quest details"
  },
  {
    "start": "Talk to Curator Haig Halen in the Varrock Museum.",
    "startmap": "3260,3450",
    "difficulty": "Intermediate",
    "description": "Curator Haig Halen needs your help to finish the construction of a barge fit to take the Varrock museum crew to an unexplored landmass to the east. There have been many attempts to reach the island, but none were successful.\n\nThis quest will have you venturing across Gielinor, aiding the Varrock museum and making the success of the voyage a possibility.",
    "length": "Short",
    "requirements": "*100 Kudos\n*Completion of the following quest:\n**The Dig Site",
    "items": "*2 vodka\n*Marrentill potion (unf)",
    "recommended": "*Fast travel to the Digsite (Digsite teleport or Digsite pendant; 3-4 teleports recommended)\n*Fast travel to the Lumber Yard (short walk from the Digsite or use a Lumberyard teleport -- alternatively, use the Balloon Transport System, costing a willow log per flight; 2 teleports recommended)\n*Fast travel to the Woodcutting Guild (Skills necklace or Xeric's talisman to Xeric's Lookout)\n*Fast travel to Varrock (Varrock teleport)\n*Fast travel to reach Port Sarim (Amulet of glory or Explorer's ring 2)\n\nPost-quest recommended:\n*An iron bar, 2 oak planks, 5 nails and a hammer if you want to build the bank chest on Fossil Island (Note: This requires 21 Construction)",
    "template": "quest details"
  },
  {
    "start": "Talk to Bill Teach at The Green Ghost inn in Port Phasmatys.",
    "startmap": "3675,3496",
    "difficulty": "3",
    "description": "It's war on the high seas as Bill Teach tries to make the journey from Port Phasmatys to the pirate enclave of Mos Le'Harmless!\nWith his crew heading for the hills, he's looking to recruit anyone eager to become a pirate to help him sink the enemy before he ends up swimming home. He's offering a lot more than a shilling to join his crew. Have you got what it takes to be a pirate?",
    "length": "Short",
    "requirements": "*Completion of the following quests:\n** Pirate's Treasure\n** Rum Deal\n*** Zogre Flesh Eaters\n**** Big Chompy Bird Hunting\n**** Jungle Potion\n***** Druidic Ritual\n*** Priest in Peril\n* \n*  \n*  \n*",
    "items": "You don't need to bring any items yourself. However, make sure that you have at least 11 open inventory spaces for items you will obtain during the quest. A higher amount, like 14 open spaces, is recommended however.",
    "recommended": "*\n*A ghostspeak amulet if you've not finished Ghosts Ahoy.\n*If you have not completed Ghosts Ahoy you'll need 3,500 coins to charter a ship or 2 Ecto-tokens.\n*Food (level 57 pirates will attack you on the ship)\n* Ectophial",
    "kills": "*Pirates (level 57)",
    "template": "quest details"
  },
  {
    "start": "Speak to Veos at Port Piscarilius.",
    "startmap": "1826,3690",
    "difficulty": "Novice",
    "description": "Will you help Veos handle a mysterious client?",
    "length": "Short",
    "requirements": "*Completion of the following quest:\n**X Marks the Spot",
    "items": "* Feather (a stripy or coloured feather can also be used, but a magic gold feather cannot)",
    "recommended": "*Weight-reducing clothing and energy restoration (such as the Graceful outfit and a stamina potion)\n*Fast travel to the Dark Altar (Games necklace to Wintertodt, Arceuus library teleport or Fairy rings (requires the fairy ring to be activated for a one-time fee of 80,000 coins)\n*Means of fast travel around Great Kourend (Fairy rings, Xeric's Talisman, Kourend Castle Teleports (requires and having read Transportation incantations in the Arceuus library), or the Lovakengj Minecart Network (requires 65% Lovakengj favour)",
    "template": "quest details"
  },
  {
    "start": "Talk to Brother Kojo in the Clock Tower south of East Ardougne.",
    "startmap": "2569,3249",
    "difficulty": "Novice",
    "description": "Help the confused Brother Kojo find the missing cogs and fix his watch tower. Search the dungeon using brawn and brains to correctly place the four cogs.",
    "length": "Very Short",
    "requirements": "The ability to run past level 53 Ogres",
    "items": "* Bucket of water (obtainable during quest) or Ice gloves or Smiths gloves (i)",
    "recommended": "* \n* Stamina potions\n* Ardougne cloak",
    "template": "quest details"
  },
  {
    "start": "Speak to Larry at Ardougne Zoo.",
    "startmap": "2594,3265",
    "difficulty": "2",
    "description": "At the Ardougne Zoo, one of the zookeepers has become a bit preoccupied by penguins. In fact, he's downright paranoid about them. He needs your help to observe their habits on the iceberg in the Lunar Sea.\n\nWhat begins as a peaceful bird-watching expedition opens a new world of espionage and bad musicians.",
    "length": "Medium",
    "requirements": "* \n* \n* note: the level 30 requirement to start the quest, and to make the penguin suit can be boosted, but the drums have an unboostable level 30 requirement. The agility course can be unlocked before this is required.\n* \n* \n*Access to a crafting table 3",
    "items": "*10 oak planks\n*10 steel nails\n*Hammer\n*Spade\n*Clockwork or a steel bar to make one\n*Plank\n*Silk\n*Raw cod or the ring of charos (a)\n*Swamp tar\n*5 feathers (only regular chicken feathers work) \n*Cowbell\n*Mahogany plank\n*Leather",
    "recommended": "*\n*Fast travel to Lumbridge (Lumbridge teleport), Ardougne (Ardougne teleport or Ardougne cloak 1) and the player-owned house (Teleport to House)\n*Armour and some food",
    "kills": "1–3 Icelords (level 51)",
    "ironman": "* for the mahogany plank",
    "template": "quest details"
  },
  {
    "start": "Speak to the High Priest of Icthlarin in Sophanem.",
    "startmap": "3281,2771",
    "difficulty": "Experienced",
    "description": "The High Priest of Icthlarin has problems again - this time with the inhabitants of Menaphos. Sophanem is recovering from the plague, yet most of its citizens are still trapped on the other side of the river. Diplomacy has failed and subterfuge beckons. Clearly, this is the sort of job that a shifty adventurer could excel in.",
    "length": "Short",
    "requirements": "*Completion of the following quests:\n**Prince Ali Rescue\n**Icthlarin's Little Helper\n***Gertrude's Cat",
    "items": "*A light source (Kandarin headgear, Firemaking cape, Abyssal lantern or a bruma torch are extremely recommended as they can't be extinguished by traps in the dungeon). If you don't have one, the Sophanem guard under the temple of the lesser deities will sell you an unlit torch for 200 coins.\n*A tinderbox (unless you have the Kandarin headgear, Firemaking cape, Abyssal lantern or a bruma torch). If you don't have one, the Sophanem guard will sell you one for 50 coins.",
    "kills": "* Giant Scarab (level 191)\n* Summoned by the Giant Scarab:\n** Locust rider (level 68) - Ranged and melee\n** Scarab Mages (level 119 & 66)",
    "recommended": "*\n*Antipoison potion\n*Combat equipment\n*Food\n*The Pharaoh's sceptre or a Nardah teleport (to get to Sophanem)\n*3 Nardah teleports to get to Nardah\n*An emergency escape teleport\n*Desert robes\n*Waterskins\n*A ring of dueling or amulet of glory (to quickly return to Al Kharid)\n*~800 coins (if using Magic carpet transportation)\n*A Shantay pass (entry to the Kharidian Desert)\n*Prayer potions",
    "template": "quest details"
  },
  {
    "start": "Speak to the Cook in the kitchen of Lumbridge Castle.",
    "startmap": "3208,3214",
    "difficulty": "Novice",
    "description": "The Lumbridge Castle cook is in a mess. It is the Duke of Lumbridge's birthday and the cook is making the cake.\n\nHe needs a lot of ingredients and doesn't have much time.",
    "length": "Very Short",
    "items": "* Pot\n* Bucket",
    "recommended": "To skip most of the quest:\n* Egg\n* Bucket of milk\n* Pot of flour",
    "template": "quest details"
  },
  {
    "start": "Speak to the Cook in the kitchen of Lumbridge Castle.",
    "difficulty": "Novice",
    "description": "The Lumbridge Castle cook is in a mess. It is the Duke of Lumbridge's birthday and the cook is making the cake.\n\nHe needs a lot of ingredients and doesn't have much time.",
    "length": "Very Short",
    "requirements": "These skills are given upon setting up the speedrun:\n*",
    "items": "These items are provided upon setting up the speedrun:\n* 100 Coins\n* Energy potion(4)",
    "template": "quest details"
  },
  {
    "start": "Read the signpost in the middle of Canifis.",
    "startmap": "3488,3485",
    "difficulty": "Intermediate",
    "description": "Dr Fenkenstrain, master and sole occupant of the castle to the north-east of Canifis, needs a new servant to go on a dark errand for him.\n\nDo you have the stomach to help Fenkenstrain complete his twisted purpose?",
    "length": "Medium",
    "requirements": "* Completion of Priest in Peril\n* Partial completion of The Restless Ghost (must have obtained ghostspeak amulet)\n* \n*  \n* Able to defeat a level 51 monster and run past level 72 monsters",
    "items": "* Hammer\n* Ghostspeak amulet\n* Silver bar\n* 3 bronze wire (unnoted)\n* Needle\n* 5 thread\n* Spade\n* 1 law & 1 air rune for Telekinetic Grab OR 50 coins",
    "recommended": "* \n* Holy symbol (for safety against Feral Vampyres)\n* 2 ecto-tokens (for access to furnace, only if Ghosts Ahoy has not been completed) or coins for a charter ship\n* Ghosts Ahoy for Ectophial\n* 6 empty places in the inventory\n* Weapon\n* Armour\n* Stamina potion\n* Teleport to Canifis - Kharyrll Teleport or Salve Graveyard Teleport if you have not completed Desert Treasure I\n* 2 Fenkenstrain's Castle Teleport\n* Food for low combat levels\n* Access to Arceuus spellbook, level 48 Magic and runes for Fenkenstrain's Castle Teleport\n* Dramen staff\n* Amulet of glory for Edgeville teleport for quick access to a Furnace",
    "kills": "* Experiment (level 51)",
    "ironman": "*  (to make a bronze wire)",
    "template": "quest details"
  },
  {
    "start": "Talk to the mysterious ghost (Valdez) near Glarial's Tomb.",
    "startmap": "2554,3445",
    "description": "Follow the sad tale of woe from one cursed soul to the next and learn more of Zamorak's betrayal of Zaros.",
    "length": "Medium",
    "requirements": "*Started Desert Treasure I and The Restless Ghost\n**Requires  to obtain the Ring of visibility\n*Some players will need",
    "items": "*Ring of visibility\n*Ghostspeak amulet (Morytania legs 2 or higher may be used instead, except when otherwise noted)\n*Some players may need 5 coins to purchase a Shantay pass\n*Knife or Slash Weapon for the Lava Maze",
    "recommended": "*\n*Various teleportation runes and/or jewellery (different for each player, described below)\n*Stamina potions can be used to preserve run energy; this is especially useful when in the Wilderness.",
    "ironman": "* [[File:Ultimate ironman chat badge.png]] You may need to visit Entrana\n* [[File:Hardcore ironman chat badge.png]] You will need to go into the Wilderness. To make this somewhat safer you can also do this in f2p worlds.",
    "difficulty": "Experienced",
    "template": "quest details"
  },
  {
    "description": "Marlo's father requires someone to refurnish his disastrous house.",
    "start": "Speak to Marlo in the Estate Agent's house in north-east Varrock.",
    "startmap": "3240,3474",
    "difficulty": "1",
    "length": "Short",
    "members": "Yes",
    "requirements": "None",
    "items": "*10 planks – (oak/teak/mahogany will not work)\n*5 bolts of cloth (can be bought from the Sawmill for 650 coins per bolt)\n*At least 16 nails of any type, e.g. steel nails (more are recommended as nails bend when building furniture. 100 is recommended at 1 Construction, obtainable from the Sawmill during the quest)\n*Hammer (Obtainable during the quest from Yarlo)\n*Saw (Obtainable during the quest)\n*3 Waxwood planks - (made during the quest from waxwood logs which are found in a crate in Old Man Yarlo's house)",
    "recommended": "*Varrock Teleport\n*Stamina potion\n*Lumberyard Teleport",
    "template": "quest details"
  },
  {
    "start": "Go to Burgh de Rott and into the basement of the inn there and speak to Veliaf Hurtz.",
    "startmap": "3494,9628",
    "difficulty": "3",
    "description": "Fighting tooth and nail against the vampyre overlord, Drakan, the Myreque have moved their secret base camp to Burgh de Rott. Now the fight starts in earnest! Veliaf needs someone to make their way into the Sanguinesti region, the eastern side of Morytania cut off from the west behind an impenetrably huge wall.\n\nWill the fight be supported by Myreque resistance inside the vampyres' domain? What grim discoveries are to be found behind that dread wall? And what of the Vyrewatch - deadly sky-bound patrollers of the blood-tithed lands of Meiyerditch?\n\nOnly a daring, quick-witted agent with an eye for detail can hope to pick their way through the tumbled down slums of Meiyerditch.",
    "length": "Long",
    "requirements": "*Completion of the following quests:\n**In Aid of the Myreque\n***In Search of the Myreque\n****Nature Spirit\n*****Priest in Peril\n*****The Restless Ghost\n* \n* \n* Note: The level 22 Thieving requirement to begin the quest is boostable, but unhooking the latch in Meiyerditch requiring 22 Thieving cannot be boosted. \n*  Note: The level 26 Agility requirement to begin the quest is boostable, but the unboostable obstacles within Meiyerditch only require 25 Agility. Therefore, 25 Agility is the lowest level possible to complete the quest. \n* \n* \n* \n*The ability to withstand several melee attacks from a level 169 enemy.",
    "items": "*8 nails\n*2 planks\n*Hammer\n*Knife (obtainable during the quest) or a sickle\n*Means to cast Telekinetic Grab (air and law rune -- both obtainable during the quest)",
    "recommended": "*\n*Stamina or energy potions to traverse through the maze of houses\n*Pickaxe, highly recommended, to take a great shortcut through the city (obtainable during quest)\n*Fast travel to several locations\n**Burgh de Rott (Mort'ton teleport, Shades of Mort'ton grouping teleport or Morytania legs 3+, Barrows teleport (tablet))\n**Paterdomus (Salve Graveyard teleport, Fairy rings to or Kharyrll Teleport)\n**Varrock (Varrock teleport -- runes for this teleport are provided during the quest)\n*Vyrewatch outfit (top, legs and shoes) as disguise against the Vyrewatch, only if your Thieving or Hitpoints is low (can be bought for  from Trader Sven during the quest)\n*Armour and some food or  to use Protect from Melee",
    "kills": "None - however, Vanstrom Klause (level 169) needs to be fought until he has attacked you 5 times (whether he hits or misses), and it is very possible to die. However, death can be avoided if you pray protect from melee right after you draw the third sketch.",
    "template": "quest details"
  },
  {
    "start": "Talk to Denulth in his tent in Burthorpe. Tell him you will discover the path for him.",
    "startmap": "2896,3528",
    "difficulty": "Novice",
    "length": "Short",
    "description": "Trolls have come down from the north and are camped on Death Plateau. They are using this base to launch attacks on the principality of Burthorpe!\nThe Imperial Guard is taking heavy losses. They need your help!",
    "members": "Yes",
    "items": "* 60 coins (bring more for the gambling dice with Harold part)\n*10 unnoted bread\n*10 unnoted cooked trout\n*Iron bar\n*Asgarnian ale (can be found on the bar at the pub in Burthorpe)",
    "recommended": "*Premade blurb' sp. or Blurberry special\n*Games necklace for Burthorpe teleports\n*Stamina or energy potions",
    "ironman": "[[File:Ultimate ironman chat badge.png]] Players need 21 empty inventory spaces to deliver items to Tenzing.",
    "template": "quest details"
  },
  {
    "start": "Speak to Mistag in the Dorgesh-Kaan mine.",
    "startmap": "3317,9613",
    "difficulty": "2",
    "description": "Humans have been visiting the Dorgeshuun mines for some time now, but no Dorgeshuun has visited the surface since the signing of the Lumbridge-Dorgeshuun treaty. The Dorgeshuun Council fears that the H.A.M. group may be planning another attack, and want to send an agent to the surface to investigate. But they do not want to send someone to the surface without a guide...",
    "length": "Medium",
    "requirements": "*Completion of the following quests:\n**The Lost Tribe\n***Goblin Diplomacy\n***Rune Mysteries\n* \n* \n*The ability to defeat a level 50 enemy with Melee or Magic",
    "items": "*Any light source (lanterns are recommended - open light sources such as a candle can cause gas explosions and require a tinderbox)\n*2 full sets of H.A.M. robes (all 7 pieces) (chance to receive robes is significantly higher during the quest)\n*Pickaxe (if not using a games necklace to teleport to Tears of Guthix (minigame))",
    "recommended": "*\n*Weapon, armour and some food\n*Games necklace to Tears of Guthix (only usable after you have completed the Tears of Guthix quest)\n*Lumbridge teleport runes or teleportation tabs\nOptional (to quickly complete the Tears of Guthix quest while in the Lumbridge Swamp Caves):\n*A lit sapphire lantern.\n*Chisel\n*Pickaxe\n*Rope (if using the Lumbridge Swamp entrance for the first time)",
    "kills": "*Sigmund (level 50)\n*3 H.A.M. Guards (level 22)",
    "template": "quest details"
  },
  {
    "start": "Speak to Aris in the tent on the western side of Varrock Square.",
    "startmap": "3203,3424",
    "difficulty": "Novice",
    "description": "A mighty demon is being summoned to destroy the city of Varrock. You find out you are the one destined to stop him (or at least try).",
    "length": "Short",
    "requirements": "The ability to defeat a level 27 demon aided by three level 20 Dark wizards and two level 7 Dark wizards using the Silverlight in melee.",
    "items": "*Bucket of water (can be obtained during the quest)\n*25 bones (can't be noted, but can be delivered in increments)\n*1 coin",
    "kills": "Delrith (level 27)",
    "recommended": "* \n*Armour and some food\n*Fast travel to Varrock (Varrock teleport, Chronicle or (members only) Combat Bracelet to the Champions' Guild)\n*(Members only) Fast travel to the Wizards' Tower (Necklace of Passage, Amulet of Glory to Draynor Village, Amulet of the eye, or Fairy Rings to )",
    "template": "quest details"
  },
  {
    "start": "Speak to Aris in the tent on the western side of Varrock Square.",
    "difficulty": "Novice",
    "description": "A mighty demon is being summoned to destroy the city of Varrock. You find out you are the one destined to stop him (or at least try).",
    "length": "Short",
    "requirements": "These skills are given upon setting up the speedrun:\n*\n*\n*\n*\n*\n*\n*\n*",
    "items": "These items are provided upon setting up the speedrun:\n* 5,000 Coins\n* 4 Energy potion(4)\n* 5 Tuna",
    "kills": "Delrith (level 27)",
    "template": "quest details"
  },
  {
    "start": "Speak to the archaeologist at the Bedabin Camp.",
    "startmap": "3178,3043",
    "difficulty": "Master",
    "description": "Rumours abound throughout Varrock and Al-Kharid that an archaeologist has discovered clues to a hoard of treasure hidden deep in the desert, south of Al-Kharid.\n\nAnybody prepared to offer him assistance in his treasure hunting could well find themselves benefitting from a very large reward indeed...",
    "length": "Long",
    "requirements": "* Completion of the following quests:\n** The Dig Site\n** Temple of Ikov\n** The Tourist Trap\n** Troll Stronghold\n*** Death Plateau\n** Priest in Peril\n** Waterfall Quest\n* \n*  \n*  \n*   or the gas mask from Plague City",
    "items": "* 10+ Shantay passes or a way to enter the Kharidian Desert without one\n* 650 Coins\n* 12 Magic logs (can be noted)\n* 6 Steel bar (can be noted)\n* 6 Molten glass (can be noted)\n* Ashes\n* Charcoal\n* 1 blood rune\n* Bones (can be noted to prevent accidental burial)\n* A silver bar\n* Garlic powder (made by grinding garlic in a pestle and mortar)\n* Spice (gnome spice and Evil Dave's spices will not work)\n* A sweet (cake, chocolate cake (part cakes are accepted), or chocolate bar)\n* Spiked boots (obtainable during the quest by bringing Dunstan climbing boots and an iron bar; do so before attempting to obtain the ice diamond)\n* Climbing boots (if Eadgar's Ruse isn't completed and/or you lack 61 Magic for the Trollheim Teleport)\n* A facemask, slayer helmet, or gas mask\n* A tinderbox\n* 20-50+ lockpicks or hair clips",
    "recommended": "* \n* Started Nature Spirit to enter Mort Myre Swamp if not taking an alternative route\n* High-healing Food \n* Prayer potions (highly recommended)\n* Super restore or Menaphite remedy potions (highly recommended)\n* Antidote++ or antipoisons (especially if Ironman) (highly recommended)\n* Ice gloves or Smiths gloves (i) (to be able to wield a weapon against Fareed if not using water spells with runes only)\n* Stamina, super energy or energy potions\n* Weight-reducing clothing to lower run energy drain and restore run energy faster\n* Coins for magic carpet rides (bring a ring of charos (a) for discounted rides)\n* Ring of dueling (easy access to Kharidian Desert)\n* Digsite pendant (easy access to Exam Centre)\n* Ectophial (easy access to Morytania)\n* Skills necklace or Necklace of passage (easy access to Rasolo)\n* Runes to cast Paddewwa Teleport to complete a Varrock Hard Diary task\n* 80,000 Coins if purchasing an Ancient Staff after the quest from Eblis",
    "kills": "* Dessous (level 139)\n* 5 ice trolls (level 120-124)\n* Kamil (level 154)\n* Fareed (level 167)\n* Damis (2 forms, levels 103 and 174)\n* You will also need to tank hits by many high level enemies throughout most parts of the quest.",
    "ironman": "* [[File:Ultimate ironman chat badge.png]] The player briefly visits Entrana.\n*Player will need to obtain Magic logs; see the \"enchanting the mirrors\" section for more information",
    "template": "quest details"
  },
  {
    "start": "Investigate the Ancient Vault north-east of Nardah.",
    "startmap": "3511,2970",
    "difficulty": "Grandmaster",
    "length": "Very Long",
    "requirements": "* \n*  \n*  \n*  \n*  \n*  \n*Completion of the following quests:\n**Desert Treasure I\n***The Dig Site\n***Temple of Ikov\n***The Tourist Trap\n***Troll Stronghold\n****Death Plateau\n***Priest in Peril\n***Waterfall Quest\n**Secrets of the North\n***Making Friends with My Arm\n****My Arm's Big Adventure\n*****Eadgar's Ruse\n******Druidic Ritual\n******Troll Stronghold\n*******Death Plateau\n*****The Feud\n*****Jungle Potion\n****Swan Song\n*****One Small Favour\n******Rune Mysteries\n******Shilo Village\n*****Garden of Tranquillity\n******Creature of Fenkenstrain\n*******Priest in Peril\n*******The Restless Ghost\n****Cold War\n****Romeo & Juliet\n***The General's Shadow\n****Curse of the Empty Lord, for full ghostly robes\n****Fight Arena\n***Devious Minds\n****Wanted!\n*****Recruitment Drive\n******Black Knights' Fortress\n******Druidic Ritual\n*****The Lost Tribe\n******Goblin Diplomacy\n******Rune Mysteries\n*****Priest in Peril\n****Troll Stronghold\n*****Death Plateau\n****Doric's Quest\n****Enter the Abyss\n***Hazeel Cult\n**Enakhra's Lament\n**Temple of the Eye\n***Enter the Abyss\n****Rune Mysteries\n**The Garden of Death\n**Below Ice Mountain\n**His Faithful Servants\n***Priest in Peril",
    "recommended": "*",
    "kills": "* The Leviathan\n* Vardorvis\n* Duke Sucellus\n* The Whisperer",
    "template": "quest details"
  },
  {
    "start": "Talk to the monk outside Paterdomus, next to the River Salve.",
    "startmap": "3406,3492",
    "difficulty": "3",
    "description": "No-one likes to miss a good ceremony, least of all a poor lowly monk who needs your assistance! Will you be able to aid him and make his dreams come true?",
    "length": "Short",
    "requirements": "* \n* \n* \n*Completion of the following quests:\n**Wanted!\n***Recruitment Drive\n****Black Knights' Fortress\n****Druidic Ritual\n***The Lost Tribe\n****Goblin Diplomacy\n****Rune Mysteries\n***Priest in Peril\n**Troll Stronghold\n***Death Plateau\n**Doric's Quest\n**Enter the Abyss",
    "items": "*A mithril 2h sword\n*A bow string\n*A non-degraded large or colossal pouch\n:(You will lose all 3 items!) unless a colossal pouch is used.",
    "recommended": "*\n*Falador teleports\n*Lumberyard teleports, a Digsite pendant, a Salve graveyard teleport (tablet), or a Dramen/Lunar staff\n*An amulet of glory or Paddewwa teleports",
    "kills": "Abyssal creatures level 41+ (if not using Guardians of the Rift to obtain a large pouch)",
    "ironman": "[[File:Ultimate ironman chat badge.png]] The player visits Entrana for a portion of the quest. Plan ahead as the Large Pouch with the orb in it is lost on death. \n [[File:Hardcore_ironman_chat_badge.png]] The quest involves travelling via the Abyss located in level 4-7 Wilderness, with a chance of getting killed by other players.",
    "template": "quest details"
  },
  {
    "start": "Speak to Doric in the small house north of Falador, just outside the east gate of Taverley.",
    "startmap": "2952,3451",
    "difficulty": "1",
    "description": "Doric the dwarf is happy to let you use his anvils but first he would like you to run an errand for him.",
    "length": "Very Short",
    "requirements": "None",
    "items": "* 6 clay (not soft clay)\n* 4 copper ores\n* 2 iron ores",
    "recommended": "* Pickaxe and  if you wish to mine the ores yourself (bronze pickaxe obtained during the quest)",
    "ironman": "*, OR\n* The ability to kill monsters such as Flesh Crawlers, Mind/Body Golems, or other monsters for their iron ore drops.",
    "template": "quest details"
  },
  {
    "start": "Speak to the Guildmaster in the Champions' Guild.",
    "startmap": "3190,3360",
    "difficulty": "Experienced",
    "description": "Prove yourself a true champion. Kill the mighty dragon Elvarg of Crandor and earn the right to buy and wear the Rune platebody.",
    "length": "Medium",
    "requirements": "* Quest points to enter the Champions' Guild\n* The ability to defeat a level 83 dragon",
    "items": "* Unfired bowl (can be made with soft clay on a Potter's Wheel with Crafting)\n* Wizard's mind bomb (can be bought in the Rising Sun Inn in Falador or The Toad and Chicken in Burthorpe)\n* Lobster pot (can be bought from any fishing shop)\n* Silk (can be bought from Thessalia for 30 coins or the Al Kharid silk stall for 3 coins -- members can steal it from the Ardougne silk stall with  Thieving)\n* Magic/ranged weapon as well as a law and air rune (to cast Telekinetic Grab if your Magic level is 33 or higher) or 10,000 coins\n* Hammer\n* Anti-dragon shield (Can be obtained during the quest)\n* 90 steel nails (Members can buy these from the Sawmill operator north-east of Varrock, they can also be smithed at  Smithing using 6 steel bars by all players)\n* 3 planks (only normal planks)\n** Free-to-play: Pick up the spawns in the Graveyard of Shadows, level 19 Wilderness, or for a safer option, ornate lockboxes in the Camdozaal Vault after Below Ice Mountain\n** Member: Several other spawn locations or buy them at the sawmill\n* 2,000 coins",
    "recommended": "* \n*, otherwise you will have to pay 10,000 coins.\n* for Protect from magic against Elvarg's magic attacks.\n* Fast travel to the Champions' Guild (Varrock teleport, Chronicle or (members only) Combat Bracelet)\n* Energy potions or (members only) stamina potions\n* (Members only) Antifire potions to significantly lower Elvarg's dragonfire attack damage\n* (Members only) Fast travel to the Karamja Volcano (via Port Sarim or Amulet of Glory)\n* (Members only) Fast travel to Port Sarim (Explorer's Ring 2, Skills Necklace to the Crafting Guild, or Rat Pits or Pest Control minigame teleports)",
    "kills": "* Zombie rats (level 3)*\n* Ghosts (level 19)*\n* Skeletons (level 22)*\n* Zombies (level 24)*\n* Melzar the Mad (level 43)\n* Lesser demon (level 82)\n* Wormbrain (level 2) - optional\n* Elvarg (level 83)\n\nAn asterisk denotes that there is only one of each monster that drops the required key. They can be noted by small differences in appearance stated later in the guide.",
    "ironman": "* Crafting (to create an unfired bowl)\n*  Smithing (to create steel nails for free-to-play)",
    "template": "quest details"
  },
  {
    "start": "Speak to the Guildmaster in the Champions' Guild.",
    "difficulty": "Experienced",
    "description": "Prove yourself a true champion. Kill the mighty dragon Elvarg of Crandor and earn the right to buy and wear the Rune platebody.",
    "length": "Medium",
    "requirements": "These skills are given upon setting up the speedrun:\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*",
    "items": "These items are provided upon setting up the speedrun:\n* 16,000 coins\n* 3 stamina potion(4)\n* 8 lobsters (plus 20 in bank)",
    "kills": "* Zombie rats (level 3)*\n* Ghosts (level 19)*\n* Skeletons (level 22)*\n* Zombies (level 24)*\n* Melzar the Mad (level 43)\n* Lesser demon (level 82)\n* Wormbrain (level 2) - optional\n* Elvarg (level 83)\nAn asterisk denotes that there is only one of each monster that drops the required key. They can be noted by small differences in appearance stated later in the guide.",
    "template": "quest details"
  },
  {
    "start": "Speak to Alec Kincade outside the Myths' Guild.",
    "startmap": "2457,2868",
    "difficulty": "6",
    "description": "30 years prior to the fateful day a mighty adventurer awakened Elvarg from her slumber, Crandor was a thriving and very much alive island, with a great tradition of mages and adventurers. The history of Crandor is a bold one, enough so that many a Crandorian earned the right to be part of the Champions' Guild! The Crandor we know today is very different from that of the past and there are so many questions that remain unanswered - your chance to uncover the secrets of the past starts with Dragon Slayer II.",
    "length": "Very Long",
    "requirements": "*\n* \n* \n* \n* \n* (higher recommended)\n* \n* \n* \n*Completion of the following quests:\n**Legends' Quest\n***Family Crest\n***Heroes' Quest\n****Shield of Arrav\n****Lost City\n****Merlin's Crystal\n****Dragon Slayer I\n***Underground Pass\n****Biohazard\n*****Plague City\n***Waterfall Quest\n**Dream Mentor\n***Lunar Diplomacy\n****The Fremennik Trials\n****Rune Mysteries\n****Shilo Village\n*****Jungle Potion\n***Eadgar's Ruse\n****Druidic Ritual\n****Troll Stronghold\n*****Death Plateau\n**A Tail of Two Cats\n***Icthlarin's Little Helper\n****Gertrude's Cat\n**Animal Magnetism\n***Ernest the Chicken\n***Priest in Peril\n***The Restless Ghost\n**Ghosts Ahoy\n**Bone Voyage\n***The Dig Site\n***100 Kudos\n**Client of Kourend\n***X Marks the Spot\n*Started the Firemaking part of Barbarian Training to gain access to the Ancient Cavern",
    "items": "*A pickaxe\n*An axe\n*8 oak planks\n*10 swamp paste\n*At least 12 nails of any kind (Note: Bringing more is recommended; nails may bend!)\n*A hammer\n*A machete\n*A saw\n*Catspeak amulet\n*Ghostspeak amulet (Morytania Legs 2+ work)\n*Goutweed\n*Cut dragonstone\n*2 molten glass\n*Glassblowing pipe\n*Chisel\n*Spade\n*Astral rune\n*Seal of passage (or elite Fremennik Diary completion)\n*Tinderbox\n*Pestle and mortar\n*Runes for 3 Fire Wave spells or 3 Fire Surge spells",
    "recommended": "* (75+ range recommended)\n*Prayer level to use at least protection prayers.\n*Stamina potions\n*Serpentine helm or anti-venom+\n*Teleports to various places around the game, most notably Musa Point, Fossil Island, Lunar Isle, and Rellekka as well as access to Spirit trees and Glider transport.\n*High-tier combat equipment, high-healing food, and prayer potions",
    "kills": "*Vorkath (level 392)\n*Spawn (level 100)\n*Robert the Strong  (level 224) \n*2 Green dragon (level 79)\n*2 Blue dragon (level 111)\n*Red dragon (level 152)\n*Iron dragon (level 189)\n*Brutal green dragon (level 227)\n*Black dragon (level 227)\n*Steel dragon (level 246)\n*Brutal red dragon (level 289)\n*Mithril dragon (level 304)\n*Adamant dragon (level 338)\n*Rune dragon (level 380)\n*Galvek (level 608)",
    "template": "quest details"
  },
  {
    "start": "Speak to Alec Kincade outside the Myths' Guild.",
    "difficulty": "6",
    "description": "30 years prior to the fateful day a mighty adventurer awakened Elvarg from her slumber, Crandor was a thriving and very much alive island, with a great tradition of mages and adventurers. The history of Crandor is a bold one, enough so that many a Crandorian earned the right to be part of the Champions' Guild! The Crandor we know today is very different from that of the past and there are so many questions that remain unanswered - your chance to uncover the secrets of the past starts with Dragon Slayer II.",
    "length": "Very Long",
    "requirements": "These skills are given upon setting up the speedrun:\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*",
    "items": "These items are provided upon setting up the speedrun:\n* High-tier melee combat equipment\n* 50,000 coins\n* 15 Teleport to house tablets\n* Catspeak amulet(e)\n* Ghostspeak amulet\n* Ectophial\n* Seal of passage\n* Lunar staff\n* 3 stamina potion(4)\n* 4 Saradomin brew(4)\n* 2 super restore(4)\n* 1 anti-venom+(4)\n* 5 shark\n* In bank:\n** High-tier ranged equipment, including the dragon hunter crossbow\n** Salve amulet(ei)\n** Anti-dragon shield\n** Sarachnis cudgel\n** Dragonstone\n** 9 stamina potion(4)\n** 24 Saradomin brew(4)\n** 16 super restore(4)\n** 35 shark",
    "template": "quest details"
  },
  {
    "start": "Talk to the fallen man in the small cave in the Lunar Isle mine.",
    "startmap": "2343,10360,plane:2",
    "difficulty": "4",
    "description": "Gielinor is not the safest place to live - dragons, trolls, demons... dangerous and despicable monsters of all sorts roam free. In this quest, you must help a fellow adventurer that doesn't do so well against these threats. With perseverance and the magical help of the Moon Clan, there should be no monster that can't be beaten. But is that really true? How about the monsters in your dreams? How about your own inescapable fears? How would you defeat them? Well, you'll soon find out as a tough and often bizarre quest awaits those of a strong will!",
    "length": "Medium",
    "requirements": "* Combat\n*Lunar Diplomacy\n**The Fremennik Trials\n**Lost City\n**Rune Mysteries\n**Shilo Village\n***Jungle Potion\n*Eadgar's Ruse\n**Druidic Ritual\n**Troll Stronghold\n***Death Plateau\n*The ability to defeat 4 powerful monsters without the use of prayer",
    "items": "*A seal of passage\n*3 different kinds of food: 6 of 1 type and 7 of 2 others for a total of 20 pieces (Sacks of cabbages, potatoes, and onions can be used as they each contain 10 piece of their respective food and only require a total of 3 inventory slots)\n*Goutweed\n*An astral rune\n*A tinderbox\n*A hammer\n*A pestle and mortar\n*A good weapon (trident of the seas recommended because they have no magic defence), good armour, good food such as sharks, and super potion sets.",
    "kills": "*The Inadequacy (level 343)\n*The Everlasting (level 223)\n*The Untouchable (level 274)\n*The Illusive (level 108)",
    "ironman": "[[File:Hardcore ironman chat badge.png]] Note: As opposed to the dream world in Lunar Diplomacy, the dream world in Dream Mentor is not safe and dying here is the same as dying in the rest of Gielinor: you will lose your hardcore status.",
    "template": "quest details"
  },
  {
    "start": "Speak to Kaqemeex in the stone circle north of Taverley.",
    "startmap": "2926,3484",
    "difficulty": "1",
    "description": "The Druids north of Taverley need help making a potion to reclaim the stone circle south of Varrock.",
    "length": "Very Short",
    "items": "*Raw bear meat\n*Raw rat meat\n*Raw beef\n*Raw chicken",
    "recommended": "*",
    "template": "quest details"
  },
  {
    "start": "Talk to Captain Lawgof, south of the Coal Trucks, north-west of the Fishing Guild.",
    "startmap": "2567,3461",
    "difficulty": "1",
    "description": "For several years now, the Dwarven Black Guard have been developing the latest in projectile warfare.\n\nWith the constant attack of goblin renegades, the dwarven troops who protect the mines need to put this secret weapon into action.\n\nOnly with your help can the true power of this cannon be harnessed!",
    "length": "Short",
    "items": "*Hammer (obtained during the quest)",
    "recommended": "* Food at very low combat levels.\n* Stamina or energy potions.\n* Fast travel to the entrance of the Dwarven Mine (Amulet of glory to Edgeville or Combat bracelet to the Monastery)\n*Fast travel to the Coal Trucks (Games necklace to Barbarian Outpost or Skills necklace to the Fishing Guild)\n* Fast travel to the Goblin Cave (Skills Necklace to the Fishing Guild)",
    "template": "quest details"
  },
  {
    "start": "Talk to Sanfew in upper floor of the building where Jatix's Herblore Shop is in Taverley.",
    "startmap": "2897,3427,plane:1",
    "difficulty": "Intermediate",
    "description": "Sanfew requires a rare herb for the next part of the purifying ritual.\n\nTravel back to the Troll Stronghold to find this herb that the trolls use as an ingredient for their favourite dish.",
    "length": "Medium",
    "requirements": "* Completion of the following quests:\n** Druidic Ritual\n** Troll Stronghold\n*** Death Plateau\n*",
    "items": "* Climbing boots (or 12 coins to buy from Tenzing)\n* Vodka (sold by Heckel Funch at the Tree Gnome Stronghold bar)\n* Pineapple chunks (pineapples are sold by Heckel Funch at the Tree Gnome Stronghold bar or any Charter Ship, use a knife to dice the pineapple into chunks)\n* 3 logs\n* 10 Grain (obtainable during the quest, just south of Tegid)\n* 5 Raw chicken (there are chickens on the way at Tenzing's house. Undead chickens do not work)\n* Pestle and mortar\n* Tinderbox\n* Ranarr potion (unf)",
    "recommended": "* \n* Armour and some food\n* Energy/stamina potions and weight-reducing clothing\n* Fast travel to the Ardougne Zoo (Ardougne teleport or Ardougne cloak)\n* Fast travel to Taverley (Taverley teleport, Teleport to House if your house is in Taverley, use the Balloon transport system, or alternatively a Falador teleport)\nBurthorpe route to Trollheim:\n* Fast travel to Burthorpe (Games Necklace or Combat Bracelet to Warriors' Guild)\n* for shortcuts around the rockthrowing Trolls ( for more shortcuts to Eadgar)\nFremennik route to Trollheim:\n* Fast travel to Fremennik Slayer Dungeon (Slayer Ring or Fairy Rings to )",
    "template": "quest details"
  },
  {
    "start": "Speak to Charlie, one of the keepers at Ardougne Zoo.",
    "startmap": "2606,3264",
    "difficulty": "Novice",
    "description": "The Ardougne Zoo is always looking for new specimens, but one of their anticipated new attractions - a ferret from the north - has been proving elusive.\n\nOne of the Zoo's more eccentric freelance specimen hunters is reported to be on the case, but after setting out for the far western reaches, somewhere between the Piscatoris Fishing Colony and the Tree Gnome Stronghold, nothing more has been heard from him.\n\nWill you be able to use your skills as a Hunter to track him down? What else will you discover at the mountain known as Eagles' Peak?",
    "length": "Short",
    "requirements": "*",
    "items": "*Yellow dye\n*Swamp tar\n*50 Coins",
    "kills": "Kebbit (level 13) (optional)",
    "recommended": "*\n*Fast travel to the Eagles' Peak (Fairy Rings to or Piscatoris teleport)\n*Fast travel to Varrock (Varrock teleport)\n*Fast travel to the Ardougne Zoo (Ardougne Cloak 1 or Ardougne teleport)\n* Agility for a shortcut\n*Stamina or energy potions.\n*A rope to use the Eagle transport system after the quest (each location flown to completes a medium diary task)\n*A teasing stick, thatching spar, or garden cane to grow the vine for entrance to the jungle eagle's nest if you decide to use the Eagle transport system after the quest.",
    "ironman": "[[File:Ultimate ironman chat badge.png]] You need to unequip your headgear and cape and have 6 empty inventory slots in addition to that.",
    "template": "quest details"
  },
  {
    "start": "Seers' Village, the house south-west of the bank. Search the bookcase there.",
    "startmap": "2716,3481",
    "difficulty": "1",
    "description": "Hundreds of years ago, a mineral was found that had the ability to change the property of Magic.\n\nThe magicians, fearing the effect this may have on their profession, sealed this Workshop forever; or so they had hoped. See if you can rediscover the lost knowledge of elemental ore.",
    "length": "Very Short",
    "requirements": "* \n*  \n*",
    "items": "* Knife or a non-poisoned slash weapon (e.g. dagger or scimitar)\n* Pickaxe\n* Needle (obtainable during the quest)\n* Thread\n* Leather (obtainable during the quest)\n* Hammer\n* 4 coal (4 more for each additional bar you would like to produce)",
    "recommended": "* \n* Camelot teleport\n* Combat equipment for lower levels",
    "kills": "* Earth elemental (level 35)",
    "ironman": "*  (if mining the coal)",
    "template": "quest details"
  },
  {
    "start": "Search the bookcases in the Exam Centre's library and read the beaten book",
    "startmap": "3366,3335",
    "difficulty": "2",
    "description": "Among the ancient scrolls and papers held at the Dig Site's Examination Centre, scholars have discovered more references to the mysterious elemental ore. Recently they have uncovered a beaten book detailing long-lost uses for this odd material.\nCan you decrypt the code that will lead you to the deeper depths of the Elemental Workshop? Can you get your head around fixing the mind-bending machinery, or will you fry your brain in the attempt?",
    "length": "Short",
    "requirements": "* \n* \n*Completion of Elemental Workshop I",
    "items": "*Pickaxe (if obtaining elemental ore during quest)\n*Hammer\n*2 Elemental metals (3 elemental metals if you wish to smith the Mind shield), or:\n**2 Elemental ore (obtainable during quest) (3 if you wish to smith the mind shield)\n**8 Coal (12 if you wish to smith the mind shield)\n*The battered key from Elemental Workshop I",
    "recommended": "*\n*Fast travel to the Exam Centre (Digsite teleport or Digsite pendant)\n*Fast travel to Seers' Village (Camelot Teleport or Combat Bracelet to the Ranging Guild)\n*Restore potion or Magic potion to recover magic levels if your Magic level is below 40 and you wish to smith the Mind shield\n*The slashed book if you wish to smith the Mind shield",
    "kills": "(If you do not have the elemental metal bars) 2 Earth elementals (level 35)",
    "template": "quest details"
  },
  {
    "start": "Talk to Lazim just north-east of the Desert Quarry.",
    "startmap": "3191,2926",
    "difficulty": "3",
    "description": "Lazim the sculptor has a sad tale to tell - his days of making art are over, and now all he can do is carp at adventurers as they make a statue for him in the desert. Although, isn't just south of the Bandit Camp an odd place to be putting up a statue?\nHelp Lazim out with his artistic endeavours, and learn more as this quest goes deeper into the history of RuneScape than you might expect...",
    "length": "Medium",
    "requirements": "* \n* \n* \n*",
    "items": "*Chisel\n*One of the following: bread, any kind of pie, any kind of cake, any kind of pizza, or a baked potato with topping (partial pies, cakes and pizzas do not work)\n*Tinderbox\n*Candle (a black candle will not work)\n*Logs\n*Oak logs\n*Willow logs\n*Maple logs\n*Pickaxe (unless you already have the required items)\n*Soft clay (obtainable during quest if you bring a pickaxe and bucket or jug of water)\n*Coal (obtainable during quest with level )\n*52 kg of sandstone (obtainable during quest with level )\n*Two 5 kg pieces of granite (obtainable during quest with level  )\n*Runes to cast Fire Bolt, Fire Blast or Fire Wave\n*Runes to cast Wind Bolt, Wind Blast or Wind Wave\n*Runes to cast Crumble Undead (multiple casts recommended in case of splashing)\n*Enough remaining Prayer points to cast Protect from Melee for about five seconds",
    "recommended": "*\n*Take the free ferry south-west of Al-Kharid to the Ruins of Unkah for easy access to the quest starting point -- alternatively, travel with a Pharaoh's Sceptre to Jaldraocht\n*One more soft clay if you would like your own camel mask (note that you can still make one after the quest has been completed)\n*Desert equipment (desert robes and waterskins)\n*Stamina or energy potions.",
    "ironman": "* to mine granite",
    "template": "quest details"
  },
  {
    "start": "Speak to Auguste on the island of Entrana.",
    "startmap": "2810,3356",
    "difficulty": "2",
    "description": "On the peaceful island of Entrana, a lone monk has tired of his life of simplicity and quiet reflection. Auguste wants to boldly write his name in the history books; to craftily defeat the laws of physics; to miraculously sail through the air... preferably not to horribly explode into a ball of flaming death. Of course, to do all this, he'll need the help of a worldly adventurer: are you bold enough to merrily laugh in the face of the unknown?",
    "length": "Short",
    "requirements": "*\n* \n* \n*",
    "items": "*3 unnoted papyrus\n*1 ball of wool\n*A full sack of potatoes (item is called Potatoes(10)) (there are potatoes growing in Entrana in the house east of Auguste, bring another empty sack if picking here)\n*8 empty sacks – bring 9 sacks if planning to fill one with potatoes on Entrana.\n*1 unlit candle or black candle (can be obtained during quest by stealing candles in Entrana church)\n*Yellow dye\n*Red dye\n*10 unnoted silk\n*A bowl (obtainable during quest)\n*At least 10 unnoted normal logs\n*A tinderbox\n*12 unnoted willow branches (buy from the Grand Exchange, or plant a willow sapling and wait 5 hours.)\n**Note: A willow seed is not required, nor is a basket of apples as payment (although planting one beforehand is faster); all players receive a willow sapling and a basket of apples to pay to protect the tree from Auguste during the quest.\n**Secateurs (only if planting the tree) (can also be exchanged from a Tool Leprechaun if placed there before)\n**A rake (only if planting the tree) (can also be exchanged from a Tool Leprechaun if placed there before)\n**A spade (only if planting the tree) (can also be exchanged from a Tool Leprechaun if placed there before)",
    "recommended": "*Grouping teleport to Pest Control for easy access to a bank, and quick access to Port Sarim and Entrana\n*A charged amulet of glory to teleport to Draynor Village, which is close to Port Sarim\n*Ability to use Cabbage Teleport via Explorer's ring for easy travel to Port Sarim",
    "ironman": "* [[File:Ironman chat badge.png]]  required to grow a willow tree for the willow branch\n* [[File:Ultimate ironman chat badge.png]] The player visits Entrana",
    "template": "quest details"
  },
  {
    "start": "Speak to the Mage of Zamorak at the end of the River Lum in the Wilderness (Roams levels 4-7).",
    "startmap": "3104,3561",
    "difficulty": "2",
    "description": "In the Abyss miniquest, the player helps the Zamorakians access the rune essence mines so that they can craft their own runes. Previously, it had been a Saradominist secret, but the Mage of Zamorak asks for the player's help in learning it.",
    "length": "Very Short",
    "requirements": "*Completion of Rune Mysteries",
    "items": "None",
    "recommended": "*Varrock and Ardougne teleport runes and a method of teleportation to Edgeville (e.g. Amulet of glory) would be helpful.\n*Necklace of passage for easy teleport to Wizards' Tower.",
    "ironman": " [[File:Hardcore_ironman_chat_badge.png]] Hardcore Ironmen should be extremely cautious as the miniquest is started by travelling to level 4-7 Wilderness, with a chance of getting killed by other players.",
    "template": "quest details"
  },
  {
    "start": "Speak to Veronica, south of Draynor Manor by the gate.",
    "startmap": "3110,3330",
    "difficulty": "Novice",
    "description": "Veronica is very worried. Her fiancé went into the big spooky manor house to ask for directions. An hour later and he's still not out yet.",
    "length": "Very Short",
    "requirements": "*The ability to defend from a level 22 Skeleton.",
    "items": "* Spade (can be obtained during the quest)\n* Fish food (can be obtained during the quest)\n* Poison (can be obtained during the quest)",
    "recommended": "*(Members only) Fast travel to Draynor Manor (Draynor Manor Teleport or amulet of glory)",
    "template": "quest details"
  },
  {
    "start": "Speak to Veronica, south of Draynor Manor by the gate.",
    "difficulty": "Novice",
    "description": "Veronica is very worried. Her fiancé went into the big spooky manor house to ask for directions. An hour later and he's still not out yet.",
    "length": "Very Short",
    "requirements": "These skills are given upon setting up the speedrun:\n*",
    "items": "These items are provided upon setting up the speedrun:\n* Energy potion(4)\n*2 Tuna",
    "template": "quest details"
  },
  {
    "start": "Speak to Martin the Master Gardener by the pig pen in Draynor Village.",
    "startmap": "3077,3258",
    "difficulty": "Experienced",
    "description": "The Fairy Queen should be awake and back in charge of the Lost City by now, but what is happening in Zanaris? Why hasn't the Fairy Godfather abdicated the throne?\n\nWhat is happening to all the fairy inhabitants and where has Fairy Nuff gone? Can you rise to the challenge of using the fairy rings to search the other planes and Cure a Queen, in the second part of the Fairy Tale trilogy?",
    "length": "Medium",
    "requirements": "*Completion of the following quests:\n**Fairytale I - Growing Pains\n***Lost City\n***Nature Spirit\n****The Restless Ghost\n****Priest in Peril\nNote: The following skill levels are required to complete the quest. These skills are not required to unlock access to fairy rings, for which you only need to progress the quest up to a certain point. However, building fairy rings in the player-owned house requires full quest completion.\n* \n* \n*",
    "items": "*Dramen or Lunar staff\n*Vial of water\n*Pestle and mortar\n*Nuff's certificate (obtained during quest)",
    "recommended": "*\n*Combat equipment and some food\n*Restore potion \n*Teleportation to any fairy ring (such as the Salve graveyard teleport, Ardougne cloak, or Slayer ring)",
    "kills": "*Several Goraks (level 145) (can be safespotted) - protection prayers will not work",
    "template": "quest details"
  },
  {
    "start": "Speak to Martin the Master Gardener by the pig pen in Draynor Village.",
    "startmap": "3077,3258",
    "difficulty": "Intermediate",
    "description": "Recently, farmers around RuneScape have been noticing some trouble with their farming patches. They just don't seem to have the same yields as before. What could be the source of this malady?",
    "length": "Medium",
    "requirements": "*Completion of the following quests:\n**Lost City\n**Nature Spirit\n***The Restless Ghost\n***Priest in Peril\n*The ability to defeat a level 111 Tanglefoot with limited weaponry",
    "items": "*Secateurs (obtainable in Sarah's Farming shop north-west of the quest start for 5 coins)\n*Spade (obtainable multiple times during quest)\n*Ghostspeak amulet\n*Dramen staff\n*Draynor skull (obtainable during quest)\n*A combination of three items picked for you at random, see list of potential items.",
    "recommended": "*\n*\n*Decent and/or  levels for the fight with the Tanglefoot (a combined level of 40 is sufficient)\n*Fast travel to Draynor Village and Draynor Manor (Amulet of glory or Draynor Manor teleport)\n*Fast travel to any five farm patches around Asgarnia and Misthalin\n**Falador cabbage patch (Amulet of glory)\n**Falador park (Falador teleport)\n**Rimmington (Rimmington teleport, Teleport to House if your house is there or Skills necklace to the Crafting Guild)\n**Lumbridge (Lumbridge teleport)\n**Champions' Guild (Chronicle, Combat bracelet or Varrock teleport)\n**Varrock Palace (Varrock teleport)\n**Taverley (Taverley teleport or Teleport to House if your house is there)\n*Fast travel to the nature spirit (Mort'ton teleport)\n*Druid pouches (to prevent food from getting rotten by ghasts)",
    "kills": "Tanglefoot (level 111)",
    "ironman": "*Completion of Jungle Potion (to obtain proboscis if needed)\n*Ironmen who do not have the necessary Herblore level to clean possible herbs required to bless the secateurs will need to visit the herblore shop in Nardah to clean the grimy herbs.",
    "template": "quest details"
  },
  {
    "start": "Talk to Dimintheis in south-east Varrock.",
    "startmap": "3279,3404",
    "difficulty": "3",
    "description": "There is a man in Varrock who needs a bit of help. He is of noble heritage, but without his family's crest, he can't prove it. Unfortunately, his three sons took the crest with them when they left, scattering all across RuneScape.",
    "length": "Medium",
    "requirements": "* \n*  \n*  \n*  \n* The ability to defeat a level 170 demon (can be safespotted)",
    "items": "* Shrimps\n* Salmon\n* Tuna\n* Bass\n* Swordfish\n* Pickaxe - rune highly recommended\n* 2 cut rubies\n* Ring Mould\n* Necklace Mould\n* Any poison cure like Antipoison (you will lose this item)\n* Means to cast all 4 Blast spells",
    "recommended": "* \n* An extra antipoison potion for yourself (for the poison spiders in Edgeville Dungeon)\n* Varrock, Camelot, Falador, and Ardougne Teleports (teleporting to Ardougne requires completion of Plague City)\n* Amulet of Glory to fast travel to Edgeville and Al-Kharid (Ring of Dueling can also be used for Al-Kharid, and Soul Wars minigame teleport for Edgeville)",
    "kills": "* Chronozon (level 170) (can be safespotted)",
    "ironman": " [[File:Hardcore ironman chat badge.png]] The player visits the Wilderness section of Edgeville Dungeon  \n*For a swordfish purchasable from The Shrimp and Parrot:\n**  \n**  \n*For a bass (a raw bass can be obtained from a Reward pool) :\n**  \n**",
    "template": "quest details"
  },
  {
    "start": "Speak to Dimintheis in south-east Varrock.",
    "startmap": "3279,3404",
    "difficulty": "2",
    "length": "Short",
    "members": "Yes",
    "requirements": "Completion of Family Crest",
    "items": "*500,000 coins",
    "recommended": "*Varrock Teleport or another method of teleportation to Varrock\n*Ring of dueling or another method of teleportation close to mines north of Al Kharid\n*Camelot Teleport or another method to travel to Catherby (Catherby Teleport)\n*Method of travel to the Lumberyard (Varrock Teleport, Lumberyard Teleport or Digsite Pendant)",
    "template": "quest details"
  },
  {
    "start": "Talk to Lady Servil. She is west by south-west of the Monastery that is south of Ardougne.",
    "startmap": "2566,3199",
    "difficulty": "Intermediate",
    "length": "Short",
    "requirements": "*The ability to defeat level 44, 63 and 137 enemies (all can be safespotted)",
    "items": "*5 coins (for Khali brew)",
    "recommended": "*\n*Ranged, Magic or a Halberd to safespot all enemies\n*Armour and some food if not safespotting",
    "kills": "*Khazard scorpion (level 44)\n*Khazard ogre (level 63)\n*Bouncer (level 137)\n*General Khazard (level 142) - optional",
    "description": "The prosperous Servil family have been abducted by the infamous General Khazard. He plans to have the family battle for his entertainment in the Fight Arena.\n\nCan you rescue the Servils before the tyrant has these innocent (not to mention wealthy) civilians slain?",
    "template": "quest details"
  },
  {
    "start": "Dwarves at the entrances to the tunnel that goes under White Wolf Mountain.",
    "startmap": "2876,3481",
    "difficulty": "1",
    "description": "The mountain Dwarves' home would be an ideal way to get across White Wolf Mountain safely. However, the Dwarves aren't too fond of strangers. They will let you through if you can bring them a trophy. The trophy is the prize for the annual Hemenster fishing competition.",
    "length": "Very Short",
    "requirements": "*",
    "items": "*5 coins (10 if you buy a fishing rod from Jack)\n*Fishing pass (obtained during quest)\n*Garlic (obtainable during quest)\n*Fishing rod (obtainable during quest), oily fishing rod does not work\n*Spade\n*Red vine worm (obtainable during quest)",
    "recommended": "*Fast travel to White Wolf Mountain (Camelot teleport, Taverley teleport, games necklace to Burthorpe, Catherby Teleport, or Teleport to House if your house is in Taverley)\n*Fast travel to McGrubor's Wood (Camelot teleport, combat bracelet to the Ranging Guild or fairy rings to )\n*Food and armour for low levels",
    "template": "quest details"
  },
  {
    "start": "Talk to Commander Veldaban in the Dwarven Black Guard headquarters in Keldagrim.",
    "startmap": "2826,10214",
    "difficulty": "2",
    "description": "Forgettable Tale of a Drunken Dwarf is part 2 in the Rise of the Red Axe series, focusing on the dwarves and their capital city of Keldagrim. After the events in The Giant Dwarf, the Red Axe mining company has departed the city and set up a new headquarters in a remote underground location.\n\nVeldaban, the Commander of the Dwarven Black Guard in Keldagrim, wants you to investigate the case and find out if the Red Axe is planning anything nefarious. The problem is, the only lead he's got is an extremely drunken and kebab obsessed dwarf.\n\nUse your farming and brewing abilities to your advantage, then prepare to be perplexed by puzzles as you follow the trail to the Red Axe...",
    "length": "Long",
    "requirements": "* \n* \n*Completion of the following quests:\n**The Giant Dwarf\n**Fishing Contest",
    "items": "*~400 coins\n*2 barley malt (no range in Keldagrim, plain barley has to be cooked elsewhere)\n*2 buckets of water\n*Seed dibber (no Tool leprechaun in Keldagrim)\n*Rake (obtainable during the quest)\n*Ale yeast (or a Pot (obtainable during the quest) + 25 coins)\n*Kebab (purchasable during quest for 1 coin)\n*2 beers (purchasable during quest for 1-2 coins each)\n*Beer glass (obtainable during the quest)\n*A random item from the list below (see list for details)",
    "recommended": "Recommended\n*A Games necklace/Camelot teleport (to get to White Wolf Mountain quickly) or Ring of dueling and access to the Gnome glider network west of the Emir's Arena\n*An Enchanted lyre/Slayer ring/Keldagrim minecart system (to teleport near Keldagrim entrance faster)",
    "template": "quest details"
  },
  {
    "start": "Speak to Queen Ellamaria in the garden of Varrock Palace.",
    "startmap": "3228,3477",
    "difficulty": "2",
    "description": "'Queen of Varrock seeks experienced gardener to help construct a garden of peace and serenity as surprise for husband.\n\nOnly serious Farmers need apply. Peasants welcome (although not that welcome). Tools not supplied.\n\nPlease note: under no circumstances are the contents of this message to be disclosed to Rollie – um, one means King Roald.'",
    "length": "Long",
    "requirements": "* \n*Completion of the following quests:\n**Creature of Fenkenstrain\n***Priest in Peril\n***The Restless Ghost",
    "items": "*Ring of charos\n*All tool leprechaun tools\n**A rake\n**A seed dibber\n**A spade\n**Secateurs (magic secateurs work)\n**A watering can\n**A gardening trowel\n*2 plant cures\n*A marigold seed\n*3+ cabbage seeds (6 recommended to plant in both allotments to increase chance of survival)\n*3+ onion seeds (6 recommended to plant in both allotments to increase chance of survival)\n*A hammer\n*A rune/pure essence\n*A pestle and mortar\n*A filled plant pot\n*2 ultracompost/supercompost/compost (note: Bottomless compost bucket will not work for these two required composts. The quality of these 2 composts do not matter.)",
    "recommended": "*5 more ultracompost/supercompost/compost to increase the chances of your crops surviving (the quality of these composts *does* matter)\n*An amulet of nature\n*A fishing/fly fishing rod (at least in your bank; ultimately optional but highly recommended) Note: Oily rod does not work\n*Teleport method to the following patch locations:\n**Varrock\n**Draynor Village (amulet of glory)\n**Port Phasmatys farm (Ectophial or Fenkenstrain's castle teleport and run east)\n**Ardougne farm (Ardougne cloak 2+, Dramen/Lunar staff, or skills necklace)\n**Catherby farm (Catherby Teleport)\n**Burthorpe tavern (games necklace)\n**Edgeville Monastery (combat bracelet or amulet of glory)\n**Lumbridge\n**Falador\n**Taverley",
    "ironman": "* All seeds needed for the quest can be bought from Olivia in Draynor.\n* [[File:Ultimate ironman chat badge.png]] Inventory space can be saved by creating the rune dust ahead of time: use the hammer on the rune/pure essence to create rune shards, then use the pestle and mortar on those to create rune dust. The hammer and pestle and mortar can then be safely discarded since they play no further role in the quest.",
    "template": "quest details"
  },
  {
    "start": "Go to Gertrude's house which is just west of Varrock.",
    "startmap": "3150,3412",
    "difficulty": "Novice",
    "description": "Gertrude has lost her cat Fluffs and desperately wants to find her. Can you help bring her home?",
    "length": "Very Short",
    "items": "* Bucket of milk\n* 100 coins\n* Seasoned sardine (Bought from the Grand Exchange) or alternatively:\n** Raw sardine (Caught or bought from Gerrant's Fishy Business.)\n** Doogle leaves (South of Gertrude's house)",
    "recommended": "* Skills necklace to teleport to Cooks' Guild\n* Varrock teleport\n* Lumberyard Teleport\n* Ring of charos (a) (lets you choose the colour of your kitten)\n* An axe and 100 coins to cut down a dying tree in the Lumber Yard and create a normal plank for two easy Varrock Diary tasks.",
    "template": "quest details"
  },
  {
    "start": "Speak to Gordon in their farm south of the Farming Guild.",
    "startmap": "1248,3686",
    "difficulty": "Intermediate",
    "description": "Gordon and Mary are two small-town farmers with a big problem – some heinous beastie keeps taking their livestock! Luckily they've hit upon a solution. They just need some brave adventurer to venture into the creature's lair and bring them back its head. We can't envisage any complications with such a routine matter, right?",
    "length": "Short",
    "requirements": "* \n*",
    "items": "*Bear fur or grey wolf fur (a Grizzly bear and bear cub spawn west of the farm and two black bears spawn east of the farm)\n*Soft clay or a pickaxe you can use\n** Clay rocks are found in the Kebos Lowlands mine passed during the quest;\n** Gordon's house has a water source and a bucket spawn;\n** There is a bronze pickaxe spawn at the mine, stuck in some rocks.\n*Hammer (obtainable near the cattle gate)\n*Saw (obtainable in the shed north of the house)\n*2 normal planks (obtainable near the cave entrance)\n*At least 6 nails of any kind (iron nails can be found in the workbench north of the house, and more than 6 is recommended in case you bend a few)\n*Knife (obtainable on the kitchen table in the house)\n*Red dye (obtainable from the shelves in the house)\n*Pot of flour (obtainable upstairs in the house)\n*Needle (obtainable upstairs in the house)\n*Thread (obtainable upstairs in the house)",
    "recommended": "*\n*Fast travel to the Farming Guild (Skills necklace, Battlefront Teleport, Farming Cape or Fairy Rings to )\n*Combat equipment to fight a level 82 beast.",
    "kills": "Headless Beast (level-82)",
    "template": "quest details"
  },
  {
    "start": "Talk to Velorina in Port Phasmatys.",
    "startmap": "3677,3510",
    "difficulty": "2",
    "description": "East of Canifis is a ghost port. Not meaning that it's deserted. It's full of ghosts! For some reason, they're stuck in Gielinor, but some aren't happy with that. Can you help?",
    "length": "Medium",
    "requirements": "* Completed Priest in Peril\n* Partial completion of The Restless Ghost (must have obtained ghostspeak amulet)\n* \n*",
    "items": "* Some amount of Ecto-tokens:\n** 31 Ecto-tokens (20 with ring of charos (a))\n** OR 25 Ecto-tokens (10 with ring) using charter ships\n** OR 1 bone, 1 pot, and 1 bucket for every 5 ecto-tokens required (see Pre-quest for more info)\n* ~400 Coins\n* Ghostspeak amulet\n* Bucket of milk\n* Silk\n* 3 colours of dye (The dye colours you will need are random. If you want to save a trip, have 3 red, 3 blue, and 3 yellow dyes. That way, you can mix whatever colours you end up needing.)\n*Spade\n*Oak longbow\n*Knife (can be purchased from the Canifis general store)\n*Needle (can be purchased from the Canifis general store)\n*Thread (can be purchased from the Canifis general store)\n* One extra bucket of slime for colouring the bed sheet (can be purchased from a Charter ship crewmember at the port).\n* Nettle tea (prepared ahead of time) or items to make nettle tea:\n** A tinderbox and a log of which you have the Firemaking level to light. Tinderbox can be purchased from the general store during quest\n**Gloves (must be closed fingered - Slayer gloves, Ranger gloves, Infinity gloves, Moonclan gloves, Granite gloves, and Lunar gloves won't work)\n**Nettles (can be obtained during the quest)\n**Bowl of water (empty bowl can be purchased during quest -- the gold bowl won't work)",
    "recommended": "* \n* Level Agility (can be boosted) to save time at the Ectofuntus\n* Food and weapons to defeat a level 32 foe\n* 2-3 Stamina potions\n* Fast travel between quest locations (Slayer ring to Slayer Tower, Fenkenstrain's castle teleport, Canifis teleport or Fairy Rings).",
    "kills": "* Giant lobster (level 32) Can be safespotted.",
    "ironman": "[[File:Ultimate_ironman_chat_badge.png]] Nettle tea and bucket of milk can be combined before the quest starts to save inventory space",
    "template": "quest details"
  },
  {
    "description": "There's a disturbance in the Goblin Village. Help the goblins solve their dispute so the world doesn't have to worry about rioting goblins. Aim: to help the goblins decide which colour they will wear.",
    "start": "Speak to General Bentnoze or General Wartface in Goblin Village.",
    "startmap": "2957,3512",
    "difficulty": "Novice",
    "length": "Very Short",
    "items": "* 3 goblin mail (obtained during the quest, all can be found in goblin village)\n* 1 Blue dye (or 2 woad leaves and 5 coins to obtain a blue dye from Aggie; offer 20 coins to Wyson the gardener and he will give you two woad leaves)\n* 1 Orange dye – created by combining red dye with yellow dye\n** 1 Red dye (or 3 redberries and 5 coins to obtain a red dye from Aggie)\n** 1 Yellow dye (2 onion and 5 coins to obtain a yellow dye from Aggie)",
    "template": "quest details"
  },
  {
    "start": "Talk to Sylas in Taverley, just south of the house portal.",
    "startmap": "2891,3454",
    "difficulty": "4",
    "description": "\"Once upon a time in a land far, far away...\" Sylas, a collector of items both wondrous and unusual seeks out the latest additions to his trove with a somewhat unusual prize for the finder.\n\nTerrors and towers await; fierce battles with giant beasts; striding boldly to rescue a dwarf in distress! Not a quest for the meek or faint-hearted, prepare yourself for a feast of fairy-tale fun with rewards a-plenty! The Brothers Grimm could never have foretold a tale such as this...",
    "length": "Medium",
    "requirements": "*Completion of the following quests:\n**Witch's House\n* \n* \n* \n* (needed twice)\n*  (68 with Dragon axe special attack or 66 with stews)\n*Ability to defeat a level 138 cloud giant—Glod",
    "items": "*2 Tarromin potion (unf) or 2 vials of water and 2 tarromins\n*Seed dibber (leprechaun is nearby)\n*Watering can with at least 1 dose (can also be stored with the leprechaun)\n*Any axe\n*Leather gloves (optional) (obtainable during quest)\n*High healing food\n*Good armour and a weapon (Ranged or Magic equipment recommended if you have low melee levels)",
    "kills": "Glod (level 138)",
    "recommended": "*\n*Falador Teleports\n*Mind Altar Teleports\n*House teleports Set POH to Taverley for quick access\n*Prayer potions\n*One-click teleports in case you are about to die",
    "template": "quest details"
  },
  {
    "start": "Speak to the Zealot at the mines in Morytania on the path to Mort'ton.",
    "startmap": "3444,3257",
    "difficulty": "3",
    "description": "Recent forays into Morytania by some of Saradomin's more fanatical supporters have unearthed murky rumours concerning an abandoned mine in the south.\n\nLegend speaks of an unusual material, hidden in the depths of the mines, that is somehow linked to the desolation and fear that now surrounds the place. Do you have the nerve to find out more, and enter the haunted mines of Morytania?",
    "length": "Short",
    "requirements": "* Completion of Priest in Peril\n*  \n* The ability to defeat a level 95 enemy",
    "items": "* A chisel (can be acquired during the quest)",
    "recommended": "* \n*  if climbing over the mine cart and crawling down the cart tunnel of the front entrance\n* Completion of  Nature Spirit for access to Druid pouch or Fire pit for Fires of Dehumidification.\n* \n* A Dramen or Lunar staff (only if you cannot reach the starting location through the Shades of Mort'ton minigame teleport or a Mort'ton teleport scroll. You can use the fairy ring  (requires ) to teleport near to the quest start.).\n* 1 Super energy potion if low Agility (Stamina potion is HIGHLY recommended)\n* A ball of wool (Optional, required to create salve amulet AFTER quest, NOT needed DURING quest)\n* A pickaxe to mine mithril ore after the quest (for the hard Morytania Diary) (several low-tier pickaxe spawns throughout the mine)\n* A Slayer Ring for easy completion of the Lair of Tarn Razorlor miniquest after completing Haunted Mine.\n\nThe boss fight at the end of the quest is considerably more difficult than the boss's combat level may suggest. It is highly recommended to bring:\n* Good combat equipment (at least level 50 is advised)\n* 1-2 prayer potions\n* Combat stat boosting potions (depending on your attack style)\n* Plenty of good food is strongly recommended for all levels, regardless of equipment and Defence\n* 2 empty inventory spaces, one for Zealot's key and one for the glowing fungus\n* Magic is recommended — see the boss section of the guide for more details\n* It can be useful to bring either a (additional) melee weapon with high Strength bonuses, Ranged ammunition with high Ranged Strength bonuses, or high-hitting Magic spells. Take something with a high maximum hit. (High-hitting special attacks are recommended.)",
    "kills": "* Treus Dayth (level 95)",
    "template": "quest details"
  },
  {
    "start": "Central Ardougne, south of King Lathas' castle. Talk to Ceril Carnillean.",
    "startmap": "2566,3270",
    "difficulty": "1",
    "description": "Discover the truth behind the Carnillean family fortune. Decide for yourself whether to aid the Carnilleans in retrieving stolen goods, or join the Hazeel cult members in their mission to resurrect the infamous Lord Hazeel.",
    "length": "Very Short",
    "requirements": "Able to defeat a level 13 cultist (this applies only if you're taking Ceril's side)",
    "items": "None",
    "recommended": "* \n* Ardougne cloak for Monastery teleports. \n* Stamina or energy potions.",
    "kills": "Alomone (level 13) if taking Ceril's side",
    "template": "quest details"
  },
  {
    "start": "Speak to Achietties by the entrance to the Heroes' Guild, between Taverley and Burthorpe.",
    "startmap": "2904,3511",
    "difficulty": "3",
    "description": "Prove you are worthy to enter the Heroes' Guild. To prove your status as a hero you will need to obtain a number of items. There are many challenges standing between you and these items.",
    "length": "Medium",
    "requirements": "* A partner\n* \n* \n*  \n*  \n*  \n* Completion of the following quests:\n** Shield of Arrav\n** Lost City\n** Merlin's Crystal\n** Dragon Slayer I",
    "items": "* Ice gloves (obtainable during the quest) or Smiths gloves (i)\n* Fishing rod (obtainable during the quest)\n* Fishing bait (obtainable during the quest)\n* Dusty key (obtainable during the quest; if travelling to Taverley Dungeon for the lava eel, without 70 Agility) OR a knife or slash weapon (if travelling to the Lava Maze for the lava eel)\n* Harralander potion (unf) (or a harralander and a vial of water)\n* Pickaxe\nIf you are a Black Arm Gang member (Note: If you are returning to the mansion after the quest to help another player, you do not need the black armour any more):\n* Black full helm\n* Black platebody\n* Black platelegs\nIf you are a Phoenix Gang member:\n* Some form of Ranged or Magic attack method (if using a Toxic Blowpipe make sure it is set to Longrange)",
    "recommended": "* \n* Weapons and armour to kill the Ice Queen\n* Stamina or energy potions\n* Anti-dragon or dragonfire shield to protect against the blue dragons' dragonfire breath\n* Antifire potion to protect against dragonfire breath (Note: Using both the potion and shield fully negates dragonfire damage)\n* Fast travel to several locations\n** Burthorpe (Games Necklace or Burthorpe Games Room grouping teleport)\n** Varrock (Varrock teleport, Chronicle, Ring of Wealth to the Grand Exchange or Combat Bracelet to the Champions' Guild)\n** Brimhaven (Brimhaven teleport, Teleport to House if it is in Brimhaven, charter ship or ship from Ardougne to Brimhaven or Amulet of Glory to Karamja)",
    "kills": "* Ice Queen (level 111) (unless you already have Ice Gloves)\n* Entrana firebird (level 2)\n* Jailer (level 47, optional)\n* Grip (level 22) (for Phoenix Gang members only)",
    "ironman": "[[File:Ultimate ironman chat badge.png]] The player briefly visits Entrana.",
    "template": "quest details"
  },
  {
    "start": "Speak to the Strange Old Man wandering in the Barrows, east of Mort'ton.",
    "startmap": "3565,3292",
    "difficulty": "Experienced",
    "description": "The Strange Old Man at the Barrows in Morytania has been acting even stranger than usual...",
    "length": "Short",
    "requirements": "*Priest in Peril",
    "items": "* Combat equipment to defeat the Barrows Brothers\n* Spade",
    "recommended": "*\n*Teleports to Barrows\n*Strange old lockpick\n*Ghommal's hilt 2 or higher - removes Prayer drain when worn",
    "kills": "* Verac the Defiled (level 115)\n* Dharok the Wretched (level 115)\n* Ahrim the Blighted (level 98)\n* Torag the Corrupted (level 115)\n* Karil the Tainted (level 98)\n* Guthan the Infested (level 115)",
    "template": "quest details"
  },
  {
    "description": "King Arthur is sending out his knights on a quest for the famous Holy Grail. If you are a Knight of the Round Table go to King Arthur for further orders.",
    "start": "Speak to King Arthur in Camelot.",
    "startmap": "2764,3513",
    "difficulty": "2",
    "length": "Short",
    "requirements": "*Completion of the following quests:\n**Merlin's Crystal\n* \n*Must be able to defeat a level 120 Black Knight Titan (can be safespotted or flinched)",
    "items": "*Excalibur",
    "recommended": "*\n*Halberd to attack the Black Knight Titan at range.\n** Note: The final damage must be dealt with Excalibur, so armour, food, or Protect from Melee is recommended.\n*If below 41 combat, a method to cure poison\n*Fast travel to several locations\n**Camelot (Camelot teleport)\n**Galahad's house, north of the Fishing Guild (Combat Bracelet to the Ranging Guild or Skills Necklace to the Fishing Guild)\n**Draynor Manor (Draynor manor teleport or Amulet of Glory)\n**Entrana (Balloon transport system or via Port Sarim using the Explorer's Ring 2 or Rat Pits minigame teleport)\n**Brimhaven (Brimhaven teleport, Teleport to House if your house is in Brimhaven, via a charter ship or via Captain Barnaby's ship from Ardougne using the Ardougne teleport or Ardougne cloak)\n**The Goblin Village (Goblin village sphere, Balloon transport system, Falador teleport or Teleport to House if your house is in Taverley)",
    "kills": "Black Knight Titan (level 120)",
    "ironman": "[[File:Ultimate ironman chat badge.png]] The player briefly visits Entrana.",
    "template": "quest details"
  },
  {
    "description": "Help an old goblin spirit return the remains of his successors to the lost goblin homeland.",
    "start": "Speak to Hopespear in the crypt of the Goblin Temple.",
    "startmap": "3742,4387",
    "difficulty": "Master",
    "length": "Short",
    "members": "Yes",
    "requirements": "* Started The Restless Ghost\n* Completion of Desert Treasure I\n* Completion of Fairytale II - Cure a Queen\n* Completion of Land of the Goblins\n*",
    "items": "* Ghostspeak amulet\n* Ring of visibility\n* Goblin potion\n* Dramen or lunar staff (unless the Lumbridge & Draynor Diary has been fully completed)\n* Food and potions to defeat 5 enemies without armour, weapons, or magic",
    "recommended": "* Combat Potions\n* \n* Plain of mud sphere or charged Skills necklace\n* Quick access to fairy rings",
    "kills": "* Snothead (level 32)\n* Snailfeet (level 56)\n* Mosschin (level 88)\n* Redeyes (level 121)\n* Strongbones (level 184)",
    "template": "quest details"
  },
  {
    "start": "Speak with Larrissa, who is outside the Lighthouse, north of Barbarian Outpost.",
    "startmap": "2508,3634",
    "difficulty": "2",
    "description": "The lighthouse protecting Kandarin's north-western coastline has mysteriously stopped operating, and contact with the lighthouse keeper Jossik has been lost.\n\nThe Council would greatly appreciate it if somebody could discover for them what has happened to this most vital landscape feature.",
    "length": "Short",
    "requirements": "* \n* Completion of  Alfred Grimhand's Barcrawl",
    "items": "*Fire rune\n*Air rune\n*Water rune\n*Earth rune\n*Any sword or longsword that you are willing to lose (except rusty sword and prop sword)\n*Any arrow (except ogre arrows and training arrows)\n*Molten glass\n*Tinderbox\n*Hammer\n* 60 steel nails\n* 2 regular planks (can be obtained from Barbarian Outpost)\n*Swamp tar\n*Means to deal melee and ranged damage\n*Means to deal damage with air, water, earth and fire spells",
    "recommended": "* \n* Armour and some food\n* for Protect from Missiles against the Dagannoth Mother's ranged attacks\n*Level 13+ Magic, in order to cast required spells to defeat the creature.\n* Fast travel to the Lighthouse (Fairy Rings to  or walk from the Barbarian Outpost using a Games Necklace or grouping teleport to the Barbarian Assault)",
    "kills": "* Dagannoth (level 100)\n* Dagannoth Mother (level 100)",
    "template": "quest details"
  },
  {
    "description": "In the deep south of the desert, unrest is brewing... The cities of the Menaphites have barred their gates to all. An unsettling desert wanderer may know of a secret entrance though, to Sophanem - the city of the dead.\n\nWill you become Icthlarin's Little Helper by entering? Enter into a titanic struggle for the soul of the high priest of Icthlarin in a land where the cat is top dog.",
    "start": "Speak to the wanderer in the camp west of the Agility Pyramid.",
    "startmap": "3315,2849",
    "difficulty": "2",
    "length": "Medium",
    "requirements": "* Completion of Gertrude's Cat\n* The ability to defeat a level 91 monster.",
    "items": "* Regular or overgrown cat, hellcat or kitten. No food is required as the kitten can stay in your inventory for the most part, or automatically go in/out of your inventory.\n* Tinderbox\n* Willow log\n* Bag of salt (can be bought from any Slayer Master, other players, or the Grand Exchange) or an empty bucket to obtain a pile of salt in Sophanem\n* Bucket of sap (use a knife on an evergreen tree or a regular tree with the description \"a commonly found tree\" with a bucket in your inventory)\n* Full waterskin to give away (can be bought for 30 coins at Shantay pass)\n* Linen (Can be bought on The Grand Exchange or bought from Raetul in Sophanem for 30 coins during the quest)\n* Means to enter the desert. (Such as the Shantay pass, Teleport tablets or scrolls, Fairy rings or the Pharaoh's sceptre)",
    "recommended": "* \n* Agility to jump over the pit in the pyramid (higher agility helps even more)\n* Waterskins for the desert heat\n* Knife to refill waterskins\n* Desert clothing to delay desert heat effect\n* 1–2 antipoison or superantipoison potions\n* Energy potions\n* Nardah teleport\n* Armour and some food\n* Ghostspeak amulet for story comprehension (Klenter)",
    "kills": "* Possessed Priest (level 91)\n* One of the level 75–81 guardians (randomly chosen):\n** Apmeken (level 75)—uses Magic\n** Crondis (level 75)—uses Magic\n** Scabaras (level 75)—uses Melee\n** Het (level 81)—uses Melee",
    "template": "quest details"
  },
  {
    "start": "Speak to Wizard Mizgog on the top floor of the Wizards' Tower.",
    "startmap": "3103,3164,plane:2",
    "difficulty": "Novice",
    "description": "The Wizard Grayzag has summoned hundreds of little imps. They have stolen a lot of things belonging to the Wizard Mizgog including his magic beads.",
    "length": "Short",
    "items": "* Black bead\n*Yellow bead\n*Red bead\n*White bead",
    "recommended": "*(Members only) Fast travel to the Wizards' Tower (Necklace of Passage, Amulet of Glory to Draynor Village, or Fairy Rings to )",
    "kills": "*Multiple imps (level 2) (optional unless ironman)",
    "template": "quest details"
  },
  {
    "start": "Go to Canifis and down the ladder behind the pub there, through the secret wall and squeeze past the stalagmite on the east side of the cave. Speak to Veliaf Hurtz.",
    "startmap": "3506,9839",
    "difficulty": "2",
    "description": "After the attack on the Myreque by Vanstrom Klause and with the deaths of both Sani and Harold, Veliaf is counting on you to help. Now that the Myreque freedom fighters' base camp has been revealed, they'll need to move on and set up base somewhere else.\n\nVeliaf has heard of a little known village south of Mort'ton, referred to as 'Burgh de Rott'. This could be just the place to set up operations to strike back against the evil of Lowerniel Vergidiyad Drakan and his Vampyric overlordship in Morytania. And who knows what other secrets about Morytania and its dark past will be revealed?",
    "length": "Medium",
    "requirements": "*Completion of the following quests:\n**In Search of the Myreque\n***Nature Spirit\n****Priest in Peril\n****The Restless Ghost\n* \n* \n* \n*",
    "items": "*A silver weapon to damage vampyres, which includes:\n** A blessed silver sickle (obtained during Nature Spirit)\n** A normal silver sickle\n** A blessed axe (obtained during Animal Magnetism)\n** A wolfbane dagger (obtained during Priest in Peril, which is a prerequisite for this quest)\n** Silver-, Dark-, or Arclight\n** Any weapon whilst wearing an Efaritay's aid\n\n*Food\n*A spade\n*A bucket (up to 5 recommended)\n*Any pickaxe\n*A hammer\n*11 planks (Only regular planks will work.)\n*44 nails (42 are obtainable during the quest)\n*Swamp paste\n*10 raw mackerel or 10 raw Snail meats (depending on what is asked)\n*10 bronze axes\n*4 tinderboxes\n*2 steel bars\n*Coal\n*Soft clay\n*Rope\n*A silver bar\n*A mithril bar\n*A sapphire\n*On the standard spellbook for Lvl-1 Enchant:\n**A cosmic rune\n**A water rune\n*Optional to give to Ivan Strom (Strongly recommended if you don't have a high combat level 85+):\n**A steel med helm\n**A steel chainbody\n**Steel platelegs\n**A silver sickle\n**15 cooked salmon, snails, slimy eels, or stew",
    "recommended": "*\n*Completion of Shades of Mort'ton for access to the Shades of Mort'ton (minigame) teleport.\n*Partial completion of Fairytale II - Cure a Queen for quick access to Canifis via Fairy rings (code ).\n* to use the  fairy ring, which skips the swamp and most ghasts.\n*A dramen staff\n*A slayer ring\n*Several Mort'ton teleport scrolls/Barrows teleport tablets\n*Efaritay's aid (allow you to harm vampyres with any weapon)\n*A big fishing net and  (in case you are asked to supply mackerel)\n*Amulet of glory to teleport to Edgeville furnace",
    "kills": "*Gadderanks (level 35)\n*2 Vampyre Juvinates (level 54)\n*2 Vampyre Juvinates (level 75) or 4 level 50s depending on route taken",
    "ironman": "*  or obtaining Mithril bar as a drop.",
    "template": "quest details"
  },
  {
    "start": "Brother Aimeri, towards the south-eastern end of the Forthos Dungeon.",
    "startmap": "1840,9926",
    "difficulty": "Experienced",
    "description": "Assist Brother Aimeri in uncovering the mysteries that lie in the Forthos Dungeon.",
    "length": "Medium",
    "requirements": "None - but a high combat level is recommended.",
    "items": "* Combat equipment\n* 5 pieces of food (must be meat, fish or vegetables)\n* A slash weapon or knife to cut through webs",
    "recommended": "*",
    "kills": "Varies",
    "template": "quest details"
  },
  {
    "start": "Speak to Vanstrom Klause at the Hair of the Dog tavern in Canifis.",
    "startmap": "3503,3477",
    "difficulty": "2",
    "description": "Canifis is experiencing an upsurge in new faces and a new stranger has appeared with a job to track down some local heroes known only as \"The Myreque\". The Myreque are fighting a desperate battle against the darkness of Morytania and he wishes to take them weapons to aid in the battle. Can you help him out?",
    "length": "Short",
    "requirements": "* Completion of the following quests:\n** Nature Spirit\n*** Priest in Peril\n*** The Restless Ghost\n* \n* The ability to defeat a level 97 foe (safespottable)",
    "items": "* A steel longsword\n* 2 steel swords\n* A steel mace\n* A steel warhammer\n* A steel dagger\n* 225 steel nails\n:Note: It takes 9 steel bars to make all of steel items required (excluding nails, which can be purchased at the Sawmill; including nails, the amount is 24 steel bars). 39 Smithing is needed to smith these steel items. To make it a bit easier to obtain these as an Ironman, one can buy the two swords, longsword, and dagger from the Varrock Swordshop, mace from Flynn's Mace Market in Falador and the warhammer from Keldagrim's Vigr's Warhammers.\n* A Druid pouch containing at least 5 charges\n:Note: The pouch takes 3 per fill (need 6 Mort myre fungus or 3 Mort myre pear or Mort myre stem to have enough charges).\n* A hammer (imcando hammer works)\n* 6 planks\n* 10 coins or a ring of charos (a)",
    "recommended": "* \n* Prayer (for Protect from Melee)\n* The Silver sickle (b) to fill the druid pouch and to collect fungi\n* Prayer potions\n* Food\n* Mort'ton teleports",
    "kills": "* Skeleton Hellhound (level 97)",
    "template": "quest details"
  },
  {
    "start": "Talk to Maisa inside Osmumten's tomb at the Necropolis.",
    "startmap": "3351,2718",
    "difficulty": "Master",
    "description": "Long ago, the people of the Kharidian Desert lived prosperous, luxurious lives, under the watchful eyes of their beloved gods.\n\nAll that changed when Amascut, the Goddess of Rebirth, became corrupted. She was reborn as The Devourer, intent on consuming every living soul in existence.\n\nDeep within the desert, an ancient tomb has long hidden a great power – and The Devourer is determined to harness it at any cost.\n\nIf she succeeds, all hope is lost. You must traverse the tomb's many obstacles and foil her evil plans... before it's too late.",
    "length": "Medium",
    "members": "Yes",
    "requirements": "* Completion of Beneath Cursed Sands",
    "recommended": "* \n* Equipment to complete a full run of Tombs of Amascut raid",
    "kills": "* Akkha (level 337)\n* Ba-Ba (level 359)\n* Kephri (level 341)\n* Zebak (level 371)\n* Tumeken's Warden (level 489)\n* Elidinis' Warden (level 489)",
    "template": "quest details"
  },
  {
    "start": "Speak to Trufitus at Tai Bwo Wannai.",
    "startmap": "2810,3086",
    "difficulty": "Novice",
    "description": "Trufitus Shakaya of the Tai Bwo Wannai Village requires that you collect five special jungle herbs for a potion so he can commune with his Gods.",
    "length": "Short",
    "requirements": "* \n* The ability to defend against level 53 Jogres and level 46 Harpie Bug Swarms.\n* Completion of Druidic Ritual",
    "recommended": "* \n* 1-2 Antidote++ or other Antipoison potions\n* Food\n* Stamina potions\n* Fast travel to the Tai Bwo Wannai Village (Brimhaven teleport, Teleport to House if your house is in Brimhaven, charter ship or ship from Ardougne to Brimhaven, Fairy Rings to or Amulet of Glory to Karamja)\n* Spade to dig up the Clue hunter trousers\n*A 1-dose Superantipoison spawns at the Observatory Dungeon entrance for Ironmen",
    "ironman concerns": "A 1-dose Superantipoison spawns at the Observatory Dungeon entrance",
    "template": "quest details"
  },
  {
    "start": "Talk to the Gossip, outside Sinclair Mansion.",
    "startmap": "2742,3554",
    "difficulty": "3",
    "description": "Life has been quiet at the Sinclair Mansion since you discovered the murderer... too quiet. So quiet, in fact, that the family has gone!\n\nSuspicions are running high that the Sinclairs' recent departure is tied to the disappearance of King Arthur and his knights. But time is running short and clues are scarce, will you crack the case in time?",
    "length": "Medium",
    "requirements": "* \n* (if an ironman)\n* \n*Completion of the following quests:\n**Black Knights' Fortress\n**Holy Grail\n***Merlin's Crystal\n**Murder Mystery\n**One Small Favour\n***Rune Mysteries\n***Shilo Village\n****Jungle Potion\n*****Druidic Ritual",
    "items": "*Granite (any size)\n*Telekinetic Grab runes (1 air rune and 1 law rune) (can be obtained during the quest)\n*Full black armour (Black full helm, platebody, and platelegs/plateskirt)—Note: Trimmed versions of black armour will work. (h) versions will not work\n*A bronze med helm (can be purchased from Peksa's Helmet Shop. in the Barbarian Village, or picked up inside Draynor Manor near the exit)\n*An Iron chainbody (Both the Iron Chainbody and the Bronze med helm can be bought upstairs in the Warrior Guild Armoury. If you can't access the Warriors' Guild you can get an Iron Chainbody from Wayne's Chains in Southern Falador, Horvik's Armour Shop in central Varrock, or the Grand Exchange)\n*Animate rock scroll (obtainable during the quest). Note: if you have it in your bank, either destroy it or take it with you. You won't be able to receive another from Wizard Cromperty otherwise.",
    "recommended": "*A teleport to Ardougne to talk to Wizard Cromperty\n*A teleport to Camelot for a quick access to Seers' Village and Camelot\n*A combat bracelet, amulet of glory, or Lassar Teleport for fast access to the Black Knight's Fortress.\n*A Dramen staff or Lunar staff with code for quick travel to Sinclair Mansion\n*Salve graveyard teleports for quick access to fairy ring",
    "template": "quest details"
  },
  {
    "start": "Enter the Lair of Tarn Razorlor.",
    "startmap": "3424,9661",
    "difficulty": "Experienced",
    "length": "Medium",
    "description": "This miniquest is to kill Tarn Razorlor and retrieve his diary. Using his diary on a salve amulet will enchant it increasing its attack and strength bonuses by 5%.",
    "members": "Yes",
    "requirements": "* \n*The Haunted Mine quest is required to access Tarn's Lair.",
    "items": "*100 coins required each time you use the banker Odovacar (optional)",
    "kills": "Level 69 mutant Tarn, followed by a level 69 ghost Tarn",
    "recommended": "*\n*Slayer ring (allows one to skip the \"Getting to Tarn Razorlor\" section and start right at entrance into Tarn's Lair)",
    "template": "quest details"
  },
  {
    "start": "Speak to Grubfoot in the Dorgesh-Kaan mine.",
    "startmap": "3319,9616",
    "difficulty": "Experienced",
    "description": "The most ancient goblin legends speak of Yu'biusk, the far-off land that saw the origin of the goblin race. Now, one goblin has had a vision of this land and believes it is Zanik's destiny to lead all goblins to live there in peace and safety - but Zanik will not be able to realise her destiny without your help.",
    "length": "Medium",
    "requirements": "*Completion of the following quests:\n**Another Slice of H.A.M.\n***Death to the Dorgeshuun\n****The Lost Tribe\n*****Goblin Diplomacy\n*****Rune Mysteries\n***The Giant Dwarf\n***The Dig Site\n**Fishing Contest\n* \n* \n* \n*",
    "items": "* A light source\n* Toadflax potion (unf)\n* Goblin mail (obtainable during quest)\n* Yellow dye\n* Blue dye\n* Orange dye\n* Purple dye\n* Black dye (black mushroom obtainable during quest)\n** An empty vial and a pestle and mortar if making the black dye during the quest\n* Fishing rod\n* Raw slimy eel\n* 5 coins",
    "recommended": "*\n* Combat equipment\n* Tinderbox if not using a non-extinguishable light source\n* Two or more Dorgesh-kaan spheres (obtainable during quest with law runes and molten glass) \n* A dramen or lunar staff for using fairy rings\n* A skills necklace to reach the Makeover Mage, Fishing Guild and Goblin Cave quicker\n* A combat bracelet to reach Hemenster quicker, as well as the Fishing Guild and Goblin Cave\n* Teleports to Lumbridge\n* Teleports to Draynor Village\n*Explorer's ring 3 or 4\n*Salve amulet (e) or Salve amulet",
    "kills": "* Snothead (level 32)\n* Snailfeet (level 56)\n* Mosschin (level 88)\n* Redeyes (level 121)\n* Strongbones (level 184)",
    "template": "quest details"
  },
  {
    "start": "Talk to the Legends' Guards just outside of the Legends' Guild.",
    "startmap": "2728,3349",
    "difficulty": "4",
    "description": "Only the elite are allowed to call themselves a Legend of RuneScape. Do you have what it takes to make it into the guild?",
    "length": "Long",
    "requirements": "Note: Only the quest requirements must be met to start this quest. If you do not have the skill requirements, you may be unable to continue at certain points until you meet them.\n* \n* \n*  \n*  \n*  \n*  \n*  \n*  \n*  \n*  \n*  \n* Completion of the following quests:\n** Family Crest\n** Heroes' Quest\n*** Shield of Arrav\n*** Lost City\n*** Merlin's Crystal\n*** Dragon Slayer I\n** Shilo Village\n*** Jungle Potion\n**** Druidic Ritual\n** Underground Pass\n*** Biohazard\n**** Plague City\n** Waterfall Quest\n* The ability to defeat a level 187 demon",
    "items": "* Any machete (can be obtained during the quest - a regular one can be found by searching the cupboards next to Radimus Erkle)\n* 2 gold bars (6 in case you fail or want more gold bowls)\n* Hammer\n* Rope\n* Rune, Dragon or Infernal axe\n* Lockpick (2 in case you fail) (Strange old lockpick does not work)\n* Pickaxe\n* Vial of water\n* Ardrigal\n* Snake weed\n* One of each cut gem up to diamond:\n** Sapphire\n** Emerald\n** Ruby\n** Diamond\n** Opal\n** Jade\n** Red topaz\n* Soul rune\n* Mind rune\n* 2 law runes\n* Earth rune\n* Unpowered orb and runes to cast any Charge Orb once (requires the standard spellbook equipped - two casts are needed if taking the \"long path\" during the second fight with the demon)\n* Charcoal (2-3 in case it breaks -- obtainable during the quest if travelling via Shilo Village)\n* 3 Papyrus (4-5 in case one is torn -- obtainable during the quest if travelling via Shilo Village or from the spawn on Radimus's desk)",
    "recommended": "* \n* Super restore potion if your levels are not far above the following required levels, as failing will reduce them and you might need them for certain objectives:\n** to squeeze through the crevice behind the bookcase\n**  to pick the first Ancient Gate\n**  to smash the boulders\n**  to force the second Ancient Gate\n* Items that give a temporary skill boost to skip some levels in skilling (such as Botanical pies,Summer pies, Dwarven stouts and Axeman's Folly)\n* Weapon, armour, food and several prayer potions\n* Fast travel to the Legends' Guild (Ardougne teleport or Fairy rings to )\n* Fast travel to the Karamjan jungle (Brimhaven teleport, Teleport to House if it is in Brimhaven, charter ship or ship from Ardougne to Brimhaven, Fairy rings to  or Amulet of Glory to Karamja)",
    "kills": "* Ranalph Devere (level 92) — 2 times\n* Irvig Senay (level 100) — 2 times\n* San Tojalon (level 106) — 2 times\n* Nezikchened (level 187) — 3 times",
    "template": "quest details"
  },
  {
    "description": "Can you find the legendary lost city of Zanaris?",
    "start": "Go to Lumbridge Swamp. Talk to the campers there.",
    "startmap": "3150,3205",
    "difficulty": "2",
    "length": "Short",
    "requirements": "* \n* \n*Ability to kill a level 101 Tree spirit with limited armour and weapons.",
    "items": "* Knife\n* Woodcutting axe (you will need to bank the axe before accessing Entrana -- you cannot use a blessed axe)",
    "recommended": "* \n* Some Stamina potions\n* Some food (armour is not allowed on Entrana)\n* Prayer potion for the Entrana Dungeon (highly recommended if using Melee, Prayer is almost fully drained when entering the dungeon)\n* Some rings of recoil (highly recommended if using Melee)\n* Magic and enough runes to cast Crumble Undead against the Zombies and the Tree Spirit, who are susceptible to it (about 65 casts should be enough)\n* A Celastrus bark to fletch into a Battlestaff for an added Magic bonus (Requires  Fletching)\n* Arrows, bow string and an unstrung bow as an alternative to Magic against the Zombies\n* Any instant teleport to leave the Entrana Dungeon\n* Fast travel to the Lumbridge Swamp (A charged Ring of the elements, Lumbridge teleport or Necklace of Passage to the Wizards' Tower)",
    "kills": "* Tree Spirit (level 101) (Safespottable) \n* Multiple Zombies (level 25) (for a bronze axe)",
    "ironman": "[[File:Ultimate ironman chat badge.png]] The player is required to go to Entrana.",
    "template": "quest details"
  },
  {
    "start": "Speak to Lokar Searunner at the westernmost dock of Rellekka.",
    "startmap": "2620,3689",
    "difficulty": "3",
    "description": "Can you make it to Moonclan Island and make peace between the Moonclan and the Fremenniks?",
    "length": "Long",
    "requirements": "*Completion of the following quests:\n** The Fremennik Trials\n** Lost City\n** Rune Mysteries\n** Shilo Village\n*** Jungle Potion\n**** Druidic Ritual\n* \n* \n* \n* \n* \n* \n* \n*:Note: Lokar will not talk to you if you do not have all of the required non-boostable stats.\n*The ability to kill multiple level 111 monsters.\n*Access to each of the elemental runic altars (Air, Fire, Water, Earth)",
    "items": "*A tinderbox\n*A few coins (1,000 is enough)\n*A guam leaf (common drop from a Suqah during the quest)\n*A marrentill (common drop from a Suqah during the quest)\n*A pestle and mortar\n*A hammer\n*2 spools of thread (obtainable during quest)\n*A needle (obtainable during quest)\n*Any axe (bronze axe obtainable during quest)\n*Any pickaxe\n*A spade\n*A finished bullseye lantern (NOT (unf) NOR (empty). If you cannot obtain one, bring means to get to a lamp oil still instead. Swamp tar can be obtained during the quest.)\n*All elemental talismans or their respective tiaras (Air, Water, Earth and Fire, or an Elemental talisman), or access to the Abyss, or the Guardians of the Rift minigame\n*A dramen staff\n*Runes for the final boss fight as Lunar equipment must be worn (elemental staves not equipable)\n*Combat equipment",
    "recommended": "*\n*Fast travel to Rellekka: Enchanted lyre (obtained during The Fremennik Trials), Fremennik sea boots, Rellekka teleport tablets, fairy ring (code ), or Camelot Teleport and run\n*Fast travel to each of the elemental altars (either via the Abyss, the Guardians of the Rift, or to the Air near the Crafting Guild, Fire near the Emir's Arena, Water in Lumbridge Swamp, Earth near the Sawmill)\n*Extra dramen staves (if interested in making more lunar staves for free)\nIf you cannot obtain a bullseye lantern, bring:\n*Teleport to House runes/tablet (if POH is in Rimmington, redirection scrolls if not) or other means to get to Rimmington.\n\nThis is expensive but to save time you can also bring Ring of the elements to teleport to all of the altars as well as use an Elemental tiara to save 8 inventory slots.",
    "kills": "*Multiple Suqah (level 111)\n*Me (level 79)",
    "template": "quest details"
  },
  {
    "start": "Speak to Kolodion at the Mage Arena bank located in level 53 Wilderness.",
    "startmap": "2538,4716",
    "difficulty": "Experienced",
    "length": "Short",
    "requirements": "*",
    "items": "*Runes or a powered staff to fight Kolodion\n*Something to cut webs (knife, slash weapon or any Wilderness sword)",
    "recommended": "*",
    "kills": "Kolodion in the form of a Black Demon (level 112)",
    "ironman": " [[File:Hardcore ironman chat badge.png]] This quest requires travel to the deep, level 56 Wilderness. Caution must be taken not only getting to the arena but also during the miniquest. Player-killers are able to attack you while you are doing the minigame fight.",
    "template": "quest details"
  },
  {
    "start": "Speak to Kolodion at the Mage Arena bank located in level 53 Wilderness.",
    "startmap": "2538,4716",
    "difficulty": "Master",
    "length": "Medium",
    "requirements": "*Completion of Mage Arena I\n* \n*Cast Claws of Guthix, Flames of Zamorak, and Saradomin Strike each 100 times inside the Mage Arena.",
    "kills": "Porazdir (level 235), Justiciar Zachariah (level 348), and Derwen (level 235)",
    "items": "*God staves\n*Runes to cast god spells (air, fire, and blood)\n*Item to cut webs (knife, slash weapon or any Wilderness sword)",
    "recommended": "*",
    "description": "Can you defeat the followers of the gods?",
    "ironman": " [[File:Hardcore ironman chat badge.png]] This quest requires travel to the deep, level 56 Wilderness, and can require travel through various multi-combat Wilderness areas as well. Beware of Player-killers at all times.",
    "template": "quest details"
  },
  {
    "start": "Talk to Burntmeat in the Troll Stronghold's kitchen.",
    "startmap": "2841,10060,plane:1",
    "difficulty": "Master",
    "description": "My Arm, the troll from My Arm's Big Adventure, must embark on another journey of discovery. This time, you'll be escorting him to Weiss, a newly discovered troll town in the far north of the world, so he can share his wisdom *cough* with the inhabitants, in exchange for learning about their inventions.\n\nLife's journeys can take us to some strange places, but My Arm is about to face the greatest adventure of all - true love. Plus, they'd like him to kill the Wise Old Man of Draynor Village, which doesn't sound like a clever move. Can you help My Arm get a grip on the situation and woo the fair Snowflake over the objections of her father, Mother? Or will My Arm be left to a loveless life of loneliness?",
    "length": "Medium",
    "requirements": "* \n* \n* \n* \n*It is beneficial to have a higher Agility level.\n*Completion of the following quests:\n**My Arm's Big Adventure\n***Eadgar's Ruse\n****Druidic Ritual\n****Troll Stronghold\n*****Death Plateau\n***The Feud\n***Jungle Potion\n**Swan Song\n***One Small Favour\n****Rune Mysteries\n****Shilo Village\n***Garden of Tranquillity\n****Creature of Fenkenstrain\n*****Priest in Peril\n*****The Restless Ghost\n**Cold War\n**Romeo & Juliet",
    "items": "*Saw\n*Bolt of cloth\n*5 mahogany planks\n*Cadava berries\n*Bucket of water (obtainable during quest)\n*Rope (obtainable during quest)\n*Pickaxe (obtainable during quest)\n*Hammer (obtainable during quest)\n*Combat equipment (preferably Melee or Ranged)\n*Climbing boots (if not using Trollheim teleports)",
    "recommended": "*\n*A teleport to Draynor Village\n*Access to fairy rings\n*Stamina potions\n*Trollheim teleports\n*A Varrock teleport\n*A Rellekka teleport",
    "kills": "*Don't Know What (Level 163)\n*Mother (level 198)",
    "template": "quest details"
  },
  {
    "start": "Talk to Jorral in the outpost north-west of West Ardougne.",
    "startmap": "2435,3346",
    "difficulty": "2",
    "description": "A secluded outpost has served the City of Ardougne for generations, playing stage to many exceptional events. Its current occupant wants to employ your skills to construct its true history before time runs out and history itself is wiped away!",
    "length": "Short",
    "requirements": "*Completion of the following quests:\n**Priest in Peril\n**The Restless Ghost",
    "items": "*Spade\n*Sapphire amulet\n*Ghostspeak amulet or Morytania legs 2 or higher\n\n*A way to enter Port Phasmatys\n**Completion of Ghosts Ahoy or\n**2 ecto-token or\n**1 bone, 1 pot and 1 bucket to earn 5 ecto-tokens (you still only need two) or\n**4,100 gold for a Charter ship to Port Phasmatys (cheaper depending upon where you travel from and if you use ring of charos).",
    "recommended": "*Teleport runes for Ardougne Teleport or Ardougne teleport tablets\n*Ectophial\n*Ring of dueling\n*Enchanted lyre, Rellekka teleport tablets or Fremennik Sea Boots 1 or higher\n*Necklace of passage (to teleport to Jorral instead of walking from Ardougne)\nor access to:\n*Fairy rings (or Teleport to House if player's house is in Rellekka),\n*Stamina or Energy potions",
    "template": "quest details"
  },
  {
    "description": "The wizard Merlin has been trapped in a magical crystal by the witch Morgan Le Faye. So far, King Arthur hasn't been able to figure out how to free his mentor from his crystal prison. Can you help?",
    "start": "Talk to King Arthur in Camelot.",
    "startmap": "2764,3513",
    "difficulty": "2",
    "length": "Short",
    "requirements": "Must be able to defeat a level 39 enemy.",
    "items": "*Bread\n*Tinderbox\n*Bucket of wax (obtainable during the quest with Insect repellent, a bucket spawns near the beekeeper)\n*Bat bones (obtainable during the quest)",
    "recommended": "*\n*Stamina or energy potions\n*Fast travel to several locations\n**Camelot (Camelot teleport)\n**Falador (Falador teleport)\n**Varrock (Varrock teleport, Chronicle or Combat Bracelet to the Champions' Guild)\n**Taverley (Taverley teleport, Balloon Transport System or Teleport to House if your house is in Taverley)\n**Port Sarim (Explorer's Ring 2, Rat Pits or Pest Control minigame teleport, or Teleport to House if your house is in Rimmington)",
    "kills": "* Sir Mordred (level 39)\n* Giant bat (level 27) (optional, to acquire bat bones)",
    "template": "quest details"
  },
  {
    "start": "Speak to Abigale (or Hewey, who sits next to her) in the south-eastern corner of Lumbridge Swamp, near the fishing spots.",
    "startmap": "3236,3155",
    "difficulty": "Novice",
    "description": "A woman cries as a man lays dying, desperately they beg you to stop a cryptic killer before their friends suffer a similar fate.",
    "length": "Short",
    "items": "* Bucket (obtainable during quest)\n*Tinderbox (obtainable during quest)\n*Knife (obtainable during quest)",
    "kills": "None",
    "template": "quest details"
  },
  {
    "start": "Speak to Brother Omad at the Ardougne Monastery south of East Ardougne.",
    "startmap": "2606,3209",
    "difficulty": "1",
    "description": "A monk's child has had their blanket stolen. Find the thieves' den and return the blanket, then help Brother Omad organise the drinks for the child's birthday party.",
    "length": "Very Short",
    "requirements": "The ability to run past two level 14 thieves, and one level 26.",
    "items": "* Jug of water\n* Regular logs or a regular plank",
    "recommended": "* Fast travel to the Ardougne Monastery (Ardougne cloak, Fishing Trawler minigame teleport or Fairy rings to )",
    "template": "quest details"
  },
  {
    "start": "Talk to King Narnode Shareen in the Grand Tree.",
    "startmap": "2466,3495",
    "difficulty": "4",
    "description": "The King of the northern Gnomes, Narnode Shareen, is once again in need of your help. He recently decided to send an envoy of his Royal Guard, the 10th squad, to oversee the decommissioning of the Gnome owned ship-building facilities on the eastern coast of Karamja.\n\nIt has been quite some time since the 10th squad were dispatched and they have been deemed missing in action. It will be up to you, should you decide to help, to find out what fate befell the 10th squad and if possible, track them down.\n\nIf only it were so simple. Sinister forces have begun to spread through the Gnome hierarchy and threaten to unleash an unknown terror upon the world. Far across the land, the fires of vengeance are being stoked once again. Can you unravel the mystery behind the deception? Can you separate the truth from the lies? Can you decide for yourself what is real and what is not?",
    "length": "Long",
    "requirements": "* Completion of the following quests:\n** The Grand Tree\n** Tree Gnome Village\n* The ability to defeat a level 195 Jungle Demon",
    "items": "* A gold bar\n* An empty inventory slot\n* A ball of wool\n* Monkey bones or corpse from Karamja (obtainable during quest)",
    "recommended": "* \n* Prayer highly recommended, as the player will be attacked by numerous hard-hitting melee enemies in multicombat\n* Poison cures such as antipoison potions or antidote++ potions\n* Energy-restoring items such as energy potions and stamina potions\n* Prayer potions\n* A knife for free healing, as there are pineapple plants around Ape Atoll\n* High healing food\n* A Lockpick\n* Weight-reducing clothing\n* Emergency teleport (a ring of life works as well)\n* Ardougne cloak 1 or Ardougne teleports [[File:Ardougne teleport (tablet).png]]\n* A ring of dueling to bank quickly (the Ardougne cloak could be used instead, somewhat further from a bank; the Battlefield of Khazard has a spirit tree, the gnome stronghold has a bank and the glider service)\n* 200,000 coins (if skipping the puzzle)",
    "kills": "* Jungle Demon (level 195)",
    "ironman": "*  (to make the gold bar if not dropped by a monster) or   to tele-grab a gold bar from Varrock West bank. A gold bar is also a reward from The Digsite, Goblin Diplomacy, and Waterfall Quest",
    "template": "quest details"
  },
  {
    "start": "Talk to King Narnode Shareen in the Grand Tree. (You must have all the requirements to start the quest).",
    "startmap": "2466,3495",
    "difficulty": "6",
    "description": "Glough, the war criminal set on eradicating humans and overthrowing Gielinor, has escaped the watch of the Grand Tree gnomes.\n\nWith a history of leaving large-scale conflicts and warfare in his wake, Glough must be tracked down and stopped. King Narnode Shareen needs your help.",
    "length": "Very Long",
    "requirements": "*Completion of the following quests:\n**Enlightened Journey\n***Balloon flight route to Gnome Stronghold must be unlocked to start the quest.\n**The Eyes of Glouphrie\n**Recipe for Disaster (Freeing King Awowogei)\n***Monkey Madness I\n****The Grand Tree\n****Tree Gnome Village\n**Troll Stronghold\n***Death Plateau\n**Watchtower\n* \n* \n* \n* \n* \n* (for Gnome Stronghold Route)\nIt is beneficial to have a high Combat and Agility level.",
    "items": "*A lemon\n*Grapes\n*A pestle and mortar\n*A pickaxe (if you choose the tanking route)\n*Logs\n*A light source\n*A hammer (obtainable on island)\n*A chisel (obtainable on island)\n*An m'speak amulet\n*A monkey talisman (obtainable on island)\n*A ninja monkey greegree (small or medium)\n*A slash weapon (to slash webs if you choose the tanking route - Wilderness sword of any tier recommended for this due to 100% web slash ability).\n*The Translation book from The Grand Tree. If you have lost it a replacement can be obtained from King Narnode during the quest.",
    "recommended": "* \n*Magic logs (for flying back to Gnome Stronghold)\n*Food (monkfish or better)\n*Stamina potions\n*Prayer potions\n*Antidote+ or Serpentine helm\n*A good weapon\n*Weight-reducing clothing such as Graceful outfit\n*Armour with high Melee/Ranged Defence\n*A one-click emergency teleport",
    "kills": "*Kruk (level 207)\n*Keef (level 178)\n*Kob (level 185)\n*7 Tortured gorillas (level 142)\n*2 Tortured gorillas (level 141)\n*2 Demonic gorillas (level 275)\n*Glough (level 431)",
    "ironman": "[[File:Ultimate ironman chat badge.png]] The player briefly visits Entrana.",
    "template": "quest details"
  },
  {
    "start": "Talk to Hamal the Chieftain in the Mountain Camp east of Rellekka. To get in, take the path north of the Golden Apple Tree and use a rope on the rock behind the guard (see below for more details).",
    "startmap": "2808,3672",
    "difficulty": "Intermediate",
    "description": "Ages ago, a small tribe of people split off from the Fremennik in Rellekka and decided to inhabit the mountains to the east of town. There they lived as nomads for many years, but now the chieftain of the camp has lost his daughter and will not move on before she has been found. Has she run away, has she been eaten by trolls, or is there something more sinister going on? Only you can find out.",
    "length": "Medium",
    "requirements": "* \n* The ability to defeat a level 70 monster (can be safespotted)",
    "items": "* Rope\n* Pickaxe\n* Axe\n* Plank\n* Staff or a pole (obtainable during the quest, Dramen Staff does not work, but elemental staves do work)\n* Gloves (excluding: Slayer, Mystic, Ranger, Moonclan, Lunar, vambraces, and random event apparel)",
    "recommended": "* \n* Stamina or energy potions\n* Weight-reducing clothing\n* Fast travel to the White Wolf Mountain (Gnome Glider or alternatively a Camelot teleport)\n* Fast travel to the Mountain Camp (Slayer Ring or Fairy Rings to and head north)\n* Fast travel to Rellekka (Enchanted lyre or Fremennik sea boots, or House teleport if your house is in Rellekka)\n* 8 free inventory spaces",
    "kills": "* The Kendal (level 70)",
    "template": "quest details"
  },
  {
    "start": "Talk to Eluned inside the elven woods of Isafdar.",
    "startmap": "2206,3159",
    "difficulty": "4",
    "description": "It seems at last Arianwyn has need of your skills.\n\nHe believes there is more to the Mourners than meets the eye and he wishes for you to find out just what they're up to. Can you gain the trust of the Mourners?",
    "length": "Medium",
    "requirements": "* \n* \n*The ability to defeat a level 11 enemy with your combat stats set to 20 each.\n*Completion of the following quests:\n**Roving Elves\n***Regicide\n****Underground Pass\n*****Biohazard\n******Plague City\n***Waterfall Quest\n**Big Chompy Bird Hunting\n**Sheep Herder",
    "items": "*Bear fur\n*2 silk\n*Each of these dyes: red, yellow, green, and blue (can be bought during the quest for each)\n*Bucket of water\n*Feather\n*Rotten apple (must be the rotten apple on the ground north of the Mourner Headquarters in West Ardougne, obtainable during the quest)\n*Toad crunchies or Premade t'd crunch\n*Magic logs\n*Leather\n*Ogre bellows (obtainable during the quest)\n*Barrel of naphtha, or 5-9 coal to make one\n*7 empty inventory spaces for the Mourner gear",
    "recommended": "*\n*Weapon\n*Food if your combat level is low\n*Ardougne or West Ardougne teleport tablets (runes may be inconvenient as your Magic will be lowered by the Mourner)\n*Ring of dueling to reset drained stats at the Pool of Refreshment in the Ferox Enclave\n*Necklace of passage for faster access to Arandar, via the Outpost\n*Fast travel to Feldip Hills (Feldip hills teleport, Gnome glider, Fairy rings to or the Eagle transport system to the jungle)\n*Fast travel to Rimmington, if you have not yet made a barrel of naphtha (Rimmington teleport or Teleport to House if it located there, Skills necklace to the Crafting Guild or a Falador teleport)",
    "kills": "Mourner (level 11) (will decrease all combat skills to 20, including Hitpoints)",
    "template": "quest details"
  },
  {
    "start": "Speak to Arianwyn in Lletya.",
    "startmap": "2838,3285",
    "difficulty": "Master",
    "description": "This chapter of the quest takes our hero deep under the mountains of Arandar to put a stop to the evil plans of the mourners.\n\nIf our hero is to succeed, they must solve one of the most complicated puzzles in all of Gielinor.",
    "length": "Long",
    "requirements": "*Completion of the following quests:\n**Mourning's End Part I\n***Roving Elves\n****Regicide\n*****Underground Pass\n******Biohazard\n*******Plague City\n****Waterfall Quest\n***Big Chompy Bird Hunting\n***Sheep Herder",
    "items": "*Full mourner clothes\n*A chisel (one can be found in the house south of the Mourner HQ)\n*A death talisman/tiara for regular players and ironmen with 90+ Slayer, or else 50 junk items (for other Ironmen). A catalytic talisman/tiara may also be used.\n*Rope",
    "recommended": "*\n* for lesser chances of failing obstacles (91 to never fail)\n* for Protect from Melee against the Shadows\n*Teleports to West Ardougne:\n**Minigames teleport to Rat Pits (Ardougne) available every 20 minutes after completion of Ratcatchers quest\n**West Ardougne Teleport or its tablet\n**Ardougne Teleport or its tablet\n*A teleport crystal\n*Lots of food, prayer potions, and stamina potions. Summer pies provide an excellent source of food, since they boost 5 Agility levels, restore 10% run energy, and give 22 health per pie. Alternatively, stackable purple sweets, which restore 10% run energy and 2 health, may be used.\n*High Prayer bonus armour (e.g. proselyte or initiate armour, a god book, a holy symbol, a broodoo shield).\n*A melee weapon that provides a Prayer bonus, such as any mace, Godsword, Zamorakian hasta, ancient mace, silver sickle (b), crozier, dragon mace, Void Knight mace, the Ivandis flail, blisterwood flail, or Wolfbane. The ancient mace's special attack can be useful as it refills prayer points. The Ivandis and blisterwood flails weigh 0 kg.\n*One pure essence to craft a Death rune once in the Death Altar at the end of the quest (requires, needed for hard Ardougne Diary), can be done easier via the Abyss later but might save time for Ultimate or Hardcore Ironmen",
    "kills": "None (but powerful level 73 Shadows are aggressive to players inside the temple)",
    "template": "quest details"
  },
  {
    "start": "The Sinclair Mansion, north along the path between Seers' Village and Camelot. Talk to one of the guards around the mansion.",
    "startmap": "2741,3562",
    "difficulty": "Novice",
    "description": "Old man Sinclair has been found dead in his mansion! Unfortunately, the local authorities are having some trouble figuring out who's the guilty party. Maybe the unbiased eye of a passing adventurer will be of help.",
    "length": "Short",
    "items": "* Pot",
    "recommended": "* 16 empty inventory spaces\n* Weight-reducing clothing",
    "template": "quest details"
  },
  {
    "start": "The kitchen, deep in the Troll Stronghold. Talk to Burntmeat.",
    "startmap": "2845,10056,plane:1",
    "difficulty": "3",
    "description": "Trolls love goutweed. They love it so much that they've picked it all, and now they can't get any more. However, in his smelly kitchen in the Troll Stronghold, Burntmeat the cook has heard a rumour that goutweed is growing once again, for anyone who's got the skill to farm it. Can you teach his young assistant - a simple troll known as My Arm - to grow the precious goutweed? Will you overcome My Arm's stubbornness and ignorance to earn yourself Burntmeat's reward? Dare you accompany My Arm on this uniquely trollish expedition?",
    "length": "Medium",
    "requirements": "* \n* to cut thatches and repair the fence for Tai Bwo Wannai favour, otherwise you will have to kill monsters spawned by other players \n*Completion of the following quests:\n**Eadgar's Ruse\n***Druidic Ritual\n***Troll Stronghold\n****Death Plateau\n**The Feud\n**Jungle Potion\n*At least 60% favour in the Tai Bwo Wannai Cleanup minigame before starting this quest - this will be subtracted from the total favour",
    "items": "*Bucket (can be obtained during the quest, south of the cooking pot on Death Plateau)\n*3 Ugthanki dung, or the following materials to gather it:\n**Red hot sauce (obtainable in Pollnivneach) or the Camulet (from Enakhra's Lament quest)\n**Spade\n**3 additional buckets\n*Several farming supplies, which can be stored by any Tool Leprechaun and withdrawn from the Trollheim Tool Leprechaun - except for Supercompost, these may also be purchased from this Leprechaun:\n**7 Supercompost (must be Supercompost, one extra can be used later rather than the plant cure so 8 total)\n**Spade\n**Rake\n**Seed dibber\n**Plant cure",
    "recommended": "*\n* for Protection prayers\n* for Trollheim Teleport\n*Fast travel to Al-Kharid (ring of dueling or amulet of glory) or Pollnivneach (Pollnivneach Teleport or coins to use the magic carpet system) to obtain Ugthanki Dung \n*Fast travel to Death Plateau (games necklace to Burthorpe or combat bracelet to the Warriors' Guild)\n*Climbing boots, if walking from the Troll Stronghold to Death Plateau (can be bought from Tenzing for 12 coins)\n*Stamina or energy potions\n*Food, armour, and a weapon\n* A Machete if you have less than 60% favour in the Tai Bwo Wannai Cleanup minigame",
    "kills": "*Baby Roc (level 75)\n*Giant Roc (level 172)",
    "template": "quest details"
  },
  {
    "description": "After saving the holy man Drezel, he's seeking some assistance again.\nThis time he has a special request for any adventurous sorts to search for the Druid 'Filliman Tarlock' and brave the terrors that infest the swamp of Mort Myre.",
    "start": "Speak to Drezel under the Paterdomus Temple near the River Salve.",
    "startmap": "3440,9894",
    "difficulty": "Intermediate",
    "length": "Short",
    "requirements": "* Completion of Priest in Peril\n* Completion of The Restless Ghost",
    "items": "* Silver sickle - either purchase it from the Grand Exchange, or make it with a silver bar and sickle mould in a furnace. Ironmen can buy a silver bar from the Silver merchant in Ardougne.\n* Ghostspeak amulet\n* 6 empty inventory spaces",
    "recommended": "* \n* Weapon, armour and some food (Ghasts can rot your food if your Druid Pouch is empty)\n*Stamina or energy potions\n*Prayer potions\n*2 Salve Graveyard Teleports to teleport near Drezel",
    "kills": "* 3 Ghasts (level 30)",
    "ironman": "*  (in order to create a silver sickle)",
    "template": "quest details"
  },
  {
    "start": "Talk to the Observatory professor in the Observatory Reception Room north of Castle Wars.",
    "startmap": "2441,3187",
    "difficulty": "Intermediate",
    "description": "The Observatory in south-west Ardougne has been ransacked by a family of nearby goblins. Can you help the professor to rebuild it?",
    "length": "Short",
    "requirements": "None",
    "items": "* 3 normal planks\n* Bronze bar\n* Molten glass",
    "recommended": "* \n* Ring of dueling to Castle Wars for easy access to the Observatory\n* Antipoison (a 1-dose superantipoison spawns in a house next to the entrance to the Observatory Dungeon)\n* Armour and some food for lower levels\n* Stamina or energy potions\n*, , (all stats boostable), a crossbow and mith grapple to create a permanent shortcut to the Observatory after completion of the quest.",
    "kills": "* Goblin guard (level 42) (Optional – can simply be trapped behind a column)",
    "template": "quest details"
  },
  {
    "start": "Speak to Olaf Hradson by the isthmus leading to the Rellekka Hunter area.",
    "startmap": "2724,3729",
    "difficulty": "2",
    "description": "Poor Olaf Hradson. He has to live up to such expectations. His ancestors sailed all over the world, and now he has to go out and prove himself their equal. If only he could read a map... If only he could sail... If only he hadn't crashed! Can you help a depressed and soggy Fremennik regain his pride, and possibly the lost treasure of his grandfather?",
    "length": "Short",
    "requirements": "*Completion of The Fremennik Trials\n* \n* \n*The ability to defeat a level 100 monster",
    "items": "*Any woodcutting axe\n*Tinderbox\n*Spade\n*6 Ropes (can be obtained during the quest)\n*4 free inventory slots (10 if not bringing your own ropes)",
    "recommended": "*\n* is an advantage (57+ for Rellekka east fence shortcut)\n*Combat equipment (using Crumble Undead and/or a salve amulet (i) is useful here as all enemies are undead)\n*Food and prayer potions\n*Summer pies or agility potions\n*Stamina or energy potions\n*Fast travel to Olaf (Fairy Rings to, Enchanted Lyre, Fremennik sea boots, House teleport if your house is in Rellekka, or Slayer Ring to Fremennik Slayer Dungeon)",
    "kills": "*Skeleton fremennik (level 40)\n*Ulfric (level 100) (safespottable)",
    "template": "quest details"
  },
  {
    "start": "Speak to Yanni Salika in Shilo Village.",
    "startmap": "2835,2987",
    "difficulty": "3",
    "description": "If you're new to Shilo Village after solving the mystery (or even if you did it some time ago), you may like to check out Yanni Salika's antiques shop.\n\nHe's a busy chap, revamping antique items, checking out new stock from potential adventurers and maybe he'll have a small(1) favour to ask of you? Probably nothing particularly large, Yanni isn't a demanding(2) person, should hardly take you any time(3) at all really, something to do when you have a spare moment.\n\nThat's assuming there aren't any complications.\n\n1: - Perception of the word \"small\" may be open to interpretation.\n\n2: - In a recent vote, Yanni Salika was only voted the second most demanding person in Shilo Village.\n\n3: - As everyone knows, time is relative.",
    "length": "Long",
    "requirements": "* Completion of the following quests:\n** Rune Mysteries\n** Shilo Village\n*** Jungle Potion\n**** Druidic Ritual\n* \n*  \n*  \n*",
    "items": "* 4 steel bars\n* Bronze bar\n* Iron bar\n* Chisel (Obtainable during the quest)\n* The ingredients required to make a Guthix rest:\n** 2 Guam leaves\n** Marrentill\n** Harralander\n** Bowl of hot water (Obtainable during the quest)\n** Empty cup (Obtainable during the quest)\n* Hammer (Obtainable during the quest)\n* 5 pigeon cages (Obtainable during the quest)\n** Note: The pigeons do not need to be let out of the cages.\n* Pot (Obtainable during the quest)\n* Soft clay (Obtained during the quest)\n* Two of each of the following gems, cut or uncut: (Two of each uncut gem are obtained during the quest)\n** Opal\n** Jade\n** Red topaz\n** Sapphire",
    "recommended": "* \n* Weight-reducing clothing and stamina or energy potions.\n* Fast travel to several locations\n** Shilo Village (travel to Brimhaven and take the cart or use Fairy Rings to )\n** Port Sarim and Draynor Village (Amulet of Glory or Explorer's Ring 2)\n** Varrock (Varrock teleport)\n** Barbarian Village and Dwarven Mine (Skull Sceptre or Combat Bracelet to the Edgeville Monastery)\n** Taverley (House teleports or Balloon transport system)\n** White Wolf Mountain (Gnome Glider)\n** Catherby and Seer's Village (Camelot teleport, or Catherby teleport and Combat Bracelet teleport to the Ranging Guild)\n** Fishing Guild (Skills Necklace or Fishing guild teleport)\n** East Ardougne (Ardougne teleport)\n** Port Khazard (Ardougne cloak teleport to the Ardougne Monastery, Khazard teleport or Fishing Trawler Grouping teleport)\n** Feldip Hills (Feldip hills teleport or use Fairy Rings to or the jungle Eagle transport system)\n* The highest level Pickaxe you can wield to fight the Slagilith (damage dealt by other weapons is reduced by 67%)\n* Armour and some food\n* Lockpick to enter the H.A.M. Hideout if your Thieving level is low",
    "kills": "* Slagilith (level 92)\n* Dwarf gang members (level 44/48/49) (Multicombat area)",
    "template": "quest details"
  },
  {
    "start": "Speak to Redbeard Frank at the northernmost dock at Port Sarim, just outside The Rusty Anchor.",
    "startmap": "3052,3252",
    "difficulty": "1",
    "description": "Redbeard Frank knows the location of pirate treasure, but he'll only part with the knowledge for a bottle of Karamjan rum.",
    "length": "Very Short",
    "requirements": "Able to defeat or run away from a Combat level 4 gardener.",
    "items": "*Karamjan rum (obtainable during the quest for 30 coins)\n*White apron (obtainable during the quest in Port Sarim at Gerrant's Fishy Business.)\n*60 coins (only 30 is needed if using a Ring of charos(a))\n*10 bananas (obtainable during the quest)\n*Spade (obtainable during the quest)",
    "recommended": "*Varrock Teleport\n*Falador Teleport",
    "kills": "Gardener (level 4, optional)",
    "template": "quest details"
  },
  {
    "start": "Talk to Edmond, living next to the wall surrounding West Ardougne, north of Ardougne Castle.",
    "startmap": "2569,3333",
    "difficulty": "Novice",
    "description": "The western part of Ardougne has been shut off as a deadly plague sweeps through the people. However, a young woman who went in to try to help those stricken by the illness has disappeared and her parents have become worried.",
    "length": "Very Short",
    "items": "* Dwellberries (Spawns in McGrubor's Wood, squeeze through the loose railing, use, or Telekinetic Grab them. They can be bought from Heckel Funch or Hudo in the Tree Gnome Stronghold or grown with 36 Farming.)\n*Rope (Purchasable in the East Ardougne general store, Port Khazard general store, Ned, or a spawn in Karamja general store.)\n*Spade (One spawns near Edmond.)\n*4 buckets of water (Can be used one-by-one, there is a water source and bucket spawn near Edmond)\n*Hangover cure or the ingredients to make one:\n**Chocolate dust\n***Chocolate bar\n***Knife or pestle and mortar\n**Bucket of milk (Obtained by using a bucket on a dairy cow, one is north of Ardougne, or bought from Hudo or Heckel Funch.)\n**Snape grass (Spawns west of the Crafting Guild or the peninsula north-east of Hosidius. It can be grown at 61 Farming. Can also be obtained from killing Tribesmen in Karamja.)\n*Picture of Elena (Inside Alrena and Edmond's house)",
    "ironman": "* [[File:Ultimate ironman chat badge.png]] The hangover cure can be made before the quest starts by combining milk, chocolate dust, and snape grass to conserve inventory space.",
    "template": "quest details"
  },
  {
    "description": "Recently contact has been lost with the temple to Saradomin on Misthalins' Eastern border. King Roald would be very interested to know what has caused this lack of communication, and seeks an adventurer willing to report back to him on the situation.",
    "start": "Speak to King Roald in the Varrock Palace.",
    "startmap": "3221,3473",
    "difficulty": "1",
    "length": "Short",
    "members": "Yes",
    "items": "* 50 unnoted rune essence or pure essence (can be mined by talking to Aubury in Varrock, after completing Rune Mysteries. All 50 essence does not have to be of the same type.)\n* Bucket (spawns above the Varrock Castle's kitchen in the north-easternmost room (go to the kitchen, and climb up the stairs))",
    "recommended": "* \n* Essence pouches - optional, but helps carry more essence.\n* Food (recommended for low levels)\n* 3 Varrock teleports\n* Stamina potions or (super) energy potions",
    "kills": "* Temple guardian dog (level 30) You cannot use Magic. A Ring of recoil will not register that you killed the Temple guardian.\n* Monk of Zamorak (level 30)",
    "template": "quest details"
  },
  {
    "start": "Speak to Hassan in the palace at Al Kharid.",
    "startmap": "3301,3163",
    "difficulty": "1",
    "description": "Prince Ali of Al Kharid has been kidnapped by the scheming Lady Keli. You are hired to stage a rescue mission.",
    "length": "Short",
    "requirements": "The ability to get past aggressive combat level 26 jail guards.",
    "items": "*Soft clay\n*3 balls of wool\n*Yellow dye or 2 onions and 5 coins\n*Redberries\n*Ashes\n*Bucket of water or jug of water (obtainable during quest)\n*Pot of flour\n*Bronze bar\n*Pink skirt\n*3 beers\n*Rope (can be bought during the quest at Ned for 18 coins or 4 balls of wool)\n*At least 100 coins",
    "recommended": "* \n*(Members only) Fast travel to Al Kharid (Amulet of Glory or Ring of Dueling)\n*(Members only) Fast travel to Draynor Village (Amulet of Glory or Necklace of Passage to Wizards' Tower)",
    "kills": "Jail guard (level 26, optional)",
    "template": "quest details"
  },
  {
    "start": "Speak to Chancellor Hassan in the palace at Al Kharid.",
    "difficulty": "1",
    "description": "Prince Ali of Al Kharid has been kidnapped by the scheming Lady Keli. You are hired to stage a rescue mission.",
    "length": "Short",
    "requirements": "These skills are given upon setting up the speedrun:\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*",
    "items": "These items are provided upon setting up the speedrun:\n* 100 Coins\n* 1 Stamina potion(4)\n* 3 energy potion(4)\n* 2 tuna",
    "template": "quest details"
  },
  {
    "start": "Speak to the Odd Old Man, located at the end of the northern path in central Silvarea.",
    "startmap": "3360,3504",
    "difficulty": "1",
    "description": "Everybody needs some body, and the Odd Old Man knows exactly which bits of those bodies he needs. Can you help him finish his extensive and extremely creepy collection?",
    "length": "Short",
    "requirements": "None",
    "items": "*8 coins for 8 pots of vinegar (bring 68 coins if walking to and from Karamja for boat fare)\n*8 pots\n*8 logs of any type (or an axe to obtain them)\n*Tinderbox\n*Light source (a lantern is highly preferred)",
    "recommended": "*\n*Teleport runes or tablets to Varrock and Lumbridge\n*Digsite pendant or Digsite teleport for quick access to the Odd Old Man's house\n*Amulet of Glory for quick access to Draynor Village and Karamja\n*Dramen staff for Fairy Ring teleports\n*Access to the Balloon transport system and Willow logs to use it\n*Spiny helmet if using the Lumbridge Swamp entrance -- alternatively, stop one square before the \"hole in the wall\", then run past using the run trick.\n*Rope if using the Lumbridge Swamp entrance for the first time",
    "kills": "Several (8): see below.",
    "template": "quest details"
  },
  {
    "start": "Speak to the Odd Old Man, located at the end of the northern path in central Silvarea.",
    "startmap": "3362,3507",
    "difficulty": "Experienced",
    "description": "An archeological bone gathering quest. Requires the start and/or completion of multiple quests. Lots of creatures and animals necessary to be scavenged for specific bones, that will then need to be cleaned and given to the Odd Old Man for his marvelous collection of bone remains.",
    "length": "Medium",
    "members": "Yes",
    "requirements": "* \n* to wield a mirror shield to kill a basilisk (though not necessary; see below)\n*Completed Rag and Bone Man I\n*Completed Skippy and the Mogres\n*Completed Horror from the Deep or partial completion of The Fremennik Trials\n*Partial completion of Creature of Fenkenstrain\n*Partial completion of Zogre Flesh Eaters (recommended but not strictly required)\n*Partial completion of Waterfall Quest\n*The ability to kill several high-level monsters",
    "items": "*27 pots\n*27 jugs of vinegar (bought from Fortunato for 27 coins)\n*27 sets of logs (any logs - normal logs can be obtained on the path just below the Odd Old Man's hut if you bring an axe).\n*Tinderbox\n*Light source\n*Dusty key (if under )\n*Rope\n*Combat gear to kill zogres (an ogre composite bow with brutal arrows or runes for Crumble Undead casts is advised)\nSlayer equipment:\n*Ice coolers\n*Fishing explosives\n*Mirror shield or V's shield (unless using a workaround - see guide for how to get around using this)",
    "recommended": "*\n*Anti-dragon shield (if concerned about blue dragons while in Taverley Dungeon)\n*Inoculation bracelet, or Relicym's balm or Sanfew serum (to deflect or cure disease when killing zogres)\n*Dramen staff or lunar staff would save a great deal of time by using fairy rings\n*Digsite pendant\n*Ectophial\n*Fenkenstrain's Castle Teleport\n*Ring of dueling\n*Enchanted lyre\n*Games necklace\n*Runes or tablets for teleporting all across Gielinor (if no better travelling method is available)\nSlayer Equipment:\n*Spiny helmet or Slayer helmet",
    "kills": "Several (27): see below.",
    "template": "quest details"
  },
  {
    "start": "Talk to Gertrude west of Varrock.",
    "startmap": "3150,3412",
    "difficulty": "2",
    "description": "Gertrude knows of some ratcatchers in Varrock, pay her a visit and she may tell you of their whereabouts. Perhaps they could show you and your cat a few pointers about rat catching.\n\nEnter the subterranean world of the rat catchers and discover more of your cat's true potential.",
    "length": "Medium",
    "requirements": "*Completion of the following quests:\n**Icthlarin's Little Helper\n***Gertrude's Cat\n\n*Access to Keldagrim \n**The Giant Dwarf started",
    "items": "*Any type of cat or hellcat (for most of the quest, a cat with a high successful rat catch rate is recommended, and overgrown cats cannot be used there -- during the Hooknosed Jack part of the quest, any cat with strong combat stats is recommended)\n*4 cheese (or 4 Poisoned cheese)\n*Rat poison (if cheese is not already poisoned; can be found in the Clock Tower Basement), or made during the quest with the following items:\n**Empty vial\n**Cleaned kwuarm (grimy will not work; Zahur in Nardah cleans grimy herbs for 200 coins)\n**Red spiders' eggs\n*Cleaned marrentill (grimy will not work)\n*Unicorn horn dust\n*Bucket of milk\n*Catspeak amulet (unless Dragon Slayer II is completed)\n*Pot of weeds (use an empty pot with weeds)\n*Tinderbox\n*101 coins (or 51 coins with a ring of charos (a))\n*Snake charm (obtained during the quest)",
    "recommended": "*Some fish to heal your cat (any type of raw or cooked fish will do including raw karambwanji, except leaping trout/leaping salmon)\n*Ring of charos (a) to spend fewer coins on Ali the Snake Charmer\n*Fast travel to several locations\n**Varrock (Varrock teleport, Chronicle or Combat Bracelet to the Champions' Guild)\n**Port Sarim (Rimmington teleport, Teleport to House if your house is in Rimmington, Explorer's Ring 2, Amulet of Glory to Draynor Village, Skills Necklace to the Crafting Guild or Fairy Rings to )\n**Pollnivneach (Pollnivneach teleport, Teleport to House if your house is in Pollniveach or Magic Carpet transport)\n**Ardougne (Ardougne teleport)\n**Keldagrim (Blast Furnace grouping teleport, Varrock teleport, Ring of Wealth to the Grand Exchange or Fairy rings to or )",
    "kills": "None, but your cat will have to fight the King rat",
    "template": "quest details"
  },
  {
    "start": "Speak to the Cook in the kitchen of Lumbridge Castle.",
    "startmap": "3208,3214",
    "difficulty": "Special",
    "description": "The cook in Lumbridge has a surprisingly small number of ingredients on hand in his kitchen, possibly as a result of an endless stream of newcomers with light fingers, taking anything that isn't nailed down from his kitchen.\n\nLuckily, in the past, a kind Cook's Assistant was willing to help him in his culinary duties, but a problem has now appeared that could spell... a Recipe For Disaster!\n\nAlmost all members may attempt to solve his tricky predicament, and be rewarded accordingly, but only the very elite of Questers will be able to put an end to his problem permanently!",
    "length": "Very Long",
    "requirements": "To start the quest and finish the first chapter:\n* \n*Completion of Cook's Assistant\nTo complete all chapters of the quest:\n*All prerequisite quest requirements\n* (9 are earned for the other parts of the quest, and 79 are gained by completing all required quests)\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n*The ability to defeat high leveled monsters, several of which have to be defeated without using \n*Completion (or partial completion where stated) of the following quests:\n**Fishing Contest\n**Goblin Diplomacy\n**Big Chompy Bird Hunting\n**Murder Mystery\n**Nature Spirit\n***Priest in Peril\n***The Restless Ghost\n**Witch's House\n**Gertrude's Cat\n**Shadow of the Storm\n***Demon Slayer\n***The Golem\n**Started Legends' Quest up until gaining access to the Kharazi Jungle\n***Family Crest\n***Heroes' Quest\n****Shield of Arrav\n****Lost City\n****Merlin's Crystal\n****Dragon Slayer I\n***Shilo Village\n****Jungle Potion\n*****Druidic Ritual\n***Underground Pass\n****Biohazard\n*****Plague City\n**Monkey Madness I\n***The Grand Tree\n***Tree Gnome Village\n**Desert Treasure I\n***The Dig Site\n***The Tourist Trap\n***Temple of Ikov\n***Waterfall Quest\n***Troll Stronghold\n****Death Plateau\n**Horror from the Deep\n***Alfred Grimhand's Barcrawl",
    "items": "To start the quest and finish the first chapter:\n*Eye of newt\n*Greenman's ale\n*Rotten tomato\n*Any fruit blast excluding a premade fr' blast\n*Ashes\nTo complete all chapters of the quest:\n*About 320 coins (or 120 if you have the activated Ring of charos)\n*Bowl of water (an empty bowl can be bought from the Culinaromancer's Chest)\n*Bucket of water (an empty bucket can be bought from the Culinaromancer's Chest)\n*3 buckets of milk (can be bought from the Culinaromancer's Chest)\n*2 eggs (can be bought from the Culinaromancer's Chest)\n*Orange\n*Banana (obtainable during the quest)\n*Any dye except red, yellow, or orange\n*Spice or gnome spice (can be bought from the Culinaromancer's Chest)\n*Gloves (ice gloves are preferred)\n*Charcoal\n*Fishing bait\n*Fishbowl\n*2 bread\n*Pestle and mortar\n*Needle\n*3 bronze wires\n*Cake tin (can be bought from the Culinaromancer's Chest)\n*4 Asgarnian ale (6 recommended)\n*Any cat except an overgrown cat (you'll be chasing rats, so a wily cat is recommended)\n*Several bowls of stew (9 at most)\n*Raw chompy (several recommended in case of burning)\n*Raw chicken\n*Raw cod\n*Iron spit\n*Regular logs\n*Tinderbox\n*Ball of wool\n*Ogre bellows (obtainable during the quest)\n*Ogre bow and several ogre arrows (10 is enough)\n*2 pots of flour (can be bought from the Culinaromancer's Chest)\n*Pot of cornflour (or raw sweetcorn and an empty pot)\n*Pot of cream (can be bought from the Culinaromancer's Chest)\n*Any axe\n*Any pickaxe\n*Any machete\n*Knife\n*Dramen staff and branch\n*M'speak amulet\n*Gorilla, ninja and zombie greegree (or 3000 coins and combat equipment if making the greegrees during the quest)\n*Monkey nuts (or 3 coins)\n*Rope",
    "kills": "*Icefiend (level 13) (only if you lack ice gloves)\n*5 Mudskippers (level 30/31)\n*Crab (level 21/23)\n*Evil Chicken (level varies) (see below)\n*Black dragon (level 227)\n*Big Snake (level 84)\n*Zombie monkey (levels 82/129)\n*Monkey guard (level 167)\n*Ninja monkey (level 86)\n*Agrith-Na-Na (Level 146)\n*Flambeed (level 149)\n*Karamel (level 136)\n*Dessourt (level 121)\n*Gelatinnoth Mother (level 130)\n*Culinaromancer (level 75)",
    "template": "quest details"
  },
  {
    "start": "The Cook in Lumbridge Castle's kitchen.",
    "difficulty": "Special",
    "description": "The cook in Lumbridge has a surprisingly small number of ingredients to hand in his kitchen, possibly as a result of an endless stream of newcomers with light fingers taking anything that isn't nailed down from his kitchen.\n\nLuckily, in the past a kind Cook's Assistant was willing to help him in his culinary duties, but now a problem has appeared that could spell... a Recipe For Disaster!\n\nAlmost all members may attempt to solve his tricky predicament, and be rewarded accordingly, but only the very elite of Questers will be able to put an end to his problem permanently!",
    "length": "Short",
    "requirements": "* \n*Completion of Cook's Assistant",
    "items": "*Eye of newt\n*Greenman's ale\n*Rotten tomato\n*Any fruit blast excluding a premade fr' blast\n*Ashes",
    "template": "quest details"
  },
  {
    "start": "Release each member of the council from the Culinaromancer's spell.",
    "difficulty": "Special",
    "description": "The Culinaromancer has retreated through the portal back to his own dimension, where he'll be ready to cause more trouble. Aris has said that you too must go through the portal to finish him off.",
    "length": "Short",
    "requirements": "*\n*Completion of the following quests:\n**Desert Treasure I\n***The Dig Site\n***Temple of Ikov\n***The Tourist Trap\n***Troll Stronghold\n****Death Plateau\n***Priest in Peril\n***Waterfall Quest\n**Horror from the Deep\n***Alfred Grimhand's Barcrawl miniquest\n**Freeing Evil Dave\n**Freeing the Goblin generals\n**Freeing the Lumbridge Guide\n**Freeing the Mountain Dwarf\n**Freeing Pirate Pete\n**Freeing Sir Amik Varze\n**Freeing Skrach Uglogwee\n**Freeing King Awowogei\n*The ability to defeat all enemies without Prayer",
    "items": "*Ice gloves for defeating Flambeed\n*Menaphite remedy or restore potions since Karamel will lower your stats\n*Certain armour and weapons for each boss\n*Good healing food, such as sharks",
    "kills": "*Agrith-Na-Na (level 146)\n*Flambeed (level 149)\n*Karamel (level 136)\n*Dessourt (level 121)\n*Gelatinnoth Mother (level 130)\n*Culinaromancer (level 75)",
    "template": "quest details"
  },
  {
    "start": "Inspect Evil Dave in the Lumbridge Castle Dining Room.",
    "difficulty": "Special",
    "description": "Evil Dave needs some kind of spicy stew. You will need Evil Dave's help for this one. He lives in his mother's basement...",
    "length": "Medium",
    "requirements": "* (only required if you make the stews yourself)\n*Completion of the following quests:\n**Gertrude's Cat\n**Recipe for Disaster/Another Cook's Quest\n***Cook's Assistant\n**Shadow of the Storm\n***Demon Slayer\n***The Golem",
    "items": "*Any cat except an overgrown cat (note that each cat has a different effective rat catch rate -- kittens or lazy cats are not recommended)\n*Several bowls of stew (9 at most)",
    "recommended": "* Fast travel to Lumbridge (Lumbridge teleport)\n* Fast travel to Edgeville (Amulet of Glory, Fairy Rings to, Ring of Wealth to the Grand Exchange or a Varrock teleport)\n* Fish if using a kitten to catch rats, or if you want to battle hell-rat behemoths after the quest (buckets of milk can also substitute for hell-rat behemoth fights)\n* Bucket of milk if you want to revert your cat back from a hellcat.",
    "template": "quest details"
  },
  {
    "start": "Inspect Awowogei.",
    "difficulty": "Special",
    "description": "Awowogei needs his favourite food, but nobody seems to know what it is. Maybe you should go talk to him in his palace.",
    "length": "Long",
    "requirements": "* \n* \n*Completion of the following quests:\n**Monkey Madness I\n***The Grand Tree\n***Tree Gnome Village\n**Recipe for Disaster/Another Cook's Quest\n***Cook's Assistant\n*The ability to defeat a level 84 Big Snake",
    "items": "*M'speak amulet\n*Karamjan monkey greegree (unless you already have another greegree)\n*Gorilla, Ninja monkey and Zombie monkey greegree (can be obtained during the quest with a Monkey Talisman each)\n*Banana (can be obtained during the quest)\n*Monkey nuts or around 10 coins to buy some.\n*Rope\n*Knife or slashing weapon\n*Pestle and mortar",
    "kills": "*Big Snake (level 84) - (recommended to kill several as they burn often when cooking)\n*To obtain the greegrees:\n**Zombie monkey (levels 82/129)\n**Monkey guard (level 167)\n**Ninja monkey (level 86)",
    "recommended": "*\n*Antipoison\n*Stamina potions\n*Food and Prayer potion(s)\n*Ranged or Magic equipment (for killing a Monkey guard if you're obtaining a monkey talisman during the quest)",
    "template": "quest details"
  },
  {
    "start": "Inspect Pirate Pete.",
    "difficulty": "Special",
    "description": "Pirate Pete needs a fishcake to be protected. Talk to the Lumbridge Cook to learn how to make one.",
    "length": "Medium",
    "requirements": "* \n* Completion of the following quests: \n**Recipe for Disaster/Another Cook's Quest\n***Cook's Assistant\n*The ability to defeat 5 level 30 monsters.",
    "items": "*A raw cod (It's highly recommended to get at least 3 of all the ingredients, as the Fishcake can burn)\n*A pestle and mortar\n*Bread (at least 3 recommended)\n*A knife\n*A fishbowl (empty)\n*A needle\n*3 bronze wire",
    "kills": "*5 Mudskippers (level 30/31)\n*Crab (level 21/23)",
    "ironman": "[[File:Ultimate ironman chat badge.png]] This quest has a weight limit.\n* (If crafting a fishbowl yourself or by completing Rum Deal)\n*  (To make the bronze wire.)",
    "template": "quest details"
  },
  {
    "description": "Sir Amik Varze requires a crème brulee supreme. Talk to the Cook to learn how to make one in this complicated but fun subquest.",
    "start": "Inspect Sir Amik Varze.",
    "difficulty": "Special",
    "length": "Medium",
    "requirements": "*\n\n*Access to the Kharazi Jungle\n**Started Legends' Quest\n*Completion of the following quests:\n**Family Crest\n**Heroes' Quest\n***Shield of Arrav\n***Lost City\n***Merlin's Crystal\n***Dragon Slayer I\n**Recipe for Disaster/Another Cook's Quest\n***Cook's Assistant\n**Shilo Village\n***Jungle Potion\n****Druidic Ritual\n**Underground Pass\n***Biohazard\n****Plague City\n**Waterfall Quest\n*The ability to defeat a level 227 Black dragon",
    "items": "*Bucket of milk (can be bought from the Culinaromancer's Chest)\n*Pot of cream (can be bought from the Culinaromancer's Chest)\n*Pot of cornflour\n*Vanilla pod or tools to get one:\n** Any axe (the Blessed axe will not work!)\n** Any machete (as well as Radimus notes if you haven't completed Legends' Quest)\n*Dramen staff or Lunar staff to enter Zanaris\n*Dramen branch to make cinnamon\n*Pestle and mortar\n*Ice gloves\n*Raw chicken",
    "kills": "*Evil Chicken (level varies) (see below)\n*Black dragon (level 227)",
    "ironman": "[[File:Ultimate ironman chat badge.png]] The player visits Entrana [[File:Ultimate ironman chat badge.png]] Advised to collect your dramen branch beforehand as the brulee does not appear on death piles.\n*  to plant sweetcorn in order to make Pot of cornflour.",
    "recommended": "*\n*Anti-dragon or dragonfire shield\n*Antifire potion",
    "template": "quest details"
  },
  {
    "start": "Inspect Skrach Uglogwee.",
    "difficulty": "Special",
    "description": "To protect Skrach Uglogwee from the Culinaromancer, you need to feed him a cooked jubbly bird, the most delicious type of Chompy in the Feldip Hills. You need to talk to Rantz to learn how to get one.",
    "length": "Medium",
    "requirements": "* \n* \n*Completion of the following quests:\n**Big Chompy Bird Hunting\n**Recipe for Disaster/Another Cook's Quest\n***Cook's Assistant",
    "items": "*Axe (a blessed axe will not work)\n*Raw chompy (bring several if you have a low cooking level)\n*Iron spit (made on an anvil with an iron bar)\n*Logs (can be obtained during the quest)\n*Tinderbox\n*Pickaxe\n*Ogre bellows (can be obtained during the quest)\n*Ball of wool\n*Ogre bow or comp ogre bow with ogre arrows (ogre bow can be purchased from Rantz during the quest for at most 600 coins)",
    "recommended": "*Antipoison, armour and some food (if low leveled)\n*Chisel, knife, wolf bones and feathers if you are making your own ogre arrows\n*Fast travel to several locations\n**Lumbridge (Lumbridge teleport)\n**Feldip Hills (Feldip Hills teleport, Fairy Rings to or the Eagle Transport System)\n**Tai Bwo Wannai (Tai Bwo Wannai teleport, Fairy Rings to  or travel via Brimhaven)",
    "ironman": "* for an iron spit without access to Weiss",
    "template": "quest details"
  },
  {
    "start": "Inspect one of the goblin generals in the Lumbridge Castle dining room.",
    "difficulty": "Special",
    "description": "The goblin generals need a food that they'll both eat. Find a chef in Goblin Village to learn how to make it.",
    "length": "Short",
    "requirements": "Completion of the following quests:\n*Recipe for Disaster/Another Cook's Quest\n**Cook's Assistant\n*Goblin Diplomacy",
    "items": "*Bread\n*Orange slices\n** Use a knife on an orange\n*Either blue, green or purple dye (purple dye spawns directly east of the spirit tree at the Khazard Battlefield, south of the Ardougne Castle)\n*Spice or Gnome spice (can be bought or stolen from the Ardougne market, bought from the Culinaromancer's Chest or bought in the Tree Gnome Stronghold)\n*Fishing bait\n*Bucket of water\n*Charcoal or Ground charcoal (buy in Shilo Village or Jiminua's Jungle Store.)",
    "recommended": "*Falador teleport\n*Lumbridge teleport",
    "template": "quest details"
  },
  {
    "start": "Inspect the Lumbridge Guide.",
    "difficulty": "Special",
    "description": "You need a cake of guidance to protect the Lumbridge Guide. Wizard Traiborn in the Wizards' Tower can teach you how to make one.",
    "length": "Short",
    "requirements": "* \n*Completion of the following quests:\n**Big Chompy Bird Hunting\n**Biohazard\n***Plague City\n**Demon Slayer\n**Murder Mystery\n**Nature Spirit\n***Priest in Peril\n***The Restless Ghost\n**Recipe for Disaster/Another Cook's Quest\n***Cook's Assistant\n**Witch's House",
    "items": "*A bucket of milk\n*An egg\n*A pot of flour\n*A cake tin\n(All required items can be bought from the Culinaromancer's Chest)\n\nRecommended:\n*Grouping teleport to Guardians of the Rift minigame\n*Necklace of passage or access to fairy rings and a Lunar/Dramen staff (for quick transportation to Wizards' Tower)",
    "template": "quest details"
  },
  {
    "start": "Inspect the frozen dwarf in the Lumbridge Castle dining room to start the quest.",
    "difficulty": "Special",
    "description": "To save the dwarf, you will need a special dwarven rock cake. Only his father in the tunnel under White Wolf Mountain knows how to make one.",
    "length": "Short",
    "requirements": "*Completion of the following quests:\n**Recipe for Disaster/Another Cook's Quest\n***Cook's Assistant\n**Fishing Contest\n*The ability to defeat a level 13 icefiend if you don't have the ice gloves.",
    "items": "*About 320 coins (or 120 if you have the activated ring of charos)\n*Bucket of milk (can be bought from the Culinaromancer's Chest)\n*Pot of flour (can be bought from the Culinaromancer's chest)\n*Egg (can be bought from the Culinaromancer's chest)\n*Bowl of water (a bowl and sink can be found in the kitchen of Lumbridge Castle)\n*4 Asgarnian ales (can be bought during the quest at the Rising Sun Inn in Falador)\n*Gloves, If not using gloves make sure to bring Telekinetic Grab spell runes (Ice gloves are the best, but other gloves will work fine too)",
    "kills": "Icefiend (level 13) (only if you lack ice gloves)",
    "recommended": "*Fast travel to several locations\n**Falador (Falador teleport)\n**Lumbridge (Lumbridge teleport)\n**White Wolf Mountain (Taverley teleport, Teleport to House if your house is in Taverley, Camelot teleport or a Gnome Glider)\n**Ice Mountain, if you have no access to ice gloves (Combat bracelet to Monastery or Skull Sceptre\n*2 additional Asgarnian ales (in case Rohak sobers up)\n*Additional ingredients (bucket of milk, pot of flour and egg—in case you drop or lose the cake)",
    "template": "quest details"
  },
  {
    "start": "Speak to Sir Amik Varze on the of the White Knights' Castle's western tower in Falador.",
    "startmap": "2959,3336,plane:2",
    "difficulty": "1",
    "description": "The Temple Knights of Saradomin, a secret organisation founded many centuries ago by Saradomin himself, are currently looking to expand their ranks with some new blood. After the successful thwarting of the Black Knights' plans to take over Asgarnia, and with the personal recommendation of Sir Amik, you have now been offered the chance to apply for membership in this organisation... but are you up to the challenge?",
    "length": "Short",
    "requirements": "*Completion of the following quests:\n**Black Knights' Fortress\n**Druidic Ritual",
    "recommended": "*",
    "kills": "Sir Leye (level 20)",
    "ironman": "[[File:Hardcore ironman chat badge.png]] You will lose your Hardcore ironman status if you die to Sir Leye. \n[[File:Ultimate ironman chat badge.png]] This quest requires an empty inventory and no items worn.",
    "template": "quest details"
  },
  {
    "start": "Talk to King Lathas on the of Ardougne Castle.",
    "startmap": "2577,3293,plane:1",
    "difficulty": "Experienced",
    "description": "Continuing the Plague City series, the Regicide Quest takes you beyond the 'Well of Voyage' to a new realm.\n\nKing Lathas will employ you once again, this time for the grim task of disposing of his brother.\n\nUpon travelling to the realm you will find yourself surrounded by new and strange plants, animals and even a new race.\n\nOnce there, you will see that everything is not as serene as it first appears.",
    "length": "Long",
    "requirements": "* Completion of the following quests:\n** Underground Pass\n*** Biohazard\n**** Plague City\n* \n*  \n* The ability to defeat a level 110 Tyras guard (can be safespotted)",
    "items": "* 5 coal in the bank (although at least 25 is recommended; you may bring the coal noted to save you a bank trip)\n* Bow and some arrows (or lit fire arrows if you already have some.)\n* 2 ropes (3 in case you fail)\n* Spade\n* Limestone (or a pickaxe and ). Note that limestone bricks will not work.\n* Tinderbox\n* Strip of cloth (made on a loom with 4 balls of wool; not a bolt of cloth - you can use the loom at the Iorwerth Camp or at the Falador farm)\n* Pestle and mortar\n* Gloves, the list on Quicklime shows all gloves that work.\n* Pot (obtainable during quest)\n* Cooked rabbit (obtainable during quest if you bring an axe) or roast rabbit\n* OPTIONAL: Your Iban's staff or its upgraded counterpart in order to recharge it, if you have space available in your inventory.",
    "recommended": "* \n* Some antidote++ or antipoisons\n* Stamina potions and weight-reducing gear (such as Boots of Lightness or the Graceful outfit)\n* Plank to pass a trap (obtainable during quest)\n* At least 3 Summer pies to boost Agility for several obstacles, and to recover health from the traps\n* Ranged, Magic or a Halberd to safespot the Tyras Guard\n* Coins to buy food in the Underground Pass\n* Fast travel to Rimmington (Rimmington teleport, Teleport to House if your house is in Rimmington, or alternatively Falador teleport)\n* Fast travel to the Underground Pass (West Ardougne teleport or travel from East Ardougne)",
    "kills": "* Tyras guard (level 110)",
    "ironman": "*  (to make a strip of cloth)",
    "template": "quest details"
  },
  {
    "start": "Speak to Ali Morrisane in Al Kharid",
    "requirements": "Completion of following quests:\n*The Feud\n*Rune Mysteries\n*Icthlarin's Little Helper - gives access to Sophanem",
    "items": "*3 dyes of any colour (to unlock Menaphite clothing) OR 3 animal pelts of the same kind (to unlock the Desert outfit). This includes cowhide, grey wolf fur, snakeskin, bear fur, or wool (not balls of wool)\n*At least 100 coins (for street urchin)",
    "recommended": "Recommended\n*~1,000 coins for carpet rides to Pollnivneach and Sophanem (and back to Shantay Pass)\n*Ring of dueling to quickly get to Al Kharid\n*A teleport to Varrock",
    "length": "Short (if fully prepared) - Medium",
    "template": "quest details"
  },
  {
    "start": "Speak to Romeo in Varrock Square.",
    "startmap": "3211,3423",
    "difficulty": "1",
    "description": "Romeo and Juliet are desperately in love, but Juliet's father doesn't approve. Help them to find a way to get married and live happily ever after.",
    "length": "Short",
    "items": "*Cadava berries (Can be obtained during quest)",
    "recommended": "*Several teleports to Varrock",
    "template": "quest details"
  },
  {
    "start": "Talk to Islwyn inside the elven woods of Isafdar.",
    "startmap": "2206,3159",
    "difficulty": "3",
    "description": "Deep in the elven forests of Isafdar, live a duo of roving elves: Islwyn a grumpy, old elf who dislikes humans and his companion, Eluned, who is a beautiful, friendly, young female elf with a kind heart. In this quest, you are challenged to overcome Islwyn's prejudice against humans and alleviate the burdens of the past.",
    "length": "Short",
    "requirements": "* Completion of the following quests:\n** Regicide\n*** Underground Pass\n**** Biohazard\n***** Plague City\n** Waterfall Quest\n* The ability to defeat a level 84 enemy unarmed, with heavy restrictions\n*, unless travelling with a charter ship to the elven woods",
    "items": "* Glarial's pebble (can be obtained during the quest)\n* Key (can be obtained during the quest)\n* Spade\n* Rope",
    "recommended": "* \n* The requirements to start Mourning's End Part I directly after this quest, to obtain the teleport crystal\n** \n**  \n** Completion of Sheep Herder and Big Chompy Bird Hunting\n* Antipoison and food\n* Ring of recoil, goblin paint cannon, prayer potions (for players with 43 Prayer to sustain Protect from Melee) and a super combat potion in the fight against the Moss Guardian.\n* Fast travel to the Waterfall Dungeon and Glarial's Tomb (Games necklace or minigame teleport to the Barbarian Outpost, or skills necklace to the Fishing Guild)\n* Fast travel to Islwyn and Eluned (Iorwerth camp teleport or charter ship to Port Tyras)\n* Ring of Charos (a) to reduce charter ship costs, if travelling with them",
    "kills": "* Moss Guardian (level 84) (has to be killed with restricted items, can be flinched)",
    "ironman": "[[File:Ultimate ironman chat badge.png]] You must briefly visit Glarial's Tomb which has significant item restrictions. Items dropped outside the tomb may be picked back up within three minutes.",
    "template": "quest details"
  },
  {
    "start": "Go to Miscellania and speak to Advisor Ghrim in the castle.",
    "startmap": "2501,3859",
    "difficulty": "Experienced",
    "description": "It's tough being a regent of a small island kingdom, especially when the king has declared war while you were adventuring. Something is up in Miscellania and Etceteria, so you'd better find out what before both kingdoms end up in royal trouble.",
    "length": "Medium",
    "requirements": "* \n* \n* Completion of the following quests:\n** Throne of Miscellania\n*** Heroes' Quest\n**** Shield of Arrav\n**** Lost City\n**** Merlin's Crystal\n**** Dragon Slayer I\n*** The Fremennik Trials",
    "items": "*5 coal (obtainable during the quest with a pickaxe, which will also be obtainable)\n*2 rope (obtainable from crates during the quest)\n*1 plank (obtainable from a spawn during the quest)",
    "recommended": "*\n*Weapon, armour and some food\n*Superantipoison or any other poison cure\n* and Prayer potions for protection prayers\n*Stamina or energy potions\n*Multiple charged Rings of Wealth for fast travel to Miscellania",
    "kills": "Giant Sea Snake (level 149)",
    "template": "quest details"
  },
  {
    "start": "Pirate Pete, at a dock due north of Port Phasmatys.",
    "startmap": "3678,3537",
    "difficulty": "3",
    "description": "Zombie pirates have arisen on Braindeath Island, and they don't look friendly! Production of 'rum' has stopped, and the pirate brewers are running scared. Can you overcome the horde of drunken, undead pirates? Can you even get to the island without getting a splitting headache?",
    "length": "Medium",
    "requirements": "*Completion of the following quests:\n**Zogre Flesh Eaters\n***Big Chompy Bird Hunting\n***Jungle Potion\n****Druidic Ritual\n**Priest in Peril\n* \n* \n* \n* \n* \n\n*The ability to kill a combat level 150 monster (can be safespotted)",
    "recommended": "*\n*Means to deal damage at range (Magic, Ranged or a Halberd) or means to negate disease (such as Slayer gloves or a Relicym's balm)\n*Ectophial for fast travel to the quest starting point\n*Stamina or energy potions\n*Ring of Charos (a) and a tinderbox for some funny dialogue with 50% Luke",
    "kills": "*Evil spirit (level 150) (safespottable) \n*Fever spider (level 49) (safespottable)",
    "items": "*Rake (obtainable during the quest)\n*Seed dibber (obtainable during the quest)\n*Bucket (obtainable during the quest)\n*At least 47 prayer points for the Evil spirits part of the quest",
    "template": "quest details"
  },
  {
    "description": "Recent research at the Wizards' Tower has found a way to create Runes for the first time in centuries. Assist the head wizard Sedridor in his research and he too may teach you these secrets!",
    "start": "Speak to Duke Horacio on the of Lumbridge Castle.",
    "startmap": "3210,3222,plane:1",
    "difficulty": "Novice",
    "length": "Short",
    "items": "None",
    "recommended": "* Fast travel to Varrock (Varrock teleport, Chronicle or (members only) Ring of Wealth to the Grand Exchange or Combat Bracelet to the Champions' Guild)\n* (Members only) Fast travel to the Wizards' Tower (Necklace of Passage, Amulet of Glory to Draynor Village or Fairy Rings to )",
    "template": "quest details"
  },
  {
    "start": "Speak to Thormac at the top floor of the Sorcerer's Tower, south-east of the Ranging Guild.",
    "startmap": "2701,3405,plane:3",
    "difficulty": "2",
    "description": "Thormac the Sorcerer has a hobby involving scorpions. Unfortunately, three of them have escaped and managed to run far away. If you manage to find them all, he may just be able to perform an important service for you.",
    "length": "Short",
    "requirements": "* \n* Completion of Alfred Grimhand's Barcrawl\n* The ability to run past level 172 black demons and level 64 poison spiders",
    "items": "*Dusty key (obtainable during the quest) or.",
    "recommended": "* \n* Anti-dragon shield or dragonfire shield (highly recommended, see the guide for the alternative strategy if they are unavailable)\n* Antifire potion (provides complete immunity to the dragonfire if used with an anti-dragon or dragonfire shield)\n* Antipoison or superantipoison\n* Armour and some food\n* Stamina or energy potions\n* Fast travel to several locations\n** The Sorcerer's Tower (Camelot teleport, Ardougne teleport or Combat Bracelet to the Ranged Guild)\n** Taverley Dungeon (Taverley teleport, Falador teleport or Teleport to House if your house is in Taverley)\n** Barbarian Outpost (Games Necklace or Barbarian teleport)\n** Edgeville Monastery (Combat Bracelet or Amulet of Glory to Edgeville)",
    "kills": "* Jailer (level 47) if you need to acquire the dusty key",
    "template": "quest details"
  },
  {
    "start": "Speak to Caroline just north of Witchaven.",
    "startmap": "2716,3302",
    "difficulty": "2",
    "description": "Something strange is happening on the Fishing Platform.\nMissing fishermen and the presence of dozens of strange sea creatures gives cause for concern.\nInvestigate the platform, discover the truth before it's too late.",
    "length": "Short",
    "requirements": "*",
    "items": "* Swamp paste (made by mixing flour with swamp tar then cooking the mixture on a fire; can also be bought from a Trader crewmember for 75 coins, from Rasolo for 60 coins west of the Fishing Guild, or from the Khazard General Store for 42 coins at full stock)",
    "recommended": "* Small fishing net for Ardougne Medium Diary (can be bought near quest start in Witchaven)\n* Unlit torch (a small glitch might occur where you do not receive the torch during the quest)",
    "template": "quest details"
  },
  {
    "start": "The Carnillean Mansion in the south-west corner of East Ardougne",
    "startmap": "2570,3276",
    "difficulty": "4",
    "description": "Our story begins - as all good murder mysteries do - with a mysterious murder, and there's no shortage of suspects - in fact, you're one of them! Be prepared to form an uneasy alliance, dig up secrets best left buried deep, and walk away with more questions than answers...",
    "length": "Medium",
    "requirements": "* \n* \n* \n*Completion of the following quests:\n**Making Friends with My Arm\n***My Arm's Big Adventure\n****Eadgar's Ruse\n*****Druidic Ritual\n*****Troll Stronghold\n******Death Plateau\n****The Feud\n****Jungle Potion\n***Swan Song\n****One Small Favour\n*****Rune Mysteries\n*****Shilo Village\n****Garden of Tranquillity\n*****Creature of Fenkenstrain\n******Priest in Peril\n******The Restless Ghost\n***Cold War\n***Romeo & Juliet\n**The General's Shadow\n***Curse of the Empty Lord, for full ghostly robes\n****Started Desert Treasure I, for the ring of visibility\n***Fight Arena\n**Devious Minds\n***Wanted!\n****Recruitment Drive\n*****Black Knights' Fortress\n*****Druidic Ritual\n****The Lost Tribe\n*****Goblin Diplomacy\n*****Rune Mysteries\n****Priest in Peril\n***Troll Stronghold\n****Death Plateau\n***Doric's Quest\n***Enter the Abyss\n**Hazeel Cult",
    "items": "*100 Coins\n*Lockpick (Strange Old Lockpick does NOT work)\n*Tinderbox (can be obtained during quest)",
    "recommended": "* \n* Antipoison or other form of poison protection\n* Any Ardougne cloak to teleport near several quest locations\n* Icy basalt to teleport to Weiss",
    "kills": "* Evelot (level 148)\n* Assassin (level 262)\n* Strange Creature (level 368)",
    "template": "quest details"
  },
  {
    "start": "Find the Diary of Herbi Flax on a shelf in a house at the village of Mort'ton.",
    "startmap": "3481,3279",
    "difficulty": "2",
    "description": "The townsfolk of Mort'ton have some form of strange affliction and the town is full of Shades. Can you find some way to reverse this?",
    "length": "Short",
    "requirements": "* Completion of Priest in Peril\n*  \n*  \n*   \n* Must be able to defeat 5 level-40 Loar Shades.\n* Must be able to survive an onslaught when rebuilding the Temple, and being surrounded by many players makes this much easier.",
    "items": "* 5000+ coins (bring plenty of money just in case)\n* 2 Tarromin potion (unf) (made by adding 2 clean Tarromins (obtainable during quest) to 2 vials of water (empty vials are obtainable during quest))\n* Tinderbox\n* An axe for cutting pyre logs\n* 2 Ashes\n* Prior to building the temple, you need a hammer (1 coin at the general store). However, a regular hammer is insufficient to build the temple without a large group. An additional 13,000 coins (or on the Grand Exchange) allows you to buy a Flamtaer hammer from Razmire, which is necessary to complete this part of the quest without a group.",
    "recommended": "* \n* Combat equipment\n* Food\n* Mort'ton teleport scroll or Barrows teleport tablet to teleport to Mort'ton\n* 2 or 3 tarromin herbs, ashes, and spare logs\n* Druid pouch (only if travelling through the swamp with ghasts)\n* 1 to 4 Flamtaer bracelets (HIGHLY recommended; the minigame is occasionally unpopulated)\n* Flamtaer hammer (HIGHLY recommended; the minigame is occasionally unpopulated)\n* 11 inventory slots",
    "kills": "* 5 Loar Shades (level 40)",
    "template": "quest details"
  },
  {
    "start": "Speak to Father Reen, south of Al-Kharid bank.",
    "startmap": "3271,3158",
    "difficulty": "2",
    "description": "A sinister group of dark wizards is attempting to summon Agrith-Naar, a demon of exceptional mystical power. Rather than try to prevent them, a Saradominist priest asks the player to help summon the demon and then kill it once and for all.\n\nBut all is not as it seems...",
    "length": "Medium",
    "requirements": "* \n*Completion of the following quests:\n**The Golem\n**Demon Slayer\n*The ability to defeat a level 100 demon",
    "items": "*Silverlight (obtainable at start of quest)\n*Strange implement (obtainable during quest)\n*Any black outfit (minimum of 3 pieces, see below for the allowed gear — the dyed Silverlight does not count as a piece of black clothing)\n**Note: You can make a black desert robe and shirt during the quest if you brought a desert robe and shirt\n*Black dye (from grinding a black mushroom using a pestle and mortar alongside a vial)\n*Silver bar\n*Means to enter the desert (such as the Shantay pass, Desert amulet 2, Teleport tablets or scrolls, Fairy rings or the Pharaoh's sceptre)",
    "kills": "Agrith-Naar (level 100)",
    "recommended": "*\n*Fast travel to Al-Kharid to start the quest (Amulet of Glory or Ring of Dueling)\n*Fast travel to Uzer (Necklace of Passage to Eagles' Eyrie, Fairy Rings to or using the magic carpet transport)\n*Food and armour to defeat a level 100 demon\n*2 waterskins\n*Chisel and hammer (optional to obtain several gems from the throne, unless already taken during The Golem)",
    "template": "quest details"
  },
  {
    "start": "Speak to Councillor Halgrive outside of the East Ardougne church.",
    "startmap": "2617,3299",
    "difficulty": "1",
    "description": "Dispose of plagued sheep and save Ardougne!",
    "length": "Short",
    "items": "* 100 coins",
    "recommended": "* Energy restoring items",
    "template": "quest details"
  },
  {
    "start": "Speak to Fred the Farmer in the house by the sheep pen north of Lumbridge Castle.",
    "startmap": "3189,3273",
    "difficulty": "1",
    "description": "Fred the Farmer's sheep are getting mighty woolly. He will pay you to shear them.",
    "length": "Very Short",
    "items": "*20 balls of wool (unnoted)\nor\n*Shears to obtain wool to spin into balls of wool (obtained during the quest)",
    "template": "quest details"
  },
  {
    "start": "Varrock Palace library. Talk to Reldo, the librarian, located at the northern end of Varrock Castle.",
    "startmap": "3209,3495",
    "difficulty": "Novice",
    "description": "Varrockian literature tells of a valuable shield, stolen long ago from the museum of Varrock, by a gang of professional thieves. See if you can track down this shield and return it to the museum. You will need a friend to help you complete this quest.",
    "length": "Short",
    "requirements": "A trustworthy friend or partner. Players can join the official chat-channel \"OSRS SOA\" to look for a partner.",
    "items": "*Phoenix Gang: 20 coins\n*Black Arm Gang: 2 Phoenix crossbows (obtained during the quest)",
    "recommended": "*",
    "kills": "*Black Arm Gang: Weaponsmaster (level 23)\n*Phoenix Gang: Jonny the beard (level 2)",
    "template": "quest details"
  },
  {
    "start": "Talk to Mosol Rei outside of Shilo Village in the south part of Karamja.",
    "startmap": "2881,2951",
    "difficulty": "2",
    "description": "New areas in the southern part of Karamja Island have been discovered with a mysterious village.\nWho knows what hidden treasures exist, and what dangers lurk to guard them?",
    "length": "Medium",
    "requirements": "* Completion of the following quests:\n** Jungle Potion\n*** Druidic Ritual\n* \n*  \n* Must be able to defend from many Undead ones (level 61-73) and able to defeat three monsters that are about level 90.",
    "items": "* Spade\n* A lit torch or candle (lanterns or black candles don't work) (a bruma torch will work, but you will not get this item back)\n* Rope\n* Bronze wire (can be made from scratch using the General Store and Anvil north of Tai Bwo Wannai)\n* Chisel\n* 3 regular bones (obtainable during quest, only normal bones work; a spare is a good idea in case you bury one)\n* Wampum belt (obtainable during quest)\nAll required items (except for the bones and wire) can be bought at the general store in Tai Bwo Wannai for less than 100 coins.\nBones can be obtained from the Chicken (Level 3) south of Trufitus past the rotten fence. Respawn time Aprox. 20sec.",
    "recommended": "* \n* Decent armour and a weapon\n* Good food (enough to make it through two long tunnels of level 73 monsters)\n* Stamina potions\n* Antipoison (poison can hit up to 11 each time; a combat level of 65 or higher will make the very poisonous tribesmen non-aggressive)\n* Prayer potions to help protect against the undead\n* Teleports (for leaving dangerous areas in a hurry; ring of dueling is helpful for access to a glider; necklace of passage, amulet of glory and several other viable options for easy access to fairy rings).\n* Papyrus and charcoal (only required if you lose an item during the quest)\n* Access to the Gnome glider and fairy rings makes travelling easier (don't forget your Dramen staff)\n* Crumble Undead makes it easy to kill the 3 monsters.\n* 4 Rogue kits could provide the chisel, rope, tinderbox, and spade you need in the temple, saving inventory space and weight.",
    "kills": "* Nazastarool in 3 forms, levels 91, 68 and 93. Safespotting is possible.",
    "ironman": "*  (to make a bronze wire)",
    "template": "quest details"
  },
  {
    "start": "Speak to Veliaf Hurtz outside the church in Slepe.",
    "startmap": "3729,3319",
    "difficulty": "Master",
    "description": "A darkness has fallen over Morytania. The Myreque freedom fighters have achieved their first major victory over the vampyres with the death of Ranis Drakan. However, their newly found hope is unlikely to last. After many years of absence, Lord Lowerniel Drakan, the vampyre overlord of Morytania, has finally emerged from his castle. He has but one goal. To avenge his brother and eradicate the Myreque once and for all.",
    "length": "Long",
    "requirements": "*Completion of the following quests:\n**Vampyre Slayer\n**A Taste of Hope\n***Darkness of Hallowvale\n****In Aid of the Myreque\n*****In Search of the Myreque\n******Nature Spirit\n*******Priest in Peril\n*******The Restless Ghost\n* \n* \n* \n* \n* \n* \n*",
    "items": "*Any axe\n*Vyrewatch outfit (top, legs, and shoes) or 1,950 coins to purchase it from Trader Sven's Black-market Goods (can be obtained during quest)\n*Ivandis flail\n*Ruby\n*Knife (can be obtained during quest)\n*Chisel\n*Runes for Lvl-3 Enchant (1 cosmic rune, 5 fire runes) or an enchant ruby or topaz tablet",
    "kills": "*Kroy (level 133)\n*Nail beast (level 143 & 67 twice)\n*Vampyre Juvinate (level 119) twice\n*Mutated Bloodveld (level 123)\n*Damien Leucurte (level 204)\n*Vampyre Juvenile (level 122)\n*Vanstrom Klause (level 459)",
    "recommended": "* \n* Teleport to Haunted Woods (fairy ring, Fenkenstrain's Castle Teleport, Kharyrll Teleport, or ectophial will get you close).\n* You may need an additional 10,000 coins to pay Andras for a trip to Slepe\n* Any pickaxe (bronze pickaxe obtainable during quest)\n* A hammer OR any axe which you have the Attack level to wield (bronze axe obtainable during quest).\n* Stamina potions or energy potions\n* Antipoison or Superantipoison potions\n* Drakan's medallion\n* Morytania legs 3 (Hard Diary)\n* Combat equipment\n* Food\n* Prayer Potion",
    "template": "quest details"
  },
  {
    "start": "Speak to Veliaf Hurtz outside the church in Slepe.",
    "difficulty": "Master",
    "description": "A darkness has fallen over Morytania. The Myreque freedom fighters have achieved their first major victory over the vampyres with the death of Ranis Drakan. However, their newly found hope is unlikely to last. After many years of absence, Lord Lowerniel Drakan, the vampyre overlord of Morytania, has finally emerged from his castle. He has but one goal. To avenge his brother and eradicate the Myreque once and for all.",
    "length": "Long",
    "requirements": "These skills are given upon setting up the speedrun:\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*",
    "items": "These items are provided upon setting up the speedrun:\n* High-level melee equipment\n* 15,000 coins\n* 1 Drakan's medallion\n* 1 Enchant ruby or topaz\n* 1 Ruby\n* 1 Ghostspeak amulet\n* Ectophial\n* 1 Ivandis flail\n* 3 stamina potion(4)\n* 4 Saradomin brew(4)\n* 2 super restore(4)\n* 1 superantipoison(4)\n* 5 shark\n* In bank:\n** 50 adamant darts\n** 3 stamina potion(4)\n** 12 Saradomin brew(4)\n** 6 super restore(4)\n** 25 shark",
    "kills": "*Kroy (level 133)\n*Nail beast (level 143 & 67 twice)\n*Vampyre Juvinate (level 119) twice\n*Mutated Bloodveld (level 123)\n*Damien Leucurte (level 204)\n*Vampyre Juvenile (level 122)\n*Vanstrom Klause (level 459)",
    "template": "quest details"
  },
  {
    "name": "Skippy and the Mogres",
    "description": "Help a drunken man haunted by the curse of the Mogres.",
    "startmap": "2977,3195",
    "start": "Speak to Skippy located south-east of the town of Rimmington.",
    "update": "Mogres, Lizards, Pet Fish, Potions and Potatoes!",
    "difficulty": "Novice",
    "length": "Very Short",
    "members": "Yes",
    "requirements": "*",
    "items": "*Bucket of water\n*Nettle tea\n**Nettle-water\n***Bowl of Water\n***Nettles (more than one with low Cooking level, as it can fail due to over boiling)\n****Gloves to pick the nettles (leather gloves are obtainable during the quest)\n*Hangover cure or the ingredients to make one:\n**Chocolate dust\n***Chocolate\n***Knife or pestle and mortar\n**Bucket of milk\n**Snape grass",
    "recommended": "* and fishing explosives to slay mogres after the miniquest",
    "template": "quest details"
  },
  {
    "start": "Speak to Kovac at the Giants' Plateau, east of Al Kharid.",
    "startmap": "3362,3146",
    "difficulty": "Intermediate",
    "description": "Ahh, giants. We all know them. Enormous humanoids hanging about Gielinor, simply minding their own business until some adventurer or another comes along to beat them up.\n\nBut how much do we really know about these giants? What do they think about? Where did they come from? Would they enjoy making massive swords in some kind of... gargantuan workshop?\n\nAll these questions, and more, will be answered in the quest Sleeping Giants! You'll help Kovac, a friendly giant who's discovered an ancient forge built to his giant-size proportions!",
    "length": "Short",
    "requirements": "*",
    "items": "* 3 oak logs\n* 1 wool (ball of wool will not work)\n* 10 nails\n* Hammer or Imcando hammer (Other types of hammers will not work)\n* Chisel\n* 1 bucket of water (Obtainable during quest) or ice gloves",
    "ironman": "[[File:Ultimate_ironman_chat_badge.png]] 20 empty inventory spaces needed to search a crate.",
    "template": "quest details"
  },
  {
    "start": "Talk to Edmond, who can be found at his home in East Ardougne, north of the Flying Horse Inn.",
    "startmap": "2569,3333",
    "difficulty": "Grandmaster",
    "description": "Our story begins with you, the hero, answering the call to adventure when Edmond, a resident of Ardougne, asks for your aid. By rescuing his daughter Elena from Plague City, the quarantined West Ardougne, you begin to unravel the mystery surrounding the disease. With her help, you discover the plague is a hoax - a plot by King Lathas to section off the West Ardougne. By confronting him, you find out this was done to protect the rest of Gielinor from the threat in the elven lands.\n\nThe king sends you on a mission to travel through the Underground Pass and help his ally, Lord Iorwerth, in eradicating his brother King Tyras who threatens to revive the mysterious Dark Lord. After an arduous journey through the pass, you meet with Iorwerth and his forces to end Tyras' evil once and for all.\n\nUpon your return to Lathas you are intercepted by Arianwyn, a rebel elf who opposes Lord Iorwerth. He informs you of Lathas and Iorwerth's deception. They manipulated you into removing their final opposition and were now free to bring the Dark Lord back to Gielinor for their own intentions. You work with the elven rebellion to discover the purpose of the plague was to disguise the digsite of the long lost Temple of Light. An ancient place that is key to bringing back the Dark Lord.\n\nTo make amends for your past mistakes and put a halt in King Lathas' and Lord Iorwerth's plans, you solve the intricate light puzzle designed to protect the Death Altar within the temple. After sealing off the temple and preventing the return of the Dark Lord, it's now time to turn your attention to King Lathas and Lord Iorwerth to end their schemes once and for all in Song of the Elves.",
    "length": "Very Long",
    "requirements": "*Completion of the following quests:\n**Mourning's End Part II\n***Mourning's End Part I\n****Big Chompy Bird Hunting\n****Sheep Herder\n****Roving Elves\n*****Waterfall Quest\n*****Regicide\n******Underground Pass\n*******Biohazard\n********Plague City\n**Making History\n***Priest in Peril\n***The Restless Ghost\n* \n* \n* \n* \n* \n* \n* \n*",
    "items": "*Steel full helm\n*Steel platebody\n*Steel platelegs\n*Red dye\n*Purple dye\n*Mourner gear including gas mask (plague jacket and trousers do not work)\n*Silk\n*Runite bar x 1\n*Limestone brick x 8\n*Tinderbox\n*Rope\n*Nature rune\n*Flowers from mithril seeds or an irit leaf\n*Adamant chainbody (consumed during the quest)\n*Wine of zamorak OR Zamorak brew(4)\n*Cabbage (obtainable during the quest)\n*Black knife OR black dagger\n*Cadantine seed\n*Seed dibber\n*Vial of water\n*Pestle and mortar\n*Hammer\n*Saw\n*Pickaxe\n*Axe\n*Spade",
    "kills": "*21 Mourners (level 24, 51 and 106)\n*Paladin (level 49 and 118)\n*Knight of Ardougne (level 27 and 53)\n*Several Iorwerth Archers and Warriors (level 90 and 108)\n*Arianwyn (level 212)\n*Essyllt (level 236)\n*Fragment of Seren (level 494)",
    "recommended": "*\n* to wield the Trident of the swamp in the final fight.\n* to be able to use Protect from Missiles at boss fight.\n*High healing food, such as monkfish or sharks.\n*West Ardougne Teleport\n*Games necklace for teleportation to Baxtorian Falls.\n*Weight-reducing clothing and energy restoration items such as stamina potion.\n*Charged teleport crystals to skip large amounts of walking.\n*3x Iorwerth camp teleport or equivalent method.",
    "template": "quest details"
  },
  {
    "start": "Talk to Awusah, Mayor of Nardah.",
    "startmap": "3434,2917",
    "difficulty": "2",
    "description": "The people in the desert village of Nardah have a problem. Their town well has dried up and any water they try to bring back to the town from the river mysteriously disappears before they can get it back.\n\nThe villagers suspect they have been cursed in some way. Can you unravel what is going on and save the village?",
    "length": "Short",
    "requirements": "* \n* \n* \n* \n*Ability to defeat three level 75 golems",
    "items": "*Runes for Telekinetic Grab (One law and air runes)\n*Needle\n*1-2 thread\n*Crush weapon\n*Stab weapon\n*Slash weapon\n*Light source\n*Knife\n*Rope\n*Pickaxe (can be obtained during the quest)\n*Bow and arrows (can be obtained during the quest); a crystal bow will also work",
    "recommended": "*\n*Desert clothing to protect you from the desert heat\n*A few waterskins\n*Nardah teleports\n*Necklace of Passage to Eagle's Eyrie or a Shantay pass to go through the gate at the Shantay Pass\n*A Spear or Hasta to save inventory space since they can use all three melee attack types\n*Armour and some food",
    "kills": "*Black golem (level 75)\n*Grey golem (level 75)\n*White golem (level 75)",
    "template": "quest details"
  },
  {
    "start": "The Piscatoris Fishing Colony. It can be reached via a boat trip from the river to the west of the Tree Gnome Stronghold.",
    "startmap": "2353,3680",
    "difficulty": "4",
    "description": "Out on the edge of the known world, the Piscatoris Fishing Colony stands on the brink of disaster. Angry sea trolls are emerging from the sea and attacking the colonists, preventing them from harvesting the valuable monkfish that live in those waters. A highly experienced adventurer will be needed to drive back the trolls for good. The Colony's director, Herman Caranos, has a particular adventurer in mind: the notoriously amoral Wise Old Man of Draynor Village (allegations of his involvement in a spectacular bank robbery have never been substantiated). If you're in the mood for a bit of combat, jump on the boat on the west side of the Gnome Stronghold, speak to the Colony's director and prepare to fight alongside the Wise Old Man as he embarks on his final adventure - his swan song.",
    "length": "Medium",
    "requirements": "*\n* \n* \n* \n* \n* \n* \n*Completion of the following quests:\n**One Small Favour\n***Rune Mysteries\n***Shilo Village\n****Jungle Potion\n*****Druidic Ritual\n**Garden of Tranquillity\n***Creature of Fenkenstrain\n****Priest in Peril\n****The Restless Ghost\n*The ability to defeat a combat level 170 monster, which is able to use Magic, Melee and can drain Prayer.",
    "items": "*10 mist runes\n*10 lava runes\n*5 blood runes\n*7 bones (obtainable during the quest)\n*An airtight pot – created by using a pot lid on a pot\n**A pot, or\n***a soft clay if making your own pot during quest, or\n****a pickaxe (obtainable during the quest) if mining your own clay during quest\n**A pot lid, or\n***a soft clay if making your own pot lid during quest (note: 2 soft clay needed if making both pot and pot lid), or\n****a pickaxe (obtainable during the quest) if mining your own clay during quest\n*5 iron bars, or\n**a pickaxe (obtainable during the quest) if mining your own iron during quest\n*1 set of logs of any kind, or\n**an axe (obtainable during quest) if chopping your own logs during quest\n*A tinderbox (obtainable during the quest)\n*A hammer (obtainable during the quest)\n*A small fishing net (given to you during the quest if you do not have one)\n*A brown apron (given to you during the quest if you do not have one)",
    "recommended": "*\n*Teleportation method to the Piscatoris Fishing Colony:\n**Several Piscatoris teleports can be used to teleport there directly\n**A Dramen staff or Lunar staff – if using fairy rings \n**50 coins or a ring of charos – if using Kathy Corkat's boat from west of Tree Gnome Stronghold\n*An amulet of glory (to teleport to Draynor Village)\n*A skills necklace (to teleport to the Crafting Guild)\n*Watchtower teleport runes or tablet (requires completing Watchtower), or Nightmare Zone Grouping teleport\n*It is best to bring 4 to 5 Admiral pies if boosting Fishing level.\n*Some prayer potions (to offset the Sea Troll Queen's magical Prayer-draining attacks)\n*Some good food/healing\n*Cooking gauntlets (to reduce the chance of burning the 5 Monkfish caught during the quest)",
    "kills": "*11 Sea trolls (1 each of levels 65/87/101 and 8 of level 79)\n*Sea Troll Queen (level 170)",
    "ironman": "Consider purchasing the necessary combination runes from the Rewards Guardian in the Mage Training Arena.",
    "template": "quest details"
  },
  {
    "start": "Talk to Timfraku in his house in Tai Bwo Wannai.",
    "startmap": "2782,3087",
    "difficulty": "Intermediate",
    "description": "In Jungle Potion, the Shaman Trufitus communed with the gods to determine the fate of his people.\n\nNow, Timfraku, the Chief of Tai Bwo Wannai, wishes to see his people and family return to the abandoned village.\n\nHelp a depressed fisherman, encourage a raging hunter and satiate an eccentric priest in this extreme test of aptitude and patience!",
    "length": "Medium",
    "requirements": "* \n*  \n*   (65 if you wish to catch the Raw karambwan yourself)\n* Completion of the following quests:\n** Jungle Potion\n*** Druidic Ritual",
    "items": "* Knife or bladed weapon, such as a Sword\n* Sliced banana (can be obtained during the quest)\n* Small fishing net\n* Pestle and mortar (can be obtained during the quest for 6 gp)\n* Iron spear or better. Do not work: Black spear, Leaf-bladed spear, and bone spear. (The spear will be lost as well.)\n* Agility potion(4)\n* Ranged or Magic equipment to kill a monkey for a monkey corpse\n* Tinderbox (If you wish to avoid running back to the range in Brimhaven)\n* Jogre bones (can be obtained during the quest)\n* Seaweed (can be obtained during the quest)\n* Karamjan rum or 30 coins to purchase (if obtaining the rum before starting, add the sliced banana or the rum will disappear when you leave the island)",
    "recommended": "*  to make burnt jogre bones on a fire instead of at a furnace\n* Extra Raw karambwan in case you burn the one given to you by Tiadeche\n* Access to the Gnome Glider system (requires partial completion of The Grand Tree quest)\n* Rimmington or Ardougne teleport, as well as coins if you are chartering a ship to Brimhaven\n* Stamina potions\n* Food\n* Antidote++ or other Antipoisons\n* Amulet of glory\n* Brimhaven teleport\n* Weight-reducing clothing\n* Lunar/Dramen staff for fairy rings\n* 2 Logs to quickly make Poison karambwan at fishing site and to cook Pasty jogre bones later in the quest\n*, , , a mith grapple, and crossbow for the Strong Tree shortcut",
    "kills": "* Monkey (level 3)",
    "ironman": "*  to create the agility potion\n*   to catch raw karambwan (necessary if you burn the one given to you)\n* The ability to defeat a level 53 enemy (can be safespotted and the bones telegrabbed at the Ardougne Zoo)\n*Obtaining an iron spear or better. May be bought from the Mount Karuulm Weapon Shop, or dropped by enemies such as Moss Giants, Jogres, Tribesmen, and Hobgoblins",
    "template": "quest details"
  },
  {
    "start": "Speak to Phileas Rimor in his house west of The Cloak and Stagger tavern in Shayzien.",
    "startmap": "1542,3570",
    "difficulty": "Intermediate",
    "description": "Over a thousand years ago, King Shayzien VII ordered an expedition to Mount Quidamortem. The expedition never returned and it was assumed that all members perished in the field. However, a recent discovery suggests this may not have been the case. Phileas Rimor is the descendant of the expedition leader and he is desperate to discover the truth. Join him and delve into a conspiracy a thousand years in the making in \"Tale of the Righteous\".",
    "length": "Short",
    "requirements": "*Completion of the following quests:\n**Client of Kourend\n***X Marks the Spot\n* \n* \n*20% Shayzien favour",
    "items": "*A pickaxe\n*A ranged weapon with ammunition. Darts and throwing knives also work.\n*Runes for 2-3 casts of any magic combat spell\n*A melee weapon of any kind (pickaxe will work)\n*Rope",
    "recommended": "*\n*Stamina potion and weight-reducing clothing\n*Any kind of antipoison or Shayzien armour (tier 5) as you will encounter various types of poison dealing Lizardman, including the final boss.\n*Food for low level players without a shortcut to the top of Mount Quidamortem\n*Ability to use the Lovakengj Minecart Network and to travel to Mount Quidamortem\n*A charged Xeric's talisman for teleporting to Mount Quidamortem (requires unlocking it with an Ancient tablet) and Xeric's Lookout.\n*Ability to teleport to Arceuus Library.",
    "kills": "Corrupt Lizardman (level 46)",
    "template": "quest details"
  },
  {
    "start": "Talk to Juna, deep inside the Lumbridge Swamp Caves.",
    "startmap": "3252,9516,plane:2",
    "difficulty": "2",
    "description": "Deep in the caves in the Lumbridge Swamp is an enchanted place where the tears shed by Guthix when it saw the destruction Saradomin and Zamorak had caused with their wars flow from the very walls. These tears are said to have magical properties to help players gain deeper understanding of the world. However, the cave is guarded by a loyal serpent named Juna who blocks passage from everyone. However, she has grown bored from three thousand years of sitting in the dark cave and wishes to hear stories of life above. Maybe you could come to some sort of arrangement...?",
    "length": "Very Short",
    "requirements": "* \n* \n*   (adding the sapphire lens to a Bullseye lantern (unf) is boostable, but Bullseye lantern (empty) and Bullseye lantern is not boostable.)\n*",
    "items": "* Lit sapphire lantern (use a cut sapphire on a bullseye lantern or on a bullseye lantern (unf)), make sure to use a tinderbox on it as Juna is busy\n** Swamp tar to fill an empty sapphire lantern using the chemist in Rimmington or the lamp still in Dorgesh-Kaan\n* Chisel\n* Tinderbox\n* Pickaxe\n* Rope (if you have not yet entered the Lumbridge Swamp Caves)",
    "recommended": "* Spiny helmet/Slayer helmet to prevent damage from wall beasts, if you have not progressed far enough through The Lost Tribe to access the caves from the Lumbridge Castle cellar.",
    "ironman": "*A bullseye lantern (to create the required sapphire lantern), obtainable through one of the following:\n**Purchase from Miltog for 600 gp (after Death to the Dorgeshuun)\n**  to create a bullseye lantern (unf)\n**  for pickpocketing cave goblins (after  Death to the Dorgeshuun)\n**  to kill wall beasts for a bullseye lantern (unf)\n**Item spawn in Darkmeyer (after  Sins of the Father)",
    "template": "quest details"
  },
  {
    "start": "Speak to Lucien at the Flying Horse Inn in the north-west corner of East Ardougne.",
    "startmap": "2573,3320",
    "difficulty": "2",
    "description": "A mysterious stranger called Lucien asks you to go on a mission deep under the Temple of Ikov in central Kandarin. He wants you to retrieve an artefact known as the Staff of Armadyl. After you retrieve it, the quest doesn't stop there... Are you on the side of good or evil?",
    "length": "Medium",
    "requirements": "* \n*  \n* The ability to defeat a level 84 enemy with Ranged",
    "items": "* Any yew, magic, or dark bow (must be able to fire ice arrows, so crossbows won't work!) or darts or throwing knives\n* 20 unnoted limpwurt roots",
    "recommended": "*\n*Weight-reducing clothing, such as the Graceful outfit, for the first part of the quest (The Unsteady Bridge).\n*Boots of lightness to reduce weight, for the first part of the quest (obtainable during the quest with a light source and a knife or slash weapon)\n* and prayer potions for protection prayers after the first part of the quest.\n*Ranged armour after the first part of the quest.\n* Fast travel to several locations\n**The entrance of the Temple of Ikov (Skills Necklace to the Fishing Guild, Combat Bracelet to the Ranged Guild or Fairy Rings to )\n**Ardougne (Ardougne teleport or Ardougne cloak)\n**Edgeville (Amulet of Glory to Edgeville, Ring of Wealth to Grand Exchange or Fairy Rings to )",
    "kills": "* Fire Warrior of Lesarkus (level 84)\n* Guardian of Armadyl (level 43) - only if siding with Lucien\n* Lucien (level 14) - only if siding with the Guardians of Armadyl",
    "ironman": "* [[File:Ultimate ironman chat badge.png]] 20 unnoted items need to be delivered at once. You must weigh -1kg for part of this quest.\n* Yew longbows can be obtained as a rare drop from young implings.\n** Darts or throwing knives can be used in place of it with Ice arrows equipped in order to deal damage to Fire Warrior of Lesarkus",
    "template": "quest details"
  },
  {
    "start": "Wizard Persten north of Al Kharid, near the gate from Lumbridge.",
    "startmap": "3285,3232",
    "difficulty": "2",
    "description": "The Abyss: a deadly realm filled with ancient power. The secrets of this plane have long eluded the denizens of the Wizards' Tower, though some would give anything to properly uncover them. One of these wizards is Persten. While many in the Tower aren't convinced by her unorthodox methods, a recent discovery means she may now hold the key to the knowledge they crave the most. However, nothing is simple when the Abyss is involved, and Persten won't be able to get to the bottom of her discovery without your help...",
    "length": "Short",
    "requirements": "*Completion of the following quests:\n**Enter the Abyss\n***Rune Mysteries\n*",
    "recommended": "* Method of teleportation to Varrock\n* Method of teleportation to Al Kharid (Ring of Dueling/Lumbridge Teleport/Amulet of Glory)",
    "items": "* Bucket of water\n* Chisel (obtainable during quest) \n* Pickaxe (obtainable during quest)",
    "template": "quest details"
  },
  {
    "start": "Al Kharid, near the gate from Lumbridge",
    "difficulty": "2",
    "description": "The Abyss: a deadly realm filled with ancient power. The secrets of this plane have long eluded the denizens of the Wizards' Tower, though some would give anything to properly uncover them. One of these wizards is Persten. While many in the Tower aren't convinced by her unorthodox methods, a recent discovery means she may now hold the key to the knowledge they crave the most. However, nothing is simple when the Abyss is involved, and Persten won't be able to get to the bottom of her discovery without your help...",
    "length": "Short",
    "requirements": "These skills are given upon setting up the speedrun:\n*\n*\n*",
    "items": "These items are provided upon setting up the speedrun:\n* 100 Coins\n* 5 Energy potion(4)",
    "template": "quest details"
  },
  {
    "start": "Speak to Mori in Arceuus.",
    "startmap": "1700,3742",
    "difficulty": "Intermediate",
    "description": "A long time ago, the citizens of Arceuus house gave up their human bodies and claimed immortality. This event was known as the Ascent of Arceuus and it marked the end of death within Arceuus house. Or so they believed. For the first time in a thousand years, a member of Arceuus house has fallen. You will need to solve the mystery of this death. However, time is of the essence and the fate of Arceuus house lies in your hands.",
    "length": "Short",
    "requirements": "*Completion of the following quests:\n**Client of Kourend\n***X Marks the Spot\n* \n*20% Arceuus favour",
    "items": "None",
    "recommended": "*\n*Access to fairy rings (Dramen/Lunar staff and started Fairytale II - Cure a Queen) and  coins for reviving the  fairy ring\n*Two Battlefront teleports\n*A Stamina potion\n*Xeric's Talisman or Having unlocked and the runes  for the Kourend Castle Teleport spell.\n*Skills necklace for teleportation to the Farming Guild, just south-west of Mount Karuulm.\n* A pickaxe to complete an easy Kourend & Kebos Diary step",
    "kills": "*5 Tormented Souls (Level 16)\n*Trapped Soul (Level 30)",
    "template": "quest details"
  },
  {
    "start": "Speak to Captain Tock at the crossroads north of Port Sarim.",
    "startmap": "3030,3273",
    "difficulty": "2",
    "description": "From the newly revealed town of Corsair Cove, deep in the south of Feldip Hills, the captain of the Corsairs has sailed to Port Sarim seeking help. His crew is sick, and he suspects that a curse has been laid upon them.\n\nIf you can unravel the fearful and conflicting tales of ogre relics, vengeful mermaids and demonic possession, maybe you can help his ailing crew overcome The Corsair Curse.",
    "length": "Short",
    "items": "* Spade (obtainable during quest)\n* Tinderbox (obtainable during quest)",
    "recommended": "* \n* Energy potions or (members only) stamina potions\n* Weapon, armour and some food",
    "kills": "Ithoi the Navigator (level 35)",
    "template": "quest details"
  },
  {
    "start": "Speak to Lord Kandur Hosidius at his home in Hosidius, north-west of the Vinery.",
    "startmap": "1782,3570",
    "difficulty": "Intermediate",
    "description": "Artur Hosidius has gone missing, and Lord Kandur Hosidius needs your help to find his son and bring him home.",
    "length": "Short",
    "requirements": "*Completion of the following quests:\n**Client of Kourend\n***X Marks the Spot\n* \n*20% Hosidius favour\n*Ability to kill a level 36 Sand Snake",
    "kills": "Sand Snake (level 36)",
    "recommended": "*\n*Skills necklace to teleport to Woodcutting Guild\n*Xeric's talisman\n*Super energy/Stamina potions\n*A weapon\n*Food (if low level)\n*An Arceuus Library Teleport\n*Dramen/Lunar staff for fairy ring teleport to Arceuus, Ardougne cloak 1's monastery teleport brings you close to a fairy ring as well as the amulet of glory to Edgeville then running east to the grand exchange fairy ring. Alternatively, if you haven't completed the Ardougne easy diary, a Games necklace to teleport to Wintertodt.",
    "template": "quest details"
  },
  {
    "start": "Talk to an examiner in the Exam Centre south of the digsite.",
    "startmap": "3361,3340",
    "difficulty": "Intermediate",
    "description": "Feeling uneducated? Desperate for buried treasure?\n\n\"There's gold in them there hills\" (well stream actually) as well as many other items that can be found at the digsite. Join the students in their attempt to be a qualified archaeologist, and become experienced in making the earth move!\n\nHave you got what it takes to unearth the hidden altar to one of RuneScape's lesser-known Gods?",
    "length": "Medium",
    "requirements": "* \n*  \n*",
    "items": "* Pestle and mortar\n* Vial\n* Tinderbox\n* Cup of tea (can be stolen from the Varrock tea stall)\n* 2 ropes (can be stolen from a Digsite workman, but with average luck, this can easily take more than 15 minutes.)\n* Opal or uncut opal (small chance to acquire while panning for a quest item)\n* Charcoal (obtainable during the quest, but may take some time)\n* Specimen brush (obtained during the quest)\n* Specimen jar (obtained during the quest)\n* Panning tray (obtained during the quest)\n* Trowel (obtained during the quest)",
    "recommended": "* 2 Varrock Teleports\n* Some energy potions or stamina potions to save time walking around\n* 6 Digsite teleports to teleport you just north of the Exam Centre (includes one for starting the quest)",
    "template": "quest details"
  },
  {
    "start": "Begin this mini-quest by getting your enchanted key. If lost, it can be reclaimed from the silver merchant in East Ardougne for 500 coins.",
    "startmap": "2658,3315",
    "length": "Medium",
    "requirements": "Finished Making History",
    "items": "*Enchanted key (remove from your steel key ring if you previously put it there)\n*Spade",
    "recommended": "*Weight-reducing clothing\n*Stamina or energy potions\n*Fast travel between several locations\n**Rellekka (Enchanted lyre or Fremennik sea boots, or House teleport if your house is in Rellekka)\n**Ardougne (Ardougne teleport or Ardougne cloak)\n**Tree Gnome Stronghold (Balloon Transport System, Gnome Glider, Spirit Tree, Slayer Ring to the Slayer Cave or Necklace of Passage to the Outpost)\n**North of Falador (Skull Sceptre or Combat Bracelet to the Monastery)\n**South of Falador (Skills Necklace to the Crafting Guild)\n**Varrock (Varrock teleport, Chronicle or Combat Bracelet to Champions' Guild)\n**Mudskipper Point (Rat Pits minigame teleport or Fairy Rings to )\n**Lumbridge Swamp (Lumbridge teleport or Necklace of Passage to the Wizards' Tower)\n**Al-Kharid (Ring of Dueling or Amulet of Glory)",
    "difficulty": "Intermediate",
    "template": "quest details"
  },
  {
    "description": "After you foiled a plan to destroy the Grand Tree things have been quiet in the gnome world. Brimstail has found a strange machine, though, built by Oaknock the Engineer during the Gnomes' Golden Age. What does the weird device do? Why on RuneScape was it built? If you agree to help this bookworm gnome get this confusing device working, you will learn a little about gnome magicks, gnome history, and you will start to uncover a new threat (or is it an old one?) to gnome security - a threat that is a lot harder to see ...",
    "start": "Speak to Brimstail in his cave south-west side of the Tree Gnome Stronghold, directly west of the bank near the Stronghold Slayer Cave.",
    "startmap": "2406,9817",
    "difficulty": "2",
    "length": "Medium",
    "requirements": "*Completed The Grand Tree quest\n* \n*",
    "items": "*Bucket of sap or a knife and an empty bucket\n*Mud rune\n*Maple logs\n*Oak logs\n*Hammer\n*Saw\n*Pestle and mortar",
    "recommended": "*Several free inventory slots (about 8) to solve the puzzles easier\n*Fast travel to the Tree Gnome Stronghold (Balloon Transport System, Gnome Glider, Spirit Tree or Slayer Ring to the Slayer Cave to directly reach the Stronghold -- alternatively, use a Necklace of Passage to the Outpost and walk north)\n*Fast travel to Hazelmere (Fairy rings to, or Watchtower or Nightmare Zone minigame teleport and walk east if you have no access to fairy rings)\n**Slayer ring to the Slayer Dungeon or a Necklace of Passage to the Wizards' Tower for easy access to fairy rings",
    "kills": "Evil creature (x6)",
    "ironman": ", or, or Managing Miscellania to get a maple log.\n\n Runecraft needed for ironmen to craft a mud rune, unless obtained by a monster drop, essence impling, or purchased from the Mage Training Arena with Pizazz points.\n[[File:Ultimate ironman chat badge.png]] Magic glue can be made before starting the quest by grinding the mud rune with the pestle and mortar and using it on a bucket of sap, saving inventory space.",
    "template": "quest details"
  },
  {
    "start": "Talk to Ali Morrisane east of the Gem Trader in northern Al Kharid.",
    "startmap": "3302,3211",
    "difficulty": "Intermediate",
    "description": "Ali Morrisane - RuneScape's self proclaimed 'greatest merchant' - is having difficulties. He is selling things at such a rate that he cannot keep his market stall in stock.\n\nWord has it that he is on the lookout for someone; someone who can recruit some help from his home town Pollnivneach - a somewhat anarchic place, south of the Shantay Pass.",
    "length": "Medium",
    "requirements": "* \n* The ability to kill a level 70 bandit and a level 75 Menaphite (both can be safespotted).",
    "items": "* 500 coins\n* Gloves (not all work, but leather gloves and graceful gloves do, as well as many others. Barrows gloves, ice gloves, vambraces and Slayer gloves do NOT work!)\n* Kharidian headpiece (can be bought from Ali Morrisane)\n* Fake beard (can be bought from Ali Morrisane)\n* 3 beers (can be obtained during quest, bought from Ali the Barman for 2 coins each)\n* Bucket (can be obtained during quest, spawns at the location it is needed – bring three extra buckets if you plan on doing My Arm's Big Adventure as three Ugthanki dung is needed for that quest). One more might be needed for Forgettable Tale... (1/25 chance for each player).\n* if you have the snake charm in your bank already you will need to retrieve it",
    "recommended": "* \n* Stamina or energy potions\n* Armour and some food\n* Waterskin (one is enough)\n* Fast travel to Al Kharid (Ring of Dueling or an Amulet of Glory)\n* Fast travel to Pollnivneach (Magic carpet or Pollnivneach teleport, or House teleport if your house is in that city)\n** Ring of Charos (a) to save money on magic carpet rides",
    "kills": "* Bandit champion (level 70)\n* Tough Guy (level 75)",
    "template": "quest details"
  },
  {
    "start": "Speak to Lady Vulcana Lovakengj in Lovakengj.",
    "startmap": "1483,3748",
    "difficulty": "Intermediate",
    "description": "For thousands of years, the Wintertodt has remained safely sealed behind the great Doors of Dinh. Alas, despite the best attempts of the Lovakengj smiths and the Arceuus mages, the doors are failing. Only Dinh himself knew the secrets behind the creation of these doors. Without his knowledge, there may be nothing to stop the Wintertodt escaping and bringing ruin upon Kourend. It is up to you to recover this knowledge.",
    "length": "Short",
    "requirements": "*Completion of the following quests:\n**Client of Kourend\n***X Marks the Spot\n*20% Lovakengj favour",
    "items": "*Tinderbox (obtainable during quest)",
    "recommended": "*Antipoison\n*Food\n*Stamina potion\n*Teleports to the quest start, Lovakengj Assembly:\n**Xeric's talisman\n**Fairy ring code, may require a dramen or lunar staff\n**Battlefront teleport\n**Kharedst's memoirs with Shayzien teleport\n*Wintertodt Teleport:\n**Games necklace\n*Bring 6 Coal and 1 Adamantite ore to complete a Hard Kourend & Kebos Diary task (requires )",
    "kills": "None",
    "template": "quest details"
  },
  {
    "start": "Speak to Brundt the Chieftain in Rellekka.",
    "startmap": "2658,3668",
    "difficulty": "Master",
    "description": "The Fremennik bards often sing tales of the past. Of great battles, deadly foes and heroes long gone. However, in recent years, things have been much quieter in the Province, as there's increasingly less to sing about. All that is about to change though, as what starts off as a simple investigation soon leads to one of the greatest threats the Fremennik have ever seen.",
    "length": "Medium",
    "requirements": "No boosts allowed:\n* \n* \n* \n* \n* \n*Completion of the following quests:\n**The Fremennik Isles\n***The Fremennik Trials\n**Lunar Diplomacy\n***Lost City\n***Rune Mysteries\n***Shilo Village\n****Jungle Potion\n*****Druidic Ritual\n**Mountain Daughter\n**Heroes' Quest\n***Dragon Slayer I\n***Lost City\n***Merlin's Crystal\n***Shield of Arrav",
    "items": "*Combat equipment\n*Mirror shield\n*2 Kegs of beer (cannot be obtained in Rellekka during quest, buy from Thora the Barkeep before starting the quest)\n*1 Molten glass\n*100 Astral runes\n*Pet rock\n*Fishing rod or fly fishing rod\n*Fremennik shield (this is not the tradeable Neitiznot shield)\n**Alternatively, get it from Bardur AFTER being exiled, for either or for free using a Ring of charos (a)\n**Recommended: Rune thrownaxes to get to Bardur in the Waterbirth Island Dungeon\n*Ice gloves or Smiths gloves (i)\n*Hammer\n*Glassblowing pipe\n*3 Lunar bars or ores. Alternatively a pickaxe to obtain them. \n*Seal of Passage (if the elite Fremennik diaries aren't completed)",
    "recommended": "*\n*Stamina potions\n*Moonclan teleport (tablet)s\n*Food, Monkfish or better\n*Enchanted lyre, Fremennik sea boots or other means to return to Rellekka",
    "kills": "*Basilisk Youngling (level 53)\n*Basilisk (level 61)\n*Monstrous Basilisk (level 135)\n*Typhor (level 218)\n*The Jormungand (level 363)",
    "template": "quest details"
  },
  {
    "start": "Speak to Mord Gunnars at the northernmost dock of Rellekka.",
    "startmap": "2646,3710",
    "difficulty": "3",
    "description": "Sibling rivalry can get messy - more so when the siblings are Fremennik princes with a point to prove. The islands of Jatizso and Neitiznot were set up by two brothers who hated each other, and they have been at loggerheads ever since. But now there is a new threat from trolls in the north...\n\nCan you prove your loyalty to both brothers and save the islanders from a fate as troll food? Your skills as a Fremennik warrior, a bridge builder and... a jester will be tested on the islands.",
    "length": "Medium",
    "requirements": "*Completion of The Fremennik Trials\n* \n*The ability to kill a level 122 Troll King (Damage can be reduced) and, separately, 10 rock throwing ice trolls in a multicombat area.",
    "recommended": "*\n* to optionally go to the Central Fremennik Isles mine\n* for Protect from Melee\n*A Catspeak amulet for amusing dialogue during the initial conversation with Jatizso's king\n*Food/armour at all times (in case you get attacked by trolls on the northern island)\n*Prayer potions - as there is no altar close by\n*Good combat equipment to kill 10 low-Defence, high-Attack monsters, and one level 122\n**A melee weapon and decent melee stats - as the Ice Troll King has very high Ranged and Magic Defence\n**An emergency teleport",
    "items": "*A raw tuna (obtainable during quest, with 35 fishing or bought from the shop)\n*Either 8 tin ores, 7 pieces of coal, or 6 mithril ores (depends on your Mining level; levels 1-9 will require tin ore, 10-54 will require coal, and 55-99 require mithril ore). Note: The ores can be noted.\n*9 ropes (obtainable during quest with )\n*If the Neitiznot shield is already purchased, only 8 ropes are required.\n*A knife\n*8 split logs (obtainable during the quest with 56 Woodcutting and an axe)\n*a Neitiznot shield (or 56 Woodcutting, a hammer and a bronze nail)\n*Yak-hide armour top and legs (or 46 Crafting, a needle and two thread)\n*5000 coins (optional)",
    "kills": "*10 Ice Trolls (level 74-82)\n*Ice Troll King (level 122)",
    "ironman": "* Woodcutting Required to make a Neitiznot shield with a hammer and one bronze nail\n* Crafting Required to make yak-hide armour with a needle and a thread\n*An axe\n [[File:Ultimate ironman chat badge.png]] The player will need to hand 17 items in at once.",
    "template": "quest details"
  },
  {
    "start": "Speak to Brundt the Chieftain (located in the longhall) in Rellekka.",
    "startmap": "2658,3668",
    "difficulty": "2",
    "description": "Council workmen have at last found the time to make repairs to the footbridge that connects Kandarin with the Barbarian town of Rellekka.\n\nDo you have what it takes to impress the barbarians who live there, and perhaps be welcomed as an honorary member of their clan?",
    "length": "Medium",
    "requirements": "*If crafting the lyre:\n** \n**  \n**  \n* OR\n** Players can kill Lanzig, Borrokar, Lensa or Freidir to obtain the lyre (1/17 chance)\n* Ability to defeat a level-69 Draugen\n* Ability to defeat a fairly strong warrior without armour, weapons, or spells",
    "items": "* 5,252 coins\n* Beer (obtainable during quest)\n* Tinderbox\n* Either a raw shark, raw manta ray, or raw sea turtle\n* If crafting the lyre yourself:\n** Woodcutting axe\n** Knife\n** Potato (obtainable during quest)\n** Onion (obtainable during quest)\n** Cabbage (obtainable during quest)",
    "recommended": "* \n* (when locating the Draugen)\n* Some food. If you forgot food, go to Peer the Seer's house and commence with his challenge. Search until you find a red herring. Cook the herring and get a cooked herring with red goop. Drop the goop and search the same place again to receive another red herring. Repeat. You should be able to get enough food to help with your combat tests. Once you use the red goop on the wooden disk from the house, you will no longer be able to search for a Red Herring.\n* Armour and a weapon (note: Ranged is not effective)\n* 3-5 prayer potions\n* Stamina potions\n* A super combat potion or super set\n* Camelot teleport\n* Rellekka teleport or Teleport to House if your house is located in Rellekka\n** Fairy ring  or  may also be used \n* 7 rings of recoil (only if attempting to defeat Koschei's final form)",
    "kills": "* Koschei the deathless (first three forms)\n* Draugen (level 69)\nOPTIONAL\n* Lanzig, Borrokar, Lensa or Freidir (level 48) (multiple times)",
    "ironman": "*  is required to fish for raw sharks. Alternative methods to obtain one are:\n** Rufus' Meat Emporium in Canifis sells a single raw shark.\n** Frankie's Fishing Emporium in Port Piscarilius sells raw shark, but requires 100% Piscarilius favour.\n** River trolls in the Enchanted Valley drop them commonly, but require access to fairy rings.\n** Brine rats, combat level 70, require  commonly drop noted and unnoted raw sharks.\n** Waterfiends, combat level 115, rarely drop noted raw shark.\n** Mogres, combat level 60, require completion of Skippy and the Mogres, , and fishing explosives to attack. They can rarely drop a raw shark.\n** Wintertodt can drop a raw shark after , though it will be very rare, but chances increases with Fishing level. \n* [[File:Ultimate ironman chat badge.png]] Sections of this quest have strict inventory requirements:\n** Thorvald the Warrior: No weapons, armour, or runes. (Looting bags are also disallowed, regardless of their contents)\n** Peer the Seer: No items at all equipped or in your inventory.",
    "template": "quest details"
  },
  {
    "start": "Receive an important letter from a messenger.",
    "difficulty": "Master",
    "length": "Short",
    "members": "Yes",
    "requirements": "* Completion of Desert Treasure I\n* \n*  \n*  \n*",
    "items": "* Mith grapple\n* A crossbow\n* 2 ropes to reach Saradomin's Encampment; one-time only\n* A hammer or dragon warhammer",
    "recommended": "* \n* Equipment to kill all four God Wars Dungeon generals",
    "kills": "* Kree'arra (level 580)\n* General Graardor (level 624)\n* Commander Zilyana (level 596)\n* K'ril Tsutsaroth (level 650)\n\nAlternatives:\n\n*Flight Kilisa (level 159)\n*Wingman Skree (level 143)\n*Flockleader Geerin (level 149)\n*Sergeant Strongstack (level 141)\n*Sergeant Steelwill (level 142)\n*Sergeant Grimspike (level 142)\n*Bree (level 146)\n*Starlight (level 149)\n*Growler (level 139)\n*Tstanon Karlak (level 145)\n*Zakl'n Gritch (level 142)\n*Balfrug Kreeyath (level 151)",
    "template": "quest details"
  },
  {
    "start": "Search the tent at the campsite found east of the chasm at the southern end of the Kebos Lowlands.",
    "startmap": "1312,3472",
    "difficulty": "Intermediate",
    "description": "In our newest Twisted Tale, you’ll piece together a long-lost language and unravel the mystery of some ancient ruins. Welcome, adventurer, to The Garden of Death.\n\nThis quest contains no dialogue and focuses solely on environmental storytelling, so make sure that you set aside some time and prepare to be fully immersed in the world around you!",
    "length": "Short",
    "requirements": "*",
    "items": "* Secateurs (obtainable during quest) (magic secateurs also work)",
    "recommended": "* \n* Antipoison\n* Book of the dead or Kharedst's memoirs to teleport close to the Ruins of Morra\n* Teleport to a fairy ring for quick access to Lake Molch\n* Xeric's talisman for fast teleportation around the Kebos Lowlands\n* A few Stamina potions or Super energy potions",
    "template": "quest details"
  },
  {
    "start": "Speak to the ghost of General Khazard roaming around the woods south-east of Rellekka.",
    "startmap": "2716,3631",
    "length": "Medium",
    "requirements": "*Curse of the Empty Lord, for full ghostly robes\n**Started Desert Treasure I, for the ring of visibility\n*Fight Arena",
    "items": "*40 coins (70 coins if using boat to Karamja)\n*Shantay pass (if not using fairy ring )\n*Ghostspeak amulet (Morytania legs will not work)\n*All pieces of the Ghostly robes set\n*A ring of visibility",
    "recommended": "*\n*Teleports to Falador (Explorer's ring 2 or better), Karamja (Tai bwo wannai teleport is a fast method), Al Kharid, the Grand Tree (Necklace of passage), Seers' Village and the Fishing Guild\n*Dramen or Lunar staff or Slayer Ring to teleport near to General Khazard.\n*Waterskins\n*A good weapon and armour\n*Some food",
    "kills": "Ghost of Bouncer (level 160) (cannot use Prayer)",
    "difficulty": "Experienced",
    "template": "quest details"
  },
  {
    "start": "The Keldagrim mines east of Rellekka and north of the Mountain Camp. Follow the dwarven statues to the underground river.",
    "startmap": "2842,10129",
    "difficulty": "Intermediate",
    "description": "Five hundred years have passed since the rule of King Alvis, saviour of Keldagrim and victim of his own inventions.\n\nHe founded the Consortium: the gathering of Mining companies that were to serve the monarchy. But, eventually, the monarchy came to serve the Consortium.\n\nBy the time of his death, the monarchy was all but abolished. Now the Kings in Keldagrim are but a distant memory... with only the statue of King Alvis to remind the people of the old days, the dark days.\n\nSo begins the Rise of the Red Axe, the new multi-part storyline centred around the dwarves and their capital of Keldagrim. The first quest, The Giant Dwarf, introduces the city and the powerful business Consortium that rules the dwarven realm. Discover weird goings-on, narrowly escape from falling chunks of rock, ride around in minecarts and... make sure you don't bump into the wrong person on the way to the city!",
    "length": "Medium",
    "requirements": "* \n*  \n*  \n*",
    "items": "* 200 coins\n* Means to cast Telekinetic Grab (air and law rune)\n* Logs (most logs will work, however, arctic pine, redwood & coloured logs do not work)\n* Tinderbox\n* Coal (obtainable during the quest with 30 Mining)\n* Iron bar\n* 3 cut sapphires (purchasable during the quest)\n* Various ores and bars (mostly obtainable during the quest, see below)\n* Redberry pie (unless you have previously given Thurgo a pie for free -- outside the The Knight's Sword quest)",
    "recommended": "* Fast travel to several locations\n** Keldagrim, east of Rellekka (Fairy rings to, Enchanted Lyre, Rellekka teleport or Teleport to House if your house is in Rellekka)\n** Mudskipper Point (Fairy rings to , Rat Pits grouping teleport to Port Sarim, Rimmington teleport or Teleport to House if your house is in Rimmington)\n** Varrock, if you have not yet met Thurgo in The Knight's Sword (Varrock teleport, Chronicle, Ring of Wealth to the Grand Exchange or Combat Bracelet to the Champions' Guild)\n*Stamina or energy potions\n*About 10 of each of the following items in your bank, which may or may not be necessary for the timed delivery tasks;\n**Clay (not soft clay)\n**Copper ore\n**Tin ore\n**Iron ore\n**Silver ore\n**Gold ore\n**Mithril ore\n**Coal\n**Bronze bar\n**Iron bar\n**Silver bar\n**Gold bar\n**Steel bar\n**Mithril bar\n**Alternatively, you can gather all these materials, except clay, during the quest with , and either about 5000 coins or a pickaxe and.",
    "template": "quest details"
  },
  {
    "description": "Deep in the desert stand the ruins of the once great city of Uzer, where a lone survivor, an ancient clay golem, forever paces back and forth. It is badly damaged, and its mind cannot rest until it has completed the task for which it was created.\n\nIt is up to you to uncover the secret of the lost city, and add the final chapter to a story started in the violence of the Third Age.",
    "start": "Talk to the clay golem in the ruins of Uzer, east of the Shantay Pass in the Kharidian Desert.",
    "startmap": "3488,3089",
    "difficulty": "2",
    "length": "Short",
    "requirements": "* \n*",
    "items": "* Vial\n* Pestle and mortar\n* Papyrus (can be bought from Ali Morrisane for 10gp)\n* 4 soft clay (or a bracelet of clay and a pickaxe to mine north-west of the ruins)\n* Phoenix feather (can be obtained north-west of the ruins)\n* Means to enter the desert (such as the Shantay pass, Teleport tablets or scrolls, Fairy rings or the Pharaoh's sceptre)",
    "recommended": "* Protective clothing for the desert heat (Desert boots, Desert robe, Desert shirt)\n* Waterskins\n* Stamina or energy potions\n* Fast travel to Uzer (Necklace of passage to Eagles' Eyrie or Fairy ring to )\n* Fast travel to the Digsite (Digsite pendant, Digsite teleport or the Gnome glider)\n* Fast travel to the Varrock Museum (Varrock teleport)\n* Hammer and chisel to remove gems from the throne",
    "template": "quest details"
  },
  {
    "start": "Talk to King Narnode Shareen in the Grand Tree.",
    "startmap": "2466,3495",
    "difficulty": "2",
    "description": "The Grand Tree, which shelters the majority of the small gnome population of RuneScape, is dying. Is it human sabotage or an inside job? Help King Shareen to find the true cause and save the tree gnomes from an uncertain fate.",
    "length": "Medium",
    "requirements": "* \n* The ability to defeat a level 172 Black demon (safespottable for Ranged and Magic or melee using a halberd).",
    "items": "* 1,000 coins, unless you have helped Femi or completed Tree Gnome Village and plan to use spirit trees.",
    "recommended": "*\n*Stamina or energy potions\n*Fast travel to the Tree Gnome Stronghold (Balloon Transport System or Slayer Ring to the Slayer Cave to directly reach the Stronghold -- alternatively, use a Necklace of Passage to the Outpost and walk north)\n*Fast travel to Hazelmere (Fairy rings to, or Watchtower or Nightmare Zone minigame teleport and walk east if you have no access to fairy rings)\n**Slayer ring to the Slayer Dungeon or a Necklace of Passage to the Wizards' Tower for easy access to fairy rings",
    "kills": "* Black demon (level 172) (can be safespotted)",
    "template": "quest details"
  },
  {
    "description": "The peaceful contemplation of the monks of Harmony Island has been disturbed by such rude interruptions as an invasion of zombie pirates and the theft of their brains! The evil zombie pirates have returned with a new scheme, and it's up to you to try to re-mind these poor priests before the sinister Mi-Gor completes his experiments...",
    "start": "Talk to Brother Tranquility in Mos Le'Harmless.",
    "startmap": "3682,2963",
    "length": "Medium",
    "difficulty": "3",
    "requirements": "* (Cabin Fever requires 45 Crafting.)\n* \n* \n*Must have completed the following quests:\n**Creature of Fenkenstrain\n**Cabin Fever\n***Pirate's Treasure\n***Priest in Peril\n***Rum Deal\n****Zogre Flesh Eaters\n*****Big Chompy Bird Hunting\n*****Jungle Potion\n******Druidic Ritual\n**Freeing Pirate Pete of Recipe for Disaster\n***Another Cook's Quest\n****Cook's Assistant\n*Access to a player-owned house workshop and crafting table or the Grand Exchange\n*Be able to kill a level 190 monster that can disable Prayers (can be safespotted without taking damage).",
    "items": "*Fishbowl helmet\n*Diving apparatus (obtain these from Murphy in Port Khazard if you've lost them; talk to him 2 times, 1st time for helmet and 2nd time for apparatus.)\n*10 wooden cats – you must progress far enough in the quest to make these yourself, or buy them from the Grand Exchange at any time\n**4 oak planks and a saw (if you are providing your own crafting table and do not already have one; build in the Clockmaking space of the Workshop)\n**10 planks (if making your own wooden cats)\n**10 pieces of fur: fur, bear fur or grey wolf fur (if making your own wooden cats) (wolf fur can be obtained during quest by killing Canifis townsfolk. Baraek sells them for 20 gold each. Furs from Hunter monsters will not work)\n*A hammer (Note: Imcando hammer does not work)\n*About 100 nails (38 are needed, but some—especially bronze or iron—may bend)\n*8 normal planks (18 if making the wooden cats instead of buying them from the Grand Exchange)\n*Holy symbol\n*Ring of charos (if lost, can be re-obtained during quest by pickpocketing Fenkenstrain)",
    "recommended": "*\n*Means of teleportation to Port Phasmatys (through the Ectophial)\n*Charged Combat Bracelet to teleport to the Monastery, (or a charged Amulet of Glory to teleport to nearby Edgeville),\n*Runes to cast Fenkenstrain's Castle Teleport twice (or its magic tablet equivalent)\n*If making the wooden cats, Runes to teleport to your (or another player's) house or its magic tablet equivalent, are highly recommended.\n*Three watermelon seeds, rake, seed dibber and ultracompost to complete a step in the Hard Morytania Diary (requires 47 Farming).\n*Weapon and armour (ranging or maging gear is highly recommended as safespotting is available)\n*Food and prayer potions are highly recommended",
    "kills": "*Barrelchest (level 190)\n*4 Sorebones (level 57)",
    "template": "quest details"
  },
  {
    "start": "Talk to Bert in Yanille, near the sand pit.",
    "startmap": "2550,3100",
    "difficulty": "2",
    "description": "Bert the Sandman in Yanille is in a spot of bother. A mysterious severed hand has appeared in his sand box. Help find out whose hand it is and, more to the point, how it got in Bert's sand box.",
    "length": "Short",
    "requirements": "* \n*",
    "items": "*Beer (can be obtained during quest)\n*About 150 coins\n*2 empty vial\n*Redberries (Purchasable during the quest from the Food Store in Port Sarim)\n*White berries\n*Lantern lens\n*5 earth runes (can be bought from Betty for 20 gp)\n*Bucket of sand (obtainable during quest if you bring a bucket)",
    "recommended": "* 1 extra vial to pay for fast travel to Port Sarim\n* Fast travel to Yanille (Yanille teleport, Watchtower teleport, Nightmare Zone grouping teleport or House teleport if your house is in Yanille)\n* Fast travel to Brimhaven (Brimhaven teleport, Teleport to House if your house is in Brimhaven, via a charter ship or via Captain Barnaby's ship from Ardougne using the Ardougne teleport or Ardougne cloak)\n* Fast travel to Port Sarim",
    "ironman": "Ultimate ironman chat badge.png The player briefly visits Entrana.\nIronman chat badge.png White berries (acquired by, monster drops, cave crawlers the easiest, or a spawn at the Wilderness Lava Dragon Isle. Alternatively, you can get them from Isafdar, north of the Elf Tracker. With 40 Agility they can also be obtained as a drop from Chaos druid warrior in the Yanille Agility Dungeon)",
    "template": "quest details"
  },
  {
    "start": "Speak to the squire in the courtyard of the White Knights' Castle in Falador.",
    "startmap": "2977,3342",
    "difficulty": "Intermediate",
    "description": "Sir Vyvin's squire is in trouble. He has accidentally lost Sir Vyvin's ceremonial sword. Help him find a replacement without Sir Vyvin finding out.",
    "length": "Short",
    "requirements": "* \n* The ability to run from level 57 ice warriors and level 53 ice giants could help.",
    "items": "* Redberry pie (not half a redberry pie), (Members can purchase one from Romily Weaklax in the Cooking Guild)\n* Any pickaxe (one spawns in south Falador)\n* 2 iron bars (4 if you want your own blurite sword) (one spawns west of the Graveyard of Shadows in the Wilderness)\n* Blurite ore (2 if you want your own blurite sword; it can be obtained during the quest (plus 1 additional ore if doing Falador easy diary (members only)))",
    "recommended": "* \n* Fast travel to Varrock (Varrock teleport)\n* Fast travel to Falador (Falador teleport)\n* (Members only) Fast travel to Rimmington (Pest Control minigame teleport, Fairy Rings to, Rimmington Teleport or Teleport to House if the player's house is in the village)\n* Armour and some food for aggressive enemies near the blurite rocks",
    "ironman": "* Smithing (not needed if obtaining iron bar from drops)\n*  Mining (not needed if obtaining iron bar from drops)\n*  Cooking (Pie dish can be found easily in the kitchen of Varrock Palace, and can be cooked there as well. Best to come here after speaking to Reldo)\nFor ironmen to obtain the iron bars, head to the trees located in level 18 Wilderness next to the bears west of the Graveyard of Shadows. A safer alternative is to kill dwarves in the mines under Falador.",
    "template": "quest details"
  },
  {
    "start": "Talk to Sigmund in Lumbridge Castle.",
    "startmap": "3210,3222,plane:1",
    "difficulty": "2",
    "description": "Sigmund is the advisor to the Duke of Lumbridge, but the duke does not always take his advice.\n\nWhen part of the cellar wall collapses the duke insists the damage was caused by an earthquake, but Sigmund is worried about a monster attack.\n\nIf you investigate this mystery it will lead you through treacherous caves to uncover something lost by the Gods for thousands of years.",
    "length": "Short",
    "requirements": "* Completion of the following quests:\n** Goblin Diplomacy\n** Rune Mysteries\n* \n*  \n*",
    "items": "* Pickaxe\n* Light source (Note: Candles, torches and oil lamps can cause swamp gas explosions if going off-route, and need a tinderbox to stay lit)",
    "recommended": "* Fast travel to Varrock, Falador and Lumbridge (teleport spells or tablets)\n* Lockpick for the H.A.M. Hideout if Thieving is low.\n* Stamina potion if below 70 Agility",
    "template": "quest details"
  },
  {
    "start": "Speak to Tomas Lawry outside the Port Piscarilius bank.",
    "startmap": "1796,3782",
    "difficulty": "Intermediate",
    "description": "The gangs of Kourend have recently been uniting under a mysterious figure called the Queen of Thieves, somewhere in Port Piscarilius. This novice quest tasks the player with infiltrating the gangs of Kourend in order to find the Queen of Thieves.",
    "length": "Very Short",
    "requirements": "*Completion of the following quests:\n**Client of Kourend\n***X Marks the Spot\n* \n*20% Port Piscarilius favour\nNote: Use \"A Favour Certificate\" reward from Client of Kourend on Piscarilius for 20% favour.",
    "items": "* Stew (Cooking ingredients can be obtained during quest for 6 coins. Requires 25 cooking) Or bought from Forester's Arms bartender in Seer's Village for 20gp.",
    "recommended": "*Stamina potion\n*Coins\n*Kourend Castle Teleport",
    "template": "quest details"
  },
  {
    "start": "Speak to Father Aereck in the chapel south-east of Lumbridge Castle.",
    "startmap": "3243,3210",
    "difficulty": "1",
    "description": "A ghost is haunting Lumbridge graveyard. The priest of the Lumbridge church of Saradomin wants you to find out how to get rid of it.",
    "length": "Short",
    "requirements": "Capable of killing or running away from a combat level 13 skeleton.",
    "recommended": "* \n*Three Lumbridge teleports\n*(Members only) Necklace of Passage to the Wizards' Tower",
    "kills": "Skeleton (level 13) (can be avoided)",
    "template": "quest details"
  },
  {
    "start": "Speak to Sir Tiffy Cashien in Falador Park.",
    "startmap": "2997,3373",
    "difficulty": "2",
    "description": "The small village of Witchaven was all but deserted when the Fishing Platform was built a short ways off the coast. Now, some of the inhabitants of the village have been acting somewhat strangely....",
    "length": "Medium",
    "requirements": "*Completion of the following quests:\n**Wanted!\n***Recruitment Drive\n****Black Knights' Fortress\n****Druidic Ritual\n***The Lost Tribe\n****Rune Mysteries\n****Goblin Diplomacy\n***Enter the Abyss\n***Priest in Peril\n**Sea Slug\n* \n* \n* \n* \n*The ability to defeat a level 62 enemy with Melee.\n*You must have the Commorb in your inventory to start the quest.",
    "items": "*Commorb (can get another by speaking to Sir Tiffy)\n*Swamp paste (not consumed)\n*Dead sea slug (obtainable during the quest)\n*At least 5 rune/pure essence (bring 15–20 in case they shatter; succeeding with 5 is very unlikely)\n*Chisel\n*5 open inventory slots\n*Access to the Air, Water, Earth, Fire and Mind Altars\n**Elemental talisman OR Air, Water, Earth and Fire talismans or tiaras\n**Mind talisman or tiara\n*:OR\n**Travelling through the Abyss or using a Runecraft cape\n*:OR\n**Access to Guardians of the Rift",
    "kills": "Slug Prince (level 62)",
    "recommended": "*\n*Charged abyssal bracelet if going through the Abyss\n*Stamina or energy potions\n*Fast travel to several locations\n**Falador (Falador teleport)\n**Witchaven (Ardougne teleport or fairy rings to )\n**Outpost (necklace of passage)\n**Ring of the Elements\n**Air Altar (Falador teleport, skills necklace to the Crafting Guild or travelling through the Abyss)\n**Water Altar (Lumbridge teleport, necklace of passage to the Wizards' Tower or the Abyss)\n**Earth Altar (Varrock teleport, Lumberyard teleport, Digsite pendant, balloon transport system or the Abyss)\n**Fire Altar (ring of dueling or amulet of glory to Al Kharid, gnome glider or the Abyss)\n**Mind Altar (Mind Altar teleport tablet, Falador teleport or the Abyss)\n**Abyss, if using that method (amulet of glory to Edgeville, ring of wealth to the Grand Exchange or fairy rings to )\n**Wizard's Tower, if using Guardians of the Rift to access the altars (necklace of Passage, amulet of glory to Draynor Village, or fairy rings to )\n*Armour and some food\n*Melee weapon to defeat the Slug Prince, which cannot be damaged in other ways\n*Prayer potions to counter the Slug Prince's prayer drain",
    "template": "quest details"
  },
  {
    "start": "Speak to Irena by the Shantay Pass, south of Al Kharid.",
    "startmap": "3303,3113",
    "difficulty": "2",
    "description": "South of Al Kharid a new desert pass has opened up, leading to the dangers of the Kharid desert.\nEquip your desert garb and make sure your waterskin is full before heading off into the trackless dunes in search of desert adventure.",
    "length": "Medium",
    "requirements": "* \n*  \n* The ability to defeat a level 47 enemy",
    "items": "Note that all of the required items can be bought from Shantay at the Shantay Pass.\n* Full Desert clothing (shirt, robe and boots required). You will lose them. (Desert robes, Black desert robe, and Black desert shirt does not work)\n* 1-3 Bronze bars (can be lost while experimenting)\n* A hammer\n* 30-50 feathers\n* Means to enter the desert. (Such as the Shantay pass, Desert amulet 2, Teleport tablet or scrolls, Fairy rings or the Pharaoh's sceptre)",
    "recommended": "* \n* Inventory space to unequip all combat items at the start of the quest. This is required after the Mercenary Captain's death.\n* 1-2 full waterskins and a knife or slash weapon to refill them by cutting cacti. (They can also be refilled from the bowl of water at the desert camp)\n* Plenty of Stamina or energy potions.\n* Choosing the incorrect dialogue or getting caught in the mines during the quest will require:\n** 100 Coins to bribe the mine cart driver\n** Pickaxe if caught in the mine to mine 15 rocks to get out",
    "kills": "* Mercenary Captain (level 47)",
    "ironman": "[[File:Ultimate ironman chat badge.png]] You need to unequip your armour and weapons, and require two empty slots in addition to that. Failing dialogue will require 15 empty inventory spaces.",
    "template": "quest details"
  },
  {
    "start": "Talk to King Vargas in the Miscellania Castle. Take the longboat from Rellekka to access Miscellania.",
    "startmap": "2501,3859",
    "difficulty": "3",
    "description": "Rumours have been coming back from Miscellania that all is not well, it is said that the king has been turned into a monster!\n\nAn exceptional hero is required to investigate. Experience in ruling kingdoms, wooing royalty and negotiating peace would be an advantage.",
    "length": "Medium",
    "requirements": "* Completion of the following quests:\n** Heroes' Quest\n*** Shield of Arrav\n*** Lost City\n*** Merlin's Crystal\n*** Dragon Slayer I\n** The Fremennik Trials",
    "items": "* Iron bar\n* Logs (obtainable during the quest if you bring an axe)\n* At least one of these tools in order to gain favour: A pickaxe, an axe (if 45 Woodcutting), a rake (if 10 Farming and 35 Herblore, obtainable during quest for 15 gp), a harpoon or lobster pot\n* Any non-silver ring you are willing to lose (not onyx/dragonstone/explorer/beacon/'perfect' ring)\n* Flowers you are willing to lose (can be bought from Flower Girl in Miscellania for 15 coins; trollweiss, marigold, nasturtiums, and white lily will not work. You can also plant and pick mithril seeds if you do not have flowers yet.)\n* If seeking the Prince: a cake (chocolate cakes work too)\n* If seeking the Princess: any bow (except composite, ogre, training and magic bows!) you are willing to lose",
    "recommended": "* to cut Maple trees to earn approval\n*  to rake flax to earn approval and  to rake herb patch for approval\n* Weight-reducing clothing\n* Stamina or energy potions\n* Dramen/Lunar staff for fairy rings\n* Fremennik Medium Diary for the shortcut between Miscellania and Etceteria",
    "template": "quest details"
  },
  {
    "start": "Talk to Effigy at the Tower of Life just east of the Ardougne Monastery.",
    "startmap": "2639,3218",
    "difficulty": "1",
    "description": "The construction of a mysterious tower is almost complete, but the builders working on it have gone on strike. Losing patience, the alchemists that hired them are looking for anybody to help them. When the world of magic and the world of logic combine you can expect dangerous results, but a true adventurer would cherish such things... wouldn't they?",
    "length": "Medium",
    "requirements": "*",
    "items": "*Hammer\n*Saw (or crystal saw)\n*Beer (must be a regular beer - other beers do not work.)",
    "recommended": "*At least 11 free inventory spaces and 4 more if not wearing the builder's costume\n*One raw chicken and raw swordfish for a Medium Ardougne Diary task after the quest",
    "template": "quest details"
  },
  {
    "description": "The tree gnomes are in trouble. General Khazard's forces are hunting them to extinction.\n\nFind your way through the hedge maze to the gnomes secret treetop village.\n\nThen help the gnomes fight Khazard and retrieve the orbs of protection.",
    "start": "Centre of the Tree Gnome Village Maze, talk to King Bolren.",
    "startmap": "2542,3169",
    "difficulty": "Intermediate",
    "length": "Short",
    "requirements": "* The ability to defeat a level 112 Khazard warlord",
    "items": "* 6 normal logs (or an axe, obtainable during the quest by killing goblins in the Tree Gnome Village maze)\n* Combat equipment",
    "kills": "* Khazard warlord (level 112) (can be safespotted)",
    "recommended": "* \n* Stamina or energy potions",
    "template": "quest details"
  },
  {
    "start": "Speak to Kangai Mau at The Shrimp and Parrot restaurant in Brimhaven.",
    "startmap": "2791,3182",
    "difficulty": "Intermediate",
    "description": "Lord Handelmort of Ardougne is a collector of exotic artefacts. A recent addition to his private collection is a strange looking totem from Karamja. The Rantuki tribe are not happy about the recent disappearance of their totem.",
    "length": "Very Short",
    "requirements": "*",
    "items": "None",
    "recommended": "* Fast travel to Ardougne (Ardougne teleport or Ardougne cloak)\n* Fast travel to Brimhaven (Brimhaven teleport, Teleport to House if your house is in Brimhaven, sail from Ardougne or take a charter ship. An amulet of glory will teleport you to Musa Point, Karamja, just East of Brimhaven.)",
    "template": "quest details"
  },
  {
    "start": "Speak to Ug at the Troll Stronghold.",
    "startmap": "2827,10065,plane:1",
    "difficulty": "Intermediate",
    "description": "Ug loves Aga, but Aga is together with Arrg. Since Arrg is a lot stronger than Ug, Ug can't follow the regular mating ritual, which involves ripping the opponent into pieces. Will you be able to find out what will impress the troll female more than a display of violence? Will you survive the journey to help a lonely troll find love?",
    "length": "Short",
    "requirements": "* \n* Completion of the following quests:\n** Troll Stronghold\n*** Death Plateau\n* The ability to defeat a level 113 troll",
    "items": "* An iron bar\n* Maple or yew logs\n* Rope\n* Climbing boots (not needed if using Trollheim Teleport)\n* Wax (can be made ahead of time)\n** A bucket of wax (use insect repellent on a beehive followed by a bucket)\n** A cake tin\n** Swamp tar",
    "recommended": "* \n* Teleportation runes to Trollheim if completed Eadgar's Ruse\n* A Games necklace\n* A Slayer ring\n* A Dramen staff or Lunar staff and partial completion of Fairytale II - Cure a Queen for access to Fairy rings\n* Prayer potions and decent food for the fight with Arrg\n* A Gem bag to store the reward",
    "kills": "Arrg (level 113) (safespottable; difficult to reach) Note: This fight is not a safe death.",
    "ironman": "*  to cut a maple log\n** OR Enough combat stats and supplies to get a 1/128 drop of yew logs from Swamp Crabs (Requires completion of Priest in Peril).\n** OR Enough supply of Serum 208 to get a 1/128 drop of maple logs from curing Afflicted (Requires completion of Priest in Peril).\n** OR Throne of Miscellania completed to obtain maple logs from managing Miscellania.\n** OR   to get a maple/yew log via Supply crate from Wintertodt.\n** OR High enough combat stats to kill Giant Mole for a 1/12.8 drop of yew logs.\n*   to smelt an iron bar\n** OR collect a spawn in level 18 Wilderness to the west of the Graveyard of Shadows",
    "template": "quest details"
  },
  {
    "start": "Talk to Denulth in Burthorpe.",
    "startmap": "2896,3528",
    "difficulty": "2",
    "description": "The Imperial Guard raid was a failure, and Dunstan's son has been captured by the trolls!\n\nJourney through Trollheim to the Troll Stronghold, and rescue him!",
    "length": "Short",
    "requirements": "* Completion of Death Plateau\n*   (47 is recommended)\n* The ability to defeat a level 113 Troll General (can be safespotted)",
    "items": "* Climbing boots or 12 coins to buy them",
    "recommended": "* \n* Weapon capable of safespotting (Ranged, Magic, or a Halberd)\n*Armour and some food\n* for Protect from Melee\n*At least  to prevent a fight with two level 71 guards (higher levels are recommended for higher chance of success)\n*Games necklace for Burthorpe teleports\n*Stamina or energy potions",
    "kills": "* Dad (level 101) (can be safespotted)\n* Troll General (level 113) (can be safespotted)\n* Berry and Twig (both level 71) Only if you have less than or fail to pickpocket them (can be safespotted)",
    "template": "quest details"
  },
  {
    "start": "Talk to King Lathas on the of Ardougne Castle.",
    "startmap": "2577,3293,plane:1",
    "difficulty": "3",
    "description": "There are rumours of a secret passageway that can be used to get to the other side of the mountains west of Ardougne. Now it's just a matter of finding it.",
    "length": "Long",
    "requirements": "* \n* Completion of the following quests:\n** Biohazard\n*** Plague City",
    "items": "* Rope (2 recommended)\n* Bow\n* 1-5 arrows (only non-poisoned arrows with metal arrowtips will work. Craw's bow does not work. Crossbows and bolts will not work. Broad arrows, Ogre arrows, and Ice arrows will also not work.)\n* Spade\n* Plank (obtainable during quest)\n* Bucket (obtainable during quest)\n* Tinderbox (obtainable during quest)",
    "recommended": "* \n* to reduce the chance of failing obstacles.\n*  for a helpful shortcut.\n* Weapon or combat spells. Using the bow is recommended if you need to save inventory space.\n* Armour or  for Protect from Melee. Minimising weight may be beneficial for some agility obstacles.\n* Lots of food to survive traps and monsters. Alternatively, Saradomin brews or super restores to reduce weight.\n** Coins to buy food from Kamen (75 coins each time for food that heals a total of 28 hitpoints).\n* West Ardougne Teleport to quickly access the Underground Pass (dungeon) entrance.\n* Level 79 combat will make Blessed spiders non-aggressive, which saves some time while killing Kalrag.\n* Stamina or energy potions\n* 2+ Agility potions or summer pies for players with a low Agility level\n* Telekinetic Grab runes for the Amulet of othanian\n* Any instant teleportation method if you need to leave the dungeon",
    "kills": "* 3 Demons (level 91) (easily safespottable)\n* 3 Paladins (level 62) (easily safespottable)\n* Kalrag (level 89) (safespottable) (won't hit with Protect from Melee)\n* Disciple of Iban (level 13)",
    "template": "quest details"
  },
  {
    "start": "Speak to Morgan in his house in Draynor Village, just north of Ned's house.",
    "startmap": "3098,3268",
    "difficulty": "2",
    "description": "The people of Draynor Village live in constant terror. Their numbers are dwindling, all due to the foul creature lurking in the manor to the north known as a vampyre.",
    "length": "Very Short",
    "requirements": "Able to defeat a combat level 34 vampyre with a very high health recovery rate.",
    "items": "*Hammer (can be bought from the general store just north of the Blue Moon Inn for 1 coin)\n* Beer (can be bought during the quest for 2 coins)\n* Garlic (can be obtained during the quest)\n* Stake (obtained from Dr Harlow after giving him a beer)",
    "recommended": "* \n* Fast travel to Varrock (such as the Varrock teleport)\n* (Members only) Fast travel to Draynor Village (Amulet of Glory or Draynor Manor Teleport)",
    "kills": "Count Draynor (level 34)",
    "template": "quest details"
  },
  {
    "start": "Speak to Morgan in his house in Draynor Village, just north of Ned's house.",
    "difficulty": "2",
    "description": "The people of Draynor Village live in constant terror. Their numbers are dwindling, all due to the foul creature lurking in the manor to the north known as a vampyre.",
    "length": "Very Short",
    "requirements": "These skills are given upon setting up the speedrun:\n*\n*\n*\n*\n*\n*\n*\n*",
    "items": "These items are provided upon setting up the speedrun:\n* 8,000 Coins\n* 2 Energy potion(4)\n* 5 Tuna",
    "kills": "Count Draynor (level 34)",
    "template": "quest details"
  },
  {
    "start": "Speak to Sir Tiffy Cashien in Falador Park.",
    "startmap": "2997,3373",
    "difficulty": "2",
    "description": "A wanted man is on the loose. Can you track him down?",
    "length": "Medium",
    "requirements": "*\n*Completion of the following quests:\n**Recruitment Drive\n***Black Knights' Fortress\n***Druidic Ritual\n**The Lost Tribe\n***Rune Mysteries\n***Goblin Diplomacy\n**Priest in Peril\n**Partial completion of Enter the Abyss\n*The ability to defeat a level 32 Black Knight.",
    "items": "*10,000 coins, or:\n** Law rune\n** Enchanted gem (bought from a Slayer Master)\n** Molten glass\n*20 un-noted Rune essence or pure essence (you'll get them back)\n**[[File:Ultimate ironman chat badge.png]] The player must deliver all 20 rune essence at once\n* Light source (Note: Candles, torches and oil lamps can cause swamp gas explosions if going off-route, and need a tinderbox to stay lit)",
    "kills": "*Black Knight (level 32)\n*Solus Dellagar",
    "ironman": "[[File:Ultimate ironman chat badge.png]] The player must have 20 inventory spots to deliver all 20 rune essence at once",
    "recommended": "*\n*Armour and some food.\n*Stamina or energy potions.\n*Fast travel to several locations that are always visited during the quest\n**Falador (Falador teleport)\n**Canifis (Kharyrll Teleport, Salve Graveyard Teleport, Fenkenstrain's Castle Teleport, Fairy Rings to or Slayer Ring to the Slayer Tower)\n**Champions' Guild and Varrock (Combat Bracelet, Chronicle or Varrock teleport)\n**Lumbridge (Lumbridge teleport)\n*Fast travel to several randomly chosen locations\n**Ardougne (Ardougne teleport)\n**Brimhaven (travel from Ardougne)\n**Rellekka (Enchanted lyre or Fremennik sea boots, or House teleport if your house is in Rellekka)\n**Castle Wars (Ring of Dueling)\n**Al Kharid (Ring of Dueling)\n**Musa Point (Amulet of Glory to Karamja)\n**Draynor Village (Amulet of Glory)\n**Tree Gnome Stronghold (Gnome Glider, Balloon Transport System, Spirit trees or Slayer Ring to Stronghold Slayer Cave)\n**Goblin Village (walk from Falador)\n**Yanille (Watchtower teleport)\n**McGrubor's Wood (Combat Bracelet to Ranging Guild or Fairy Rings to )\n**Grave of Scorpius (Ourania Teleport, Spirit Tree to Battle of Khazard, or Ring of Dueling to Castle Wars)",
    "template": "quest details"
  },
  {
    "start": "Begin the quest by speaking to Watchtower Wizard north of Yanille in the Watchtower. You must climb the trellis on the north side of the tower to get up there for the first time.",
    "startmap": "2546,3116,plane:2",
    "difficulty": "2",
    "description": "The Wizards of the Yanille Watch Tower have been reporting increased ogre sightings recently. Use a wide variety of your skills to help the wizards recover their stolen power crystals and stop the advance of the ogre hordes!",
    "length": "Medium",
    "requirements": "* \n*  \n*  \n*  \n*  \n* The ability to defeat a level 68 Ogre and run past level 111 Blue dragons",
    "items": "* 20 coins\n* Gold bar\n* Tinderbox\n* Death rune (can be obtained during the quest)\n* Pickaxe\n* Dragon bones\n* 2 ropes (2nd rope can be obtained during the quest)\n* Guam potion (unf) or guam leaf and a vial of water (vial of water can be obtained during quest)\n* Any light source (can be obtained during the quest)\n* Skavid map (can be obtained during the quest)\n* Pestle and mortar (can be obtained during the quest)\n* Bat bones (can be obtained during the quest, a knife or slash weapon is needed, grinding the bat bones before starting the quest to leave the pestle and mortar in the bank is also an option)\n* Jangerberries (can be obtained during the quest)",
    "recommended": "* \n* Any instant teleportation method if you need to leave the Ogre cave\n* Weapon, armour and some food\n* Stamina or energy potions\n* Anti-dragon/Dragonfire shield and antifire potions or a super antifire to greatly reduce the damage taken from the blue dragons in the Ogre Enclave (using both or just super antifire completely negates dragonfire damage) \n* for protection prayers\n* Fast travel to the Watchtower and the Ogre Enclave (Yanille teleport, Teleport to house if your house is in Yanille, Nightmare Zone or Castle Wars minigame teleport, Ring of Dueling to Castle Wars or Fairy Rings to )\n*, , , a crossbow and a mith grapple for the shortcut over Yanille's southern wall",
    "kills": "* Gorad (level 68) (safespottable)\n* Giant bat (level 27) (only if bat bones are needed)",
    "template": "quest details"
  },
  {
    "description": "Investigate the death of elven leaders of old. Search for the elf King Baxtorian's tomb and discover the mysterious hidden treasure of the waterfall.",
    "start": "Speak to Almera in her house north-east of Baxtorian Falls.",
    "startmap": "2521,3497",
    "difficulty": "2",
    "length": "Short",
    "requirements": "* The ability to withstand and evade attacks from level 86 Fire Giants and level 84 Moss Guardian without any equipment.",
    "items": "* 6 Air runes\n* 6 Earth runes\n* 6 Water runes\n* Rope",
    "recommended": "* \n* Food\n* Games necklace to the Barbarian Outpost for fast travel to Almera\n* Skills necklace to the Fishing Guild for fast travel to Glarial's Tomb\n* An Ardougne cloak to get to Tree Gnome Village via Ardougne Monastery, or a Ring of Dueling via Castle Wars teleport",
    "ironman": "[[File:Ultimate ironman chat badge.png]] You must briefly visit Glarial's Tomb which has significant item restrictions.",
    "template": "quest details"
  },
  {
    "description": "A travelling trader has been stranded south of Varrock after his cart was attacked by local outlaws. He needs the help of a hero to recover his lost documents, but that's not all...\n\nThe Varrock Palace Secret Guard (VPSG) are on the trail of treacherous dealings with the Monks of Zamorak. Will you be able to help the VPSG and uncover what lies below?",
    "start": "Talk to Rat Burgiss south of Varrock.",
    "startmap": "3266,3333",
    "difficulty": "2",
    "length": "Short",
    "requirements": "*Completion of the following quests:\n**Rune Mysteries\n*",
    "items": "*Empty bowl\n*15 chaos runes\n*Access to the Chaos Altar (Chaos talisman or tiara, or travelling through the Abyss or Temple of the Eye) (Catalytic talisman and Catalytic tiara will NOT work)",
    "kills": "*5 Outlaws (level 32)\n*King Roald (level 47)",
    "recommended": "*\n* \n*Weapon, armour and some food if low leveled\n*Bronze pickaxe to avoid going into the Wilderness (Bronze is specifically required, and can be obtained during the quest)\n*Fast travel to several locations around Varrock;\n**Varrock square (Varrock teleport)\n**Outlaw camp (Ring of Wealth to the Grand Exchange, Skills Necklace to the Cooks' Guild or Varrock teleport if medium Varrock Diary completed)\n**South of Varrock (Chronicle or Combat bracelet to the Champions' Guild)\n**The canoe system (requires axe and level 27 woodcutting for the Dugout canoe)",
    "template": "quest details"
  },
  {
    "start": "Talk to the boy near the gate entrance of Taverley.",
    "startmap": "2928,3456",
    "difficulty": "Intermediate",
    "description": "A young boy who lives in Taverley has kicked his ball into the garden of a scary old lady.\n\nHe asks you to get it back for him. This proves more difficult than it first sounds.",
    "length": "Very Short",
    "requirements": "* The ability to defeat 4 monsters from level 19 to 53 without a break.",
    "items": "*Cheese (You may wish to bring several in case you mess up)\n*Leather gloves (obtainable during the quest)",
    "recommended": "* \n* Weapon, armour and some food\n* 4 free inventory slots",
    "kills": "*Witch's experiment (level 19, 30, 42 and 53)",
    "template": "quest details"
  },
  {
    "start": "Talk to Hetty in her house in Rimmington, south of Falador and west of Port Sarim.",
    "startmap": "2967,3205",
    "difficulty": "Novice",
    "description": "Become one with your darker side. Tap into your hidden depths of magical potential by making a potion with the help of Hetty the Rimmington witch.",
    "length": "Very Short",
    "items": "*Burnt meat\n*Eye of newt\n*Onion\n*Rat's tail (only obtainable after starting the quest)",
    "recommended": "*Teleport to Rimmington",
    "kills": "Rat (level 1)",
    "template": "quest details"
  },
  {
    "start": "Speak to Veos in The Sheared Ram in Lumbridge.",
    "startmap": "3228,3242",
    "difficulty": "Novice",
    "description": "Veos has long been a lover of treasure hunts and his latest hunt has brought him to Lumbridge. However, not knowing the area well, Veos could use some help finding this treasure.",
    "length": "Very Short",
    "items": "* Spade",
    "recommended": "* Energy potions or (members only) stamina potions\n* (Members only) Fast travel to Draynor Village (Amulet of Glory or Necklace of Passage to the Wizards' Tower)",
    "template": "quest details"
  },
  {
    "start": "Speak to Veos in The Sheared Ram in Lumbridge.",
    "difficulty": "Novice",
    "description": "Veos has long been a lover of treasure hunts and his latest hunt has brought him to Lumbridge. However, not knowing the area well, Veos could use some help finding this treasure.",
    "length": "Very Short",
    "requirements": "These skills are given upon setting up the speedrun:\n*",
    "items": "These items are provided upon setting up the speedrun:\n* 100 Coins\n* 1 Energy potion(4)",
    "template": "quest details"
  },
  {
    "start": "Speak to Grish in Jiggig, just south of Castle Wars.",
    "startmap": "2444,3051",
    "difficulty": "2",
    "description": "Run for your lives...the zombie ogres are here for your flesh! An ogre ceremonial dance area, used to communicate with ancient ogrish ancestors, has been overrun with diseased undead ogres.\n\nHow could something like this have happened? And what sort of rewards could an enterprising adventurer gain from exploring the tombs of such a place?",
    "length": "Short",
    "requirements": "* Completion of the following quests:\n** Big Chompy Bird Hunting\n** Jungle Potion\n*** Druidic Ritual\n* You must be able to defeat a level 111 enemy.\n* \n*  \n*",
    "items": "* 5 free inventory spaces are needed to receive items near the start of the quest\n* A comp ogre bow (not needed if using Crumble Undead in final battle) or:\n** Wolf bones\n** Achey logs (obtainable during quest)\n** Knife (obtainable during quest)\n** Axe of your Woodcutting level\n** Bow string\n* Brutal arrows (not needed if using Crumble Undead in final battle) or:\n** Achey logs\n** Knife (obtainable during quest)\n** Nails of your Smithing level\n** Hammer\n** Feathers (4 per 1 brutal arrow)",
    "recommended": "* \n* for protection prayers\n*  (otherwise it is very difficult to open the chest below the stairs in the north-west corner. Strength boosts are useful here)\n*   (is needed if you want to create your own Comp ogre bow and  is needed to fletch Brutal arrows.)\n* Strength potion if your strength is low. Opening the ogre tomb seems to require strength and lowers your level each time you fail.\n* Vial of water, Rogue's purse and Snake weed if you choose to learn the technique that allows you to mix Relicym's balm (pretty much necessary if < 89 combat, unless you have sanfew serum).\n* A Sanfew serum would be helpful to prevent disease and restore stats. Relicym's balm is a cheap alternative to the Sanfew serum\n* Ava's accumulator to conserve arrows\n* To save the super restore obtained during the quest to combat disease, combat, ranged, or magic potions can be used after normal restore potions.\n* A ring of dueling to teleport to Castle Wars and Ferox Enclave to restore your stats and cure disease with the pools. \n* A Yanille Teleport",
    "kills": "* Slash Bash (level 111)\n* Zombie (level 39)",
    "template": "quest details"
  }
]