[
  {
    "name": "A Kingdom Divided",
    "image": "A Kingdom Divided reward scroll.png",
    "qp": "2",
    "rewards": "* The book of the dead\n* Two antique lamps giving 10,000 experience to any skill level 40 or above.\n** If players claimed the antique lamp from the Architectural Alliance miniquest before 10 January 2024, they will only receive one lamp.\n* Ability to set your respawn point to Kourend Castle. Talk to Asteros Arceuus, now found on the of Kourend Castle, to change your respawn point at any time.\n* 24 new spells made available in the Arceuus spellbook (all combat spells with the exception of Ghostly Grasp and Inferior Demonbane, and all utility spells with the exception of Resurrect Crops and reanimation spells).",
    "template": "quest rewards"
  },
  {
    "name": "A Night at the Theatre",
    "image": "A Night at the Theatre reward scroll.png",
    "qp": "2",
    "rewards": "* Four antique lamps, each offering 20,000 experience in Attack,  Strength,  Defence,  Ranged,  Magic, or  Hitpoints at level 50 or above.\n** If players completed the quest before 28 July 2021 and have already used the original two antique lamps that were rewarded, they will only receive two additional antique lamp upon re-completing the quest.",
    "template": "quest rewards"
  },
  {
    "name": "A Porcine of Interest",
    "image": "A Porcine of Interest reward scroll.png",
    "qp": "1",
    "rewards": "*5,000 coins\n* Slayer experience\n*30 Slayer reward points\n*Access to the Sourhog Cave and Sourhog slayer tasks from Spria\n*Existing slayer helmets will have reinforced goggles added to them\n*Spria will now be able to give you slayer tasks",
    "template": "quest rewards"
  },
  {
    "name": "A Soul's Bane",
    "image": "A Soul's Bane reward scroll.png",
    "qp": "1",
    "rewards": "* Defence experience\n* Hitpoints experience\n*500 \n*Access to Tolna's rift for combat training",
    "template": "quest rewards"
  },
  {
    "name": "A Tail of Two Cats",
    "image": "A Tail of Two Cats reward scroll.png",
    "qp": "2",
    "rewards": "*A Doctor's hat or Nurse hat (you can switch by destroying your hat and requesting a new one from the Apothecary)\n*A present containing:\n**Two antique lamps worth 2,500 experience each in skills of your choice over 30\n**A Mouse toy (can be used to play with your cat, and functions as a fun weapon at the Emir's Arena)\n*Completing this quest awards the player with 5 Kudos which can be claimed by talking to Historian Minas in the Varrock Museum.",
    "template": "quest rewards"
  },
  {
    "name": "A Taste of Hope",
    "image": "A Taste of Hope reward scroll.png",
    "qp": "1",
    "rewards": "*Ivandis flail - A weapon that can damage the vyrewatch\n*Drakan's medallion - An amulet that gives the player unlimited teleports to the Theatre of Blood\n*Tome of experience, granting 2,500 experience to any three skills of the player's choosing (level 35 or over). Can be the same skill.",
    "template": "quest rewards"
  },
  {
    "name": "Animal Magnetism",
    "image": "Animal Magnetism reward scroll.png",
    "qp": "1",
    "rewards": "* experience\n* experience\n* experience\n* experience\n*Ava's attractor if your Ranged level is less than 50, or Ava's accumulator if your Ranged level is 50 or higher\n*The ability to trade with Ava and purchase her devices",
    "template": "quest rewards"
  },
  {
    "name": "Another Slice of H.A.M.",
    "image": "Another Slice of H.A.M. reward scroll.png",
    "qp": "1",
    "rewards": "* experience\n* experience\n*The ancient mace\n*The ability to buy Goblin Village teleport spheres\n*Free access to the Dorgesh-Kaan–Keldagrim train system",
    "template": "quest rewards"
  },
  {
    "name": "At First Light",
    "qp": "1",
    "rewards": "* experience\n*  experience\n*  experience\n* Access to Master Tier Hunters' Rumours",
    "template": "quest rewards"
  },
  {
    "name": "Below Ice Mountain",
    "qp": "1",
    "rewards": "*2,000 coins\n*Access to the Ruins of Camdozaal\n*Flex emote\n*The ability to make a steak sandwich",
    "template": "quest rewards"
  },
  {
    "name": "Beneath Cursed Sands",
    "qp": "2",
    "rewards": "* Agility experience\n*Access to the Tombs of Amascut\n*A Keris partisan. (If your inventory was full, you may claim one for free from Selim in front of Al Kharid Palace.)\n*The circlet of water, an untradeable helm that acts like a waterskin when worn. (If your inventory was full, you may claim one for free from the High Priest in Sophanem.)\n*Access to a fairy ring on a small island south-west of the necropolis, code . (Unlocked when entering the necropolis at the beginning of the quest.)\n*Jaltevas teleport option on the Pharaoh's sceptre. (Unlocked by selecting Commune on an obelisk in the necropolis, by the mine.)",
    "template": "quest rewards"
  },
  {
    "name": "Between a Rock...",
    "image": "Between a Rock... reward scroll.png",
    "qp": "2",
    "rewards": "* experience\n* experience\n* experience\n*A rune pickaxe\n*The ability to teleport to Dondakan's rock using a ring of wealth\n*You get to keep your gold helmet and can continue using it to fire yourself into the rock to access the Arzinian Mine where there are lots of gold rocks and gold veins, and a nearby dwarf, at the river, banks the player's gold ore for a charge (he keeps 20% of the ores, rounded up, or 10% of the ores if the player has the ring of charos (a)).",
    "template": "quest rewards"
  },
  {
    "name": "Big Chompy Bird Hunting",
    "image": "Big Chompy Bird Hunting reward scroll.png",
    "qp": "2",
    "rewards": "* experience\n* experience\n* experience\n*An ogre bow\n*The ability to fletch ogre arrows\n*The ability to cook chompy birds and earn a bowman hat",
    "template": "quest rewards"
  },
  {
    "name": "Biohazard",
    "image": "Biohazard reward scroll.png",
    "qp": "3",
    "rewards": "* Thieving experience\n*Use of the Combat Training Camp north of the city. Players can attack a total of six training dummies in the camp for 50 attack experience each.\n*The ability to travel freely through the West Ardougne gate.\n*The ability to use the West Ardougne Teleport in the Arceuus spellbook and teletab.",
    "template": "quest rewards"
  },
  {
    "name": "Black Knights' Fortress",
    "image": "Black Knights' Fortress reward scroll.png",
    "qp": "3",
    "rewards": "* 2,500 Coins",
    "template": "quest rewards"
  },
  {
    "name": "Bone Voyage",
    "image": "Bone Voyage reward scroll.png",
    "qp": "1",
    "rewards": "*Access to Fossil Island - to disembark the boat upon arrival at Fossil Island, speak to the Junior Navigator.",
    "template": "quest rewards"
  },
  {
    "name": "Cabin Fever",
    "image": "Cabin Fever reward scroll.png",
    "qp": "2",
    "rewards": "* Crafting experience\n* Smithing experience\n* Agility experience\n*10,000 coins (only if you speak to Bill Teach after the quest)\n*Access to Mos Le'Harmless\n*Access to kill cave horrors\n*The Book o' piracy\n*Charter ship prices are halved\n*Ability to play the Trouble Brewing minigame",
    "template": "quest rewards"
  },
  {
    "name": "Children of the Sun",
    "image": "Children of the Sun reward scroll.png",
    "qp": "1",
    "rewards": "* Access to Varlamore",
    "template": "quest rewards"
  },
  {
    "name": "Client of Kourend",
    "image": "Client of Kourend reward scroll.png",
    "qp": "1",
    "rewards": "* Two antique lamps which provide 500 experience each in a skill of the player's choosing\n*Kharedst's memoirs\n*Kourend Castle Teleport spell",
    "template": "quest rewards"
  },
  {
    "name": "Clock Tower",
    "image": "Clock Tower reward scroll.png",
    "qp": "1",
    "rewards": "*500 coins",
    "template": "quest rewards"
  },
  {
    "name": "Cold War",
    "image": "Cold War reward scroll.png",
    "qp": "1",
    "rewards": "* Crafting experience\n* Agility experience\n* Construction experience\n*The ability to make the penguin suit. To enter the suit again, you must talk to Larry again at the zoo, pier, Iceberg, or Lumbridge sheep pen.\n*The ability to use the Penguin agility course\n*Players can also steal more cowbells and make more bongos. The cowbells or the bongos can only be played in a penguin suit.",
    "template": "quest rewards"
  },
  {
    "name": "Contact!",
    "image": "Contact! reward scroll.png",
    "qp": "1",
    "rewards": "* Thieving experience\n*Combat lamp giving two wishes granting 7,000 experience to Attack,  Strength,  Defence,  Hitpoints,  Ranged, or  Magic\n*The Keris dagger\n*Access to Sophanem's shops including: bank, Blades by Urbi., Nathifa's Bake Stall., The Spice Is Right.\n*The music track Back to Life and The Spymaster\n\nUnlocks:\n* Giant scarab accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Cook's Assistant",
    "image": "Cook's Assistant reward scroll.png",
    "qp": "1",
    "rewards": "* experience\n* Permission to use the Cook-o-matic 100, which reduces the chance of burning some foods.",
    "template": "quest rewards"
  },
  {
    "name": "Creature of Fenkenstrain",
    "image": "Creature of Fenkenstrain reward scroll.png",
    "qp": "2",
    "rewards": "* Thieving experience\n*The Ring of charos, which allows access to the Werewolf Agility Course, and, when activated during Garden of Tranquillity, reduced cost to many transport links.",
    "template": "quest rewards"
  },
  {
    "name": "Darkness of Hallowvale",
    "image": "Darkness of Hallowvale reward scroll.png",
    "qp": "2",
    "rewards": "* Agility experience\n* Thieving experience\n* Construction experience\n*Tome of experience, granting 2,000 experience to any three skills of the player's choosing (level 30 or over). Can be the same skill.\n*Access to passage through two shortcut doors within Meiyerditch",
    "template": "quest rewards"
  },
  {
    "name": "Death Plateau",
    "image": "Death Plateau reward scroll.png",
    "qp": "1",
    "rewards": "* Attack experience\n*Steel claws\n*The ability to make claws\n*Ability to purchase and wear climbing boots from Tenzing",
    "template": "quest rewards"
  },
  {
    "name": "Death to the Dorgeshuun",
    "image": "Death to the Dorgeshuun reward scroll.png",
    "qp": "1",
    "rewards": "* Thieving experience\n* Ranged experience\nWelcome to Dorgesh-Kaan.png\n*Access to the H.A.M. Store room, where you can loot gems, jewellery, and coins from chests\n*Access to the water wheel tunnel (Dartog will appear there, and you'll be able to travel between the Lumbridge Castle cellar, the Dorgeshuun Mines and the water wheel tunnel at will)\n*Ability to use the bone dagger and Dorgeshuun crossbow special attacks\n*Access to Dorgesh-Kaan, the Dorgeshuun city\n*A torch if you did not have a light source in your inventory at the end of the quest",
    "template": "quest rewards"
  },
  {
    "name": "Defender of Varrock",
    "qp": "2",
    "rewards": "* experience\n*  experience\n* Access to Zemouregal's Base\n* Antique lamp rewarding 5,000 XP and 5 Kudos from Historian Minas after completion of the quest",
    "template": "quest rewards"
  },
  {
    "name": "Demon Slayer",
    "image": "Demon Slayer reward scroll.png",
    "qp": "3",
    "rewards": "*Silverlight (if lost, players may retrieve it from Sir Prysin for a fee of 500 coins. It can also be sold to the Wise Old Man for 80 coins.)\n*5 Kudos, which members can claim by talking to Historian Minas in the Varrock Museum",
    "template": "quest rewards"
  },
  {
    "name": "Desert Treasure",
    "image": "Desert Treasure I reward scroll.png",
    "qp": "3",
    "rewards": "* Magic experience\n*The ability to use Ancient Magicks: At any time, you can pray at the altar and change between the standard and Ancient Magicks spellbooks. After traversing the pyramid for the first time, you may enter via the back-door of the pyramid to gain a short cut to the altar. Be warned that changing spellbooks will drain your prayer to 0.\n*Ring of visibility: If you ever lose it, you can obtain another one from Rasolo.\n*Access to the Curse of the Empty Lord miniquest (only requires the ring of visibility)\n*Access to ancient staff: You can buy one from Eblis for 80,000 coins. If you lose the staff, you will have to kill mummies inside the pyramid, or buy it from other players. It can also be obtained as a rare drop from the Chaos Fanatic, as a rare drop from the Thermonuclear smoke devil or as an uncommon drop from Calvar'ion.\n*Access to the Smoke Dungeon, which can be used for various Slayer tasks.\n*Ability to talk to Eblis to obtain an ancient signet\n\nUnlocks:\n* Dessous, Damis, Fareed, and Kamil accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Desert Treasure II - The Fallen Empire",
    "qp": "5",
    "rewards": "* Three ancient lamps, each offering 100,000 experience in Attack,  Strength,  Defence,  Hitpoints,  Ranged,  Magic, or  Prayer at level 60 or above.\n* Access to Scar essence mine\n* Ring of shadows\n* The ability to wear ancient rings.\n* The ability to repeat the Forgotten Four encounters as boss fights, along with the ability to challenge their awakened variants.",
    "template": "quest rewards"
  },
  {
    "name": "Devious Minds",
    "image": "Devious Minds reward scroll.png",
    "qp": "1",
    "rewards": "* Fletching experience\n* Runecraft experience\n* Smithing experience",
    "template": "quest rewards"
  },
  {
    "name": "Doric's Quest",
    "image": "Doric's Quest reward scroll.png",
    "qp": "1",
    "rewards": "* Mining experience\n*180 coins\n*The ability to use Doric's anvils\n*Bronze pickaxe given at the start of the quest",
    "template": "quest rewards"
  },
  {
    "image": "Dragon Slayer reward scroll.png",
    "name": "Dragon Slayer I",
    "qp": "2",
    "rewards": "* Strength experience\n* Defence experience\n*The ability to equip a green d'hide body, rune platebody, and dragon platebody\n*Access to Crandor\n*Access to the Corsair Cove Resource Area\n*The ability to be assigned Dragons as a Slayer task (obtainable immediately after starting the quest)\n\nUnlocks:\n* Elvarg accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Dragon Slayer II",
    "image": "Dragon Slayer II reward scroll.png",
    "qp": "5",
    "rewards": "* experience\n* experience\n* experience\n* experience\n*Ability to speak to cats without the Catspeak amulet\n*Access to the Myths' Guild\n**Access to the pettable dog\n**Ability to make super antifire potions by speaking to Primula\n**4x 25,000 experience in Magic, Ranged, Strength, Attack, Defence or Hitpoints by speaking to Ellen\n**Access to Fountain of Uhld where dragonstone jewellery (excluding the ring of wealth) can be recharged\n**Access to the Pool of Dreams where players can choose to fight Galvek again or rewatch cutscenes from the quest\n**Access to the Wrath Altar\n**Access to the shop to buy the mythical cape\n*Access to adamant and rune dragons in the Lithkren Vault\n*Access to a stronger version of Vorkath on Ungael\n*Ability to reforge the dragon platebody and kiteshield\n*Ability to have a rune dragon as a Treasure Room guardian (requiring 99 Construction and 25,000,000 coins)\n*Ability to create an Ava's assembler by bringing Vorkath's head, 75 Mithril arrows, and 4,999 coins (or Ava's accumulator) to Ava in Draynor Manor\n*Ability to craft Ferocious gloves from Hydra leather in the Lithkren Vault (requires a hammer)\n*Ability to construct Mythical cape (mounted) in your POH\n*Ability to go back through the ancient doors on Lithkren and use your Digsite pendant on the Strange Machine north of the dragons. This will allow you to teleport there.\n*Locator orb",
    "template": "quest rewards"
  },
  {
    "name": "Dream Mentor",
    "image": "Dream Mentor reward scroll.png",
    "qp": "2",
    "rewards": "* Hitpoints experience\n* Magic experience\n*7 new spells added to your Lunar spells book (Monster Examine, Humidify, Hunter Kit, Stat Spy, Dream, Plank Make, Spellbook Swap)\n*A dreamy lamp, which awards 15,000 experience in a combat skill of a player's choosing, apart from Attack and Prayer.\n*'Birds-Eye' Jack will now allow you to use the bank without a seal of passage equipped or in your inventory.\n\nUnlocks:\n* The Untouchable, The Everlasting, The Inadequacy accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Druidic Ritual",
    "image": "Druidic Ritual reward scroll.png",
    "qp": "4",
    "rewards": "* Herblore experience (Herblore Level 3. 26 Herblore XP away from Herblore Level 4)\n*The ability to use the Herblore skill",
    "template": "quest rewards"
  },
  {
    "name": "Dwarf Cannon",
    "image": "Dwarf Cannon reward scroll.png",
    "qp": "1",
    "rewards": "* Crafting experience\n*The ability to buy and use a dwarf multicannon\n*The ability to make cannonballs\n*Membership of the Black Guard",
    "template": "quest rewards"
  },
  {
    "name": "Eadgar's Ruse",
    "image": "Eadgar's Ruse reward scroll.png",
    "qp": "1",
    "rewards": "* Herblore experience\n*The ability to grow and steal Goutweed, which can be traded with Sanfew for herbs.\n*1 Burnt Meat\n*The ability to use the Trollheim Teleport spell.\n*The ability to use a Scroll of redirection to redirect a Teleport to house tablet to Trollheim.",
    "template": "quest rewards"
  },
  {
    "name": "Eagles' Peak",
    "image": "Eagles' Peak reward scroll.png",
    "qp": "2",
    "rewards": "* experience\n*Ability to use box traps\n*Access to the Eagle transport system\n*Captured ferrets can be used to flush rabbits from their holes, allowing them to be caught in rabbit snares\n*A box trap",
    "template": "quest rewards"
  },
  {
    "name": "Elemental Workshop I",
    "image": "Elemental Workshop I reward scroll.png",
    "qp": "1",
    "rewards": "* Crafting experience\n* Smithing experience\n*Access to the Elemental Workshop\n*An elemental shield, as well as the ability to make and wield them",
    "template": "quest rewards"
  },
  {
    "name": "Elemental Workshop II",
    "image": "Elemental Workshop II reward scroll.png",
    "qp": "1",
    "rewards": "* Smithing experience\n* Crafting experience\n*The ability to make and use elemental mind equipment\n**To make a mind shield: have the slashed book from the Elemental Workshop I quest in your inventory, then smith a primed mind bar into a mind shield",
    "template": "quest rewards"
  },
  {
    "name": "Enakhra's Lament",
    "image": "Enakhra's Lament reward scroll.png",
    "qp": "2",
    "rewards": "* Crafting experience\n* Mining experience\n* Firemaking experience\n* Magic experience\n*Camulet, which allows you to talk to camels and teleport to the temple four times. It can be recharged by using camel dung on it. You can pay Lazim 1 million gold pieces to give it unlimited charges.\n*Camel mask (Use a piece of soft clay on the pedestal with the globes on it to make.)",
    "template": "quest rewards"
  },
  {
    "name": "Enlightened Journey",
    "image": "Enlightened Journey reward scroll.png",
    "qp": "1",
    "rewards": "* Crafting experience\n* Farming experience\n* Woodcutting experience\n* Firemaking experience\n*The Bomber jacket and cap\n**Gnome goggles from the Gnome Restaurant minigame can be combined with the bomber cap by talking with Auguste\n*Access to the balloon transport system\n**4 new routes available to be flown, when successfully flown they provide an additional 2,000 Firemaking experience per route.\n*Ability to make origami balloons",
    "template": "quest rewards"
  },
  {
    "name": "Ernest the Chicken",
    "image": "Ernest the Chicken reward scroll.png",
    "qp": "4",
    "rewards": "*300 Coins\n*Access to the Killerwatt Plane (Members only)",
    "template": "quest rewards"
  },
  {
    "name": "Fairytale II - Cure a Queen",
    "image": "Fairytale II - Cure a Queen reward scroll.png",
    "qp": "2",
    "rewards": "* Herblore experience\n* Thieving experience\n*An antique lamp granting 2,500 experience in any skill over level 30\n*Access to the fairy rings network\n*Access to Fairy Fixit's Fairy Enchantment shop",
    "template": "quest rewards"
  },
  {
    "name": "Fairytale I - Growing Pains",
    "image": "Fairytale I - Growing Pains reward scroll.png",
    "qp": "2",
    "rewards": "*Magic secateurs (increases crop harvests by 10% when Farming)\n* Farming experience\n* Attack experience\n* Magic experience\n\nUnlocks:\n* Tanglefoot accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Family Crest",
    "image": "Family Crest reward scroll.png",
    "qp": "1",
    "rewards": "*Steel gauntlets\n**The steel gauntlets offer useful perks. Each brother will imbue them with a special ability. They will initially do this for free. Be careful choosing, though, since you can only have one effect, and it will cost you 25,000 coins to change them. Dimintheis will provide you with a \"magically\" found pair should you lose them.",
    "template": "quest rewards"
  },
  {
    "name": "Fight Arena",
    "image": "Fight Arena reward scroll.png",
    "qp": "2",
    "rewards": "* Attack experience\n* Thieving experience\n*1,000 coins\n*The Khazard armour set\n\nUnlocks:\n* Bouncer accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Fishing Contest",
    "image": "Fishing Contest reward scroll.png",
    "qp": "1",
    "rewards": "* Fishing experience\n*Access to the underground White Wolf Mountain passage\n*Ability to catch minnows in the Fishing Guild with 82 Fishing and a full Angler's outfit",
    "template": "quest rewards"
  },
  {
    "name": "Forgettable Tale...",
    "image": "Forgettable Tale of a Drunken Dwarf reward scroll.png",
    "qp": "2",
    "rewards": "* Cooking experience\n* Farming experience\n*2 Dwarven stout (m)",
    "template": "quest rewards"
  },
  {
    "name": "Garden of Tranquillity",
    "image": "Garden of Tranquillity reward scroll.png",
    "qp": "2",
    "rewards": "* Farming experience\n*An activated ring of charos - players can wear the activated ring to charm various NPCs to pay less for certain services, or get choices that are otherwise unavailable.\n*An apple tree seed\n*An acorn\n*5 guam seeds\n*4-dose compost potion, which can be used to turn compost into supercompost.\n*After the quest, the player can visit the garden and pick 4 fruits from the white tree. They regrow after some time, similar to other fruit bearing trees. Each fruit restores about 8% of energy.",
    "template": "quest rewards"
  },
  {
    "name": "Gertrude's Cat",
    "image": "Gertrude's Cat reward scroll.png",
    "qp": "1",
    "rewards": "* Cooking experience\n*Your own kitten\n*Chocolate cake\n*Stew\n*Gertrude will now sell kittens for you to raise for coins each.",
    "template": "quest rewards"
  },
  {
    "name": "Getting Ahead",
    "image": "Getting Ahead reward scroll.png",
    "qp": "1",
    "rewards": "*3,000 coins — If not claimed at quest completion due to no available inventory space, talk to Gordon again after the quest for the reward.\n* experience\n* experience\n*Access to a tannery in the Kebos Lowlands (speak to Mary to access tanning services)\n\nUnlocks:\n* Headless Beast accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Ghosts Ahoy",
    "image": "Ghosts Ahoy reward scroll.png",
    "qp": "2",
    "rewards": "* Prayer experience\n*Free passage into Port Phasmatys\n*The Ectophial, which allows direct teleport to the Ectofuntus, is refilled from the Ectofuntus.",
    "template": "quest rewards"
  },
  {
    "name": "Goblin Diplomacy",
    "image": "Goblin Diplomacy reward scroll.png",
    "qp": "5",
    "rewards": "* Crafting experience\n*A gold bar",
    "template": "quest rewards"
  },
  {
    "name": "Grim Tales",
    "image": "Grim Tales reward scroll.png",
    "qp": "1",
    "rewards": "* Woodcutting experience\n* Agility experience\n* Thieving experience\n* Herblore experience\n* Farming experience\n* Hitpoints experience\n*Dwarven helmet (equip this helmet in the Dwarven Mines to complete a Hard Falador task)\n\nUnlocks:\n* Glod accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Haunted Mine",
    "image": "Haunted Mine reward scroll.png",
    "qp": "2",
    "rewards": "* Strength experience\n*The ability to make the Salve amulet, which when equipped gives combat bonuses against undead monsters.\n*Access to a shortcut to the crystal outcrops\n*Access to Tarn's Lair\n\nUnlocks:\n* Treus Dayth accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Hazeel Cult",
    "image": "Hazeel Cult reward scroll.png",
    "qp": "1",
    "rewards": "* Thieving experience\n*2000 coins (plus 5 from the fake ending if you sided with the Carnillean family)\n*Hazeel's mark (if you sided with Hazeel)\n*Carnillean armour (if you sided with Ceril and obtained an extra during the quest)\n*5 Kudos, which can be claimed by talking to Historian Minas in the Varrock Museum",
    "template": "quest rewards"
  },
  {
    "name": "Heroes' Quest",
    "image": "Heroes' Quest reward scroll.png",
    "qp": "1",
    "rewards": "* Attack experience\n* Defence experience\n* Strength experience\n* Hitpoints experience\n* Ranged experience\n* Fishing experience\n* Cooking experience\n* Woodcutting experience\n* Firemaking experience\n* Smithing experience\n* Mining experience\n* Herblore experience\n*Access to the Heroes' Guild\n*The ability to purchase and wield dragon battleaxes and maces\n*Ability to recharge amulets of glory at the Fountain of Rune (This grants 6 charges instead of the usual 4)\n*Ability to use Charge dragonstone jewellery scrolls.\n*Access to the Fountain of Heroes, where players can recharge their amulets of glory",
    "template": "quest rewards"
  },
  {
    "name": "Holy Grail",
    "image": "Holy Grail reward scroll.png",
    "qp": "2",
    "rewards": "* Prayer experience\n* Defence experience\n*Access to the Fisher Realm\n*Ability to put King Arthur picture on the wall in the Construction skill\n\nUnlocks:\n* Black Knight Titan accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Horror from the Deep",
    "image": "Horror from the Deep reward scroll.png",
    "qp": "2",
    "rewards": "* Magic experience\n* Strength experience\n* Ranged experience\n*A damaged book of your choice which, when complete, will become: a Holy book (Saradomin), an Unholy book (Zamorak), or a Book of balance (Guthix).\n**Further damaged books can be purchased from Jossik for 5,000 coins each, even if you have not filled your other book(s).\n*Access to the Lighthouse general store and the Dagannoth caves underneath.\n\nUnlocks:\n* Dagannoth mother accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Icthlarin's Little Helper",
    "image": "Icthlarin's Little Helper reward scroll.png",
    "qp": "2",
    "rewards": "* Thieving experience\n* Agility experience\n* Woodcutting experience\n*Catspeak amulet\n*Access to the city of Sophanem\n*Unlock the carpet rides from Pollnivneach to Sophanem and Menaphos",
    "template": "quest rewards"
  },
  {
    "name": "Imp Catcher",
    "image": "Imp Catcher reward scroll.png",
    "qp": "1",
    "rewards": "* Magic experience\n*The amulet of accuracy\n*After the quest players can obtain more amulets by speaking to Wizard Mizgog with a complete set of beads.",
    "template": "quest rewards"
  },
  {
    "name": "In Aid of the Myreque",
    "image": "In Aid of the Myreque reward scroll.png",
    "qp": "2",
    "rewards": "* Attack experience\n* Strength experience\n* Crafting experience\n* Defence experience\n*Access to Burgh de Rott\n*Access to the Temple Trekking minigame\n*A Gadderhammer from defeating Gadderanks\n*The ability to make the Rod of Ivandis\n*Completing this quest awards the player with 5 Kudos which can be claimed by talking to Historian Minas in the Varrock Museum.",
    "template": "quest rewards"
  },
  {
    "name": "In Search of the Myreque",
    "image": "In Search of the Myreque reward scroll.png",
    "qp": "2",
    "rewards": "* Attack experience\n* Defence experience\n* Strength experience\n* Hitpoints experience\n* Crafting experience\n*Access to the Hollows\n\nUnlocks:\n* Skeleton Hellhound accessible in the Nightmare Zone.\n* Lore associated in-game Membership of The Myreque.",
    "template": "quest rewards"
  },
  {
    "name": "Jungle Potion",
    "image": "Jungle Potion reward scroll.png",
    "qp": "1",
    "rewards": "* Herblore experience",
    "template": "quest rewards"
  },
  {
    "name": "King's Ransom",
    "image": "King's Ransom reward scroll.png",
    "qp": "1",
    "rewards": "* experience\n*  experience\n*Antique lamp granting 5,000 experience to any skill level 50 or above\n*Access to the Knight Waves Training Grounds\n*The ability to use the Chivalry and Piety prayers, with level 60 and 70 Prayer, respectively, after completion of Knight Waves Training Grounds",
    "template": "quest rewards"
  },
  {
    "name": "Land of the Goblins",
    "qp": "2",
    "rewards": "* Agility experience\n*  Fishing experience\n*  Thieving experience\n*  Herblore experience\n* Access to the Goblin Temple (with an altar to recharge prayer points).\n* Access to Yu'biusk, using fairy ring code .\n* Ability to purchase plain of mud spheres that transports you to the Goblin Cave.\n* Ability to make goblin potions.",
    "template": "quest rewards"
  },
  {
    "name": "Legends' Quest",
    "image": "Legends' Quest reward scroll.png",
    "qp": "4",
    "rewards": "*Access to the Legends' Guild (including shop to buy the cape of legends)\n*The ability to wield the dragon sq shield\n*30,000 experience each in four skills of your choice (limited to Attack, Defence, Strength, Hitpoints, Prayer, Magic, Woodcutting, Crafting, Smithing, Herblore, Agility, Thieving. It is possible to choose the same skill all four times)\n*The ability to charge your skills necklace or combat bracelet at the Legends' Guild or the Fountain of Rune\n*Access to the Kharazi Jungle and a vine shortcut into it, requiring 79 Agility\n*Radimus Erkle will provide replacement dark daggers, which can be investigated via right-click to switch appearance between a dark or glowing dagger\n\nUnlocks:\n* Nezikchened accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Lost City",
    "image": "Lost City reward scroll.png",
    "qp": "3",
    "rewards": "*Access to Zanaris\n*Ability to buy and wield dragon longswords and dragon daggers (with level 60 Attack)\n*Ability to make cosmic runes with the Runecraft skill\n\nUnlocks:\n* Tree spirit accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Lunar Diplomacy",
    "image": "Lunar Diplomacy reward scroll.png",
    "qp": "2",
    "rewards": "* Magic experience\n* Runecraft experience\n*A seal of passage\n*Access to Lunar Isle and Lunar equipment\n*Access to the Lunar spellbook\n*Access to the Astral Altar\n*50 Astral runes\n\nUnlocks:\n* Me accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Making Friends with My Arm",
    "image": "Making Friends with My Arm reward scroll.png",
    "qp": "2",
    "rewards": "* Construction experience\n* Firemaking experience\n* Mining experience\n* Agility experience\n*Access to the Salt Mines\n*Ability to build fire pits\n*A new disease-free herb patch in Weiss (requires building the fire of nourishment before use)\n*Ability to direct a teleport room portal to Troll Stronghold with a combination of salt",
    "template": "quest rewards"
  },
  {
    "name": "Making History",
    "image": "Making History reward scroll.png",
    "qp": "3",
    "rewards": "* Crafting experience\n* Prayer experience\n*750 [[File:Coins 250.png]] coins\n*Enchanted key, allowing you to go on your own treasure digs until it disappears\n*Access to the museum in the outpost\n*Ability to complete master clue hot/cold Treasure Trails.\n*Ability to claim 5 Kudos and an antique lamp for 1,000 experience (in any skill over level 20) by talking to Historian Minas in the Varrock Museum.",
    "template": "quest rewards"
  },
  {
    "name": "Merlin's Crystal",
    "image": "Merlin's Crystal reward scroll.png",
    "qp": "6",
    "rewards": "*Excalibur (Required for Holy Grail quest.)\n* Completing this quest awards the player with 5 Kudos which can be claimed by talking to Historian Minas in the Varrock Museum.\n* Appointment with a title as a Honorary Knight of the Round Table.",
    "template": "quest rewards"
  },
  {
    "name": "Misthalin Mystery",
    "image": "Misthalin Mystery reward scroll.png",
    "qp": "1",
    "rewards": "*Uncut ruby\n*Uncut emerald\n*Uncut sapphire\n* Crafting experience",
    "template": "quest rewards"
  },
  {
    "name": "Monk's Friend",
    "image": "Monk's Friend reward scroll.png",
    "qp": "1",
    "rewards": "* Woodcutting experience\n*8 Law runes\n*Brother Omad will throw parties for you by speaking to him.",
    "template": "quest rewards"
  },
  {
    "name": "Monkey Madness I",
    "image": "Monkey Madness I reward scroll.png",
    "qp": "3",
    "rewards": "*10,000 Coins\n*3 Diamonds\n*Speaking to Daero after the quest gives the choice of either, 35,000 experience in Attack and  Defence and 20,000 experience in  Strength and  Hitpoints OR 35,000 experience in  Strength and  Hitpoints and 20,000 experience in  Attack and  Defence. The skills you tell Daero you want to focus on will receive 35,000 XP each, and the others 20,000 each.\n*The ability to buy and wield the Dragon scimitar.\n*Full access to Ape Atoll, with the exception of the bank and javelin store, which are unlocked after Monkey Madness II.",
    "template": "quest rewards"
  },
  {
    "name": "Monkey Madness II",
    "image": "Monkey Madness II reward scroll.png",
    "qp": "4",
    "rewards": "* Slayer experience\n* Agility experience\n* Thieving experience\n* Hunter experience\n*2x 50,000 experience rewards from Duke in your choice of Magic, Ranged, Attack, Defence, Strength or Hitpoints. Found on the hill east of main gate of Ape Atoll. (Walk up west hill, and climb the ladder to reach the east hill).\n*A Royal seed pod, which provides unlimited teleports to the Grand Tree (up to level 30 Wilderness).\n*Access to the Crash Site Cavern containing demonic gorillas.\n*Access to a new maniacal monkey hunting area where Glough's laboratory used to be in Kruk's Dungeon.\n*Access to Ape Atoll bank and Oobapohk's Javelin Store.\n*Access to new glider spot directly to Ape Atoll.\n*The ability to communicate with monkeys without the monkeyspeak amulet.\n*All NPCs on the surface of Ape Atoll will be non-aggressive without requiring the use of Monkey greegrees.\n*Ability to wield the heavy ballista.\n*Various dragons will now drop dragon javelin heads.\n*The ability to reclaim lost Greegrees from Zooknock in his Gnome Stronghold house (no supplies required).\n*A Monkey can be found in one of the crates at the Crash Site. It is purely cosmetic and can be equipped in the cape slot.\n*Bobawu will now track your laps of the Ape Atoll Agility Course, with you being able to transform your monkey into other variants upon completing a number of laps.\n*The ability to re-fight Glough by gazing into the Burning brazier in Zooknock's house.",
    "template": "quest rewards"
  },
  {
    "name": "Mountain Daughter",
    "image": "Mountain Daughter reward scroll.png",
    "qp": "2",
    "rewards": "* Prayer experience\n* Attack experience\n*The Bearhead\n*The ability to pass into the Mountain Camp over the rockslide\n\nUnlocks:\n* The Kendal accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Mourning's End Part I",
    "image": "Mourning's End Part I reward scroll.png",
    "qp": "2",
    "rewards": "*Thieving experience\n*Hitpoints experience\n*Access to the Mourner HQ basement and the village of Lletya\n*Elf teleport crystal\n*The fixed device\n*Full mourner clothing",
    "template": "quest rewards"
  },
  {
    "name": "Mourning's End Part II",
    "image": "Mourning's End Part II reward scroll.png",
    "qp": "2",
    "rewards": "* Agility experience\n* A crystal trinket, which allows you to enter the Temple of Light again after the quest\n* Access to the Death Altar\n* Death talismans can be obtained via Guardians of the Rift\n* Access to Dark Beasts",
    "template": "quest rewards"
  },
  {
    "name": "Murder Mystery",
    "image": "Murder Mystery reward scroll.png",
    "qp": "3",
    "rewards": "* Crafting experience\n*2,000 Coins",
    "template": "quest rewards"
  },
  {
    "name": "My Arm's Big Adventure",
    "image": "My Arm's Big Adventure reward scroll.png",
    "qp": "1",
    "rewards": "* Herblore experience\n* Farming experience\n**457 (315 total) additional  Farming experience while My Arm harvests his crop.\n*Access to a disease-free herb patch on top of the Troll Stronghold. This patch does not allow growing of regular Goutweed.\n*29 Burnt meat\n\nUnlocks:\n* Giant Roc accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Nature Spirit",
    "image": "Nature Spirit reward scroll.png",
    "qp": "2",
    "rewards": "* Crafting experience\n* Defence experience\n* Hitpoints experience\n*Access to Mort Myre Swamp and the Nature Spirit altar, where you can replenish and temporarily boost your prayer points by 2\n*Ability to fight ghasts\n*3 meat pies and 3 apple pies unless they were rotted by the ghasts\n*Ability to build the fire of dehumidification after completion of Making Friends with My Arm",
    "template": "quest rewards"
  },
  {
    "name": "Observatory Quest",
    "image": "Observatory Quest reward scroll.png",
    "qp": "2",
    "rewards": "* Crafting experience\n*Your item reward depends on what astrological sign you see when you look through the telescope. It is different for each person. Each one rewards an uncut sapphire as well as the following:\n**Aquarius: 25 water runes\n**Aries: 875  Attack experience\n**Cancer: An amulet of defence\n**Capricorn: 875  Strength experience\n**Gemini: A black 2h sword\n**Leo: 875  Hitpoints experience\n**Libra: 3 law runes\n**Pisces: 3 tuna\n**Sagittarius: A maple longbow\n**Scorpio: Weapon poison\n**Taurus: A 1-dose super strength potion\n**Virgo: 875  Defence experience\n*The Spirit of Scorpius will now give you a mould to make unholy symbols, and he will bless them for you too. He can be found in the graveyard north of the Observatory.\n*Talk to the Observatory assistant after the quest and he will reward you with a jug of wine as well as tell you his and the professor's real name.\n*Access to the grappling shortcut rock outside the Observatory.\n*Completing this quest awards the player with 5 Kudos which can be claimed by talking to Historian Minas in the Varrock Museum.",
    "template": "quest rewards"
  },
  {
    "name": "Olaf's Quest",
    "image": "Olaf's Quest reward scroll.png",
    "qp": "1",
    "rewards": "* Defence experience\n*20,000 coins\n*4 cut rubies\n*Access to a cave where you can fight brine rats.\n*A piece of parchment telling you of other shipwrecks with more treasure. (This extra treasure is currently not available in the game)",
    "template": "quest rewards"
  },
  {
    "name": "One Small Favour",
    "image": "One Small Favour reward scroll.png",
    "qp": "2",
    "rewards": "*Two experience lamps giving 10,000 experience to any skill of your choice. Skill must be at least level 30.\n*A steel key ring\n*The ability to make Guthix rest tea\n*The ability to craft pot lids\n*Access to the gnome glider route to the Feldip Hills\n\nUnlocks:\n* Slagilith accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Perilous Moons",
    "qp": "2",
    "rewards": "* experience\n*  experience\n*  experience\n*  experience\n* Access to Neypotzli and the Moons of Peril\n\nIn addition, completing the quest counts as a normal defeat of the Moons of Peril, allowing the player to loot the Lunar Chest for further rewards.",
    "template": "quest rewards"
  },
  {
    "name": "Pirate's Treasure",
    "image": "Pirate's Treasure reward scroll.png",
    "qp": "2",
    "rewards": "*Ability to use the pay-fare option to and from Karamja.\n*Access to One-Eyed Hector's Treasure Chest (contains a gold ring, an emerald, and 450 coins).",
    "template": "quest rewards"
  },
  {
    "name": "Plague City",
    "image": "Plague City reward scroll.png",
    "qp": "1",
    "rewards": "* experience\n* Ardougne teleport scroll, reading it unlocks the Ardougne Teleport with 51 Magic and use of the Ardougne teletab.",
    "template": "quest rewards"
  },
  {
    "name": "Priest in Peril",
    "image": "Priest in Peril reward scroll.png",
    "qp": "1",
    "rewards": "* Prayer experience\n*Wolfbane dagger, prevents the citizens of Canifis from transforming into werewolves when attacked\n*Route to Canifis and Morytania\n*Completing this quest awards the player with 5 Kudos which can be claimed by talking to Historian Minas in the Varrock Museum.",
    "template": "quest rewards"
  },
  {
    "name": "Prince Ali Rescue",
    "image": "Prince Ali Rescue reward scroll.png",
    "qp": "3",
    "rewards": "*700 coins\n*Free passage through the Lumbridge - Al Kharid toll gate from now on\n*(Members) Access to the Sorceress's Garden Thieving minigame.",
    "template": "quest rewards"
  },
  {
    "name": "Rag and Bone Man I",
    "image": "Rag and Bone Man I reward scroll.png",
    "qp": "1",
    "rewards": "* Cooking experience\n* Prayer experience",
    "template": "quest rewards"
  },
  {
    "name": "Rag and Bone Man II",
    "image": "Rag and Bone Man II reward scroll (Ram skull helm and Bonesack).png",
    "qp": "1",
    "rewards": "* experience\n*Bonesack\n*Ram skull helm",
    "template": "quest rewards"
  },
  {
    "name": "Ratcatchers",
    "image": "Ratcatchers reward scroll.png",
    "qp": "2",
    "rewards": "* Thieving experience\n*A rat pole\n*The ability to train overgrown cats into wily and lazy cats.\n*The ability to name your wily or lazy cat (up to six letters long).\n*Access to the Rat Pits.\n*The ability to use the Grouping teleport to the rat pits in Port Sarim, Ardougne, Varrock, and Keldagrim.",
    "template": "quest rewards"
  },
  {
    "name": "Recipe for Disaster",
    "image": "Recipe for Disaster (Defeating the Culinaromancer) reward scroll.png\nIn total, completing all 10 subquests for \"Recipe for Disaster\" awards:",
    "qp": "10",
    "rewards": "*An experience lamp, which grants 20,000 experience to any skill above 50 (can be banked for later use)\n*Access to the following areas:\n**Mogre Camp\n**Evil Chicken's Lair\n*Ability to dive for crabs\n*Ability to cook crab meat\n*Ability to catch hell-rats\n*Ability to own a hellcat\n*Ability to add coloured spices to stews of any sort\n*Ability to use the boat trip to travel between Karamja and Feldip Hills\n*Ape Atoll Teleport spell\n*Full access to Culinaromancer's Chest\n**Access to Kitchen weaponry\n**Access to the banking chest (under Lumbridge Castle)\n**Access to a food store in the Culinaromancer's Chest\n**Access to buy Barrows gloves\n\nUnlocks:\n* Evil Chicken accessible in the Nightmare Zone on completion of Recipe for Disaster - Freeing Sir Amik Varze subquest.\n* Agrith-Na-Na, Flambeed, Karamel, Dessourt, Gelatinnoth Mother, Culinaromancer accessible in the Nightmare Zone after quest completion.",
    "template": "quest rewards"
  },
  {
    "name": "Recipe for Disaster/Another Cook's Quest",
    "image": "Another Cook's Quest reward scroll.png",
    "qp": "1",
    "rewards": "*The invitation to the feast of a lifetime!\n*Access to the Culinaromancer's Chest (after watching the cut scene in the feast room).",
    "template": "quest rewards"
  },
  {
    "name": "Recipe for Disaster",
    "image": "Recipe for Disaster (Defeating the Culinaromancer) reward scroll.png",
    "qp": "1",
    "rewards": "*An experience lamp, which grants 20,000 experience to any skill above 50 (can be banked for later use)\n*Full access to the Culinaromancer's Chest, containing barrows gloves",
    "template": "quest rewards"
  },
  {
    "name": "Recipe for Disaster/Freeing Evil Dave",
    "image": "Recipe for Disaster (Freeing Evil Dave) reward scroll.png",
    "qp": "1",
    "rewards": "* Cooking experience\n*The ability to catch hellrats to get a Hellcat\n*The ability to have your cat fight Hell-Rat Behemoths\n*The ability to add coloured spices to stew by catching hellrats (Spicy stews can boost and lower certain stats)\n*Further access to the Culinaromancer's Chest",
    "template": "quest rewards"
  },
  {
    "name": "Recipe for Disaster/Freeing King Awowogei",
    "image": "Recipe for Disaster (Freeing King Awowogei) reward scroll.png",
    "qp": "1",
    "rewards": "* Cooking experience\n* Agility experience\n*Ape Atoll Teleport spell\n*Further access to the Culinaromancer's Chest",
    "template": "quest rewards"
  },
  {
    "name": "Recipe for Disaster/Freeing Pirate Pete",
    "image": "Recipe for Disaster (Freeing Pirate Pete) reward scroll.png",
    "qp": "1",
    "rewards": "* Cooking experience\n* Crafting experience\n* Fishing experience\n* Smithing experience\n*The ability to go diving and fight crabs (you need your diving apparatus)\n*The ability to cook crab meat (heals 10 hitpoints in 5 bites)\n*The ability to kill crabs to get their shells and claws, which can be made into a helmet and gloves with a chisel\n*Further access to the Culinaromancer's Chest",
    "template": "quest rewards"
  },
  {
    "name": "Recipe for Disaster/Freeing Sir Amik Varze",
    "image": "Recipe for Disaster (Freeing Sir Amik Varze) reward scroll.png",
    "qp": "1",
    "rewards": "* Cooking experience\n* Hitpoints experience\n*Access to the Evil Chicken's Lair, where you can fight black dragons (The fowl beast himself has moved on to other things.)\n*Further access to the Culinaromancer's Chest.\n\nUnlocks:\n* Evil Chicken accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Recipe for Disaster/Freeing Skrach Uglogwee",
    "image": "Recipe for Disaster (Freeing Skrach Uglogwee) reward scroll.png",
    "qp": "1",
    "rewards": "* Woodcutting experience\n* Cooking experience\n* Crafting experience\n* Ranged experience\n*The ability to use the boat trip to travel between Karamja and the Feldip Hills (you must pay a fee of chompies or exotic herbs)\n*Further access to the Culinaromancer's Chest",
    "template": "quest rewards"
  },
  {
    "name": "Recipe for Disaster/Freeing the Goblin generals",
    "image": "Recipe for Disaster (Freeing the Goblin generals) reward scroll.png",
    "qp": "1",
    "rewards": "* Cooking experience\n* Farming experience\n* Crafting experience\n*Further access to the Culinaromancer's Chest.",
    "template": "quest rewards"
  },
  {
    "name": "Recipe for Disaster/Freeing the Lumbridge Sage",
    "image": "Recipe for Disaster (Freeing the Lumbridge Guide) reward scroll.png",
    "qp": "1",
    "rewards": "* Cooking experience\n* Magic experience\n*Further access to the Culinaromancer's Chest",
    "template": "quest rewards"
  },
  {
    "name": "Recipe for Disaster: Freeing the Mountain Dwarf",
    "image": "Recipe for Disaster (Freeing the Mountain Dwarf) reward scroll.png",
    "qp": "1",
    "rewards": "* Slayer experience\n* Cooking experience\n*Further access to the Culinaromancer's Chest\n*Ability to obtain additional Dwarven Rock Cakes from Rohak for either 100 coins or the raw ingredients",
    "template": "quest rewards"
  },
  {
    "name": "Recruitment Drive",
    "image": "Recruitment Drive reward scroll.png",
    "qp": "1",
    "rewards": "* Prayer experience\n* Herblore experience\n* Agility experience\n*3,000 coins\n*Access to initiate armour. You will be given a sallet for free, and you can buy subsequent sallets from Sir Tiffy Cashien for 6,000 coins, the cuisse for 8,000 coins, the hauberk for 10,000 coins, or the full set for 20,000 coins. It is aesthetically similar to white armour, with a gold trim.\n*The Gaze of Saradomin - When you die, you will have the option of returning to Falador instead of Lumbridge. Talk to Sir Tiffy Cashien to change your spawn point at any time.\n* Appointment with the title of Initiate in the Order of Temple Knights.",
    "template": "quest rewards"
  },
  {
    "name": "Regicide",
    "image": "Regicide reward scroll.png",
    "qp": "3",
    "rewards": "* experience\n*15,000 coins\n*Access to the elven kingdom of Tirannwn and the overpass of Arandar\n*The ability to wield the dragon halberd (With level 60 Attack and 30 Strength)\n*The ability to charter a ship to Port Tyras\n*The ability to use Iorwerth camp teleport scrolls\n*The ability to use Zul-Andra teleport scrolls and battle Zulrah",
    "template": "quest rewards"
  },
  {
    "name": "Romeo & Juliet",
    "image": "Romeo & Juliet reward scroll.png",
    "qp": "5",
    "template": "quest rewards"
  },
  {
    "name": "Roving Elves",
    "image": "Roving Elves reward scroll.png",
    "qp": "1",
    "rewards": "* Strength experience\n*Crystal shield or bow with 500 charges\n\nUnlocks:\n* Moss Guardian accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Royal Trouble",
    "image": "Royal Trouble reward scroll.png",
    "qp": "1",
    "rewards": "*20,000 Coins\n* Agility experience\n* Slayer experience\n* Hitpoints experience\n*Enhanced rewards from Managing Miscellania",
    "template": "quest rewards"
  },
  {
    "name": "Rum Deal",
    "image": "Rum Deal reward scroll.png",
    "qp": "2",
    "rewards": "* Fishing experience\n* Prayer experience\n* Farming experience\n*The Holy wrench (while in your inventory, this grants more prayer points when drinking a prayer potion)\n*Access to Braindeath Island",
    "template": "quest rewards"
  },
  {
    "name": "Rune Mysteries",
    "image": "Rune Mysteries reward scroll.png",
    "qp": "1",
    "rewards": "*The ability to mine rune essence\n*An air talisman\n*The ability to use lamps and books of knowledge from random events on Runecraft\n*Completing this quest awards the player with 5 Kudos which can be claimed by talking to Historian Minas in the Varrock Museum.",
    "template": "quest rewards"
  },
  {
    "name": "Scorpion Catcher",
    "image": "Scorpion Catcher reward scroll.png",
    "qp": "1",
    "rewards": "* Strength experience\n*The ability to have Thormac turn a battlestaff into a mystic staff for 40,000 coins",
    "template": "quest rewards"
  },
  {
    "name": "Sea Slug",
    "image": "Sea Slug reward scroll.png",
    "qp": "1",
    "rewards": "* Fishing experience\n*Access to the Fishing Platform\n*Oyster pearls",
    "template": "quest rewards"
  },
  {
    "name": "Secrets of the North",
    "qp": "2",
    "rewards": "* experience\n* experience\n* experience\n* Ability to mine ancient essence crystals in the Ghorrock Dungeon\n* Access to a stronger version of the Strange Creature, the Phantom Muspah",
    "template": "quest rewards"
  },
  {
    "name": "Shades of Mort'ton",
    "image": "Shades of Mort'ton reward scroll.png",
    "qp": "3",
    "rewards": "* Herblore experience\n* Crafting experience\n*Ability to play the Shades of Mort'ton minigame\n*Ability to use the Shades of Mort'ton minigame teleport\n*Bonus: If you take the Diary of Herbi Flax to the Apothecary in Varrock, you'll get an extra 335 Herblore experience (can only be done once).",
    "template": "quest rewards"
  },
  {
    "name": "Shadow of the Storm",
    "image": "Shadow of the Storm reward scroll.png",
    "qp": "1",
    "rewards": "*10,000 experience in any combat skill other than Prayer.\n*Silverlight turns into the Darklight sword - it has a special attack and is even more powerful against demons. It costs slightly more to replace.\n*Six cut gems: two sapphires, two rubies and two emeralds, if you use a hammer and chisel on the demon's throne and had not yet removed them during The Golem.\n\nUnlocks:\n* Agrith-Naar accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Sheep Herder",
    "image": "Sheep Herder reward scroll.png",
    "qp": "4",
    "rewards": "*3,100 coins",
    "template": "quest rewards"
  },
  {
    "name": "Sheep Shearer",
    "image": "Sheep Shearer reward scroll.png",
    "qp": "1",
    "rewards": "* Crafting experience\n*60 coins",
    "template": "quest rewards"
  },
  {
    "name": "Shield of Arrav",
    "image": "Shield of Arrav reward scroll.png",
    "qp": "1",
    "rewards": "*600 coins\n*Additional rewards, which members can claim, when talking with Historian Minas in the Varrock Museum\n**5 Kudos \n**Antique lamp awarding 1,000xp in a skill of at least level 20",
    "template": "quest rewards"
  },
  {
    "name": "Shilo Village",
    "image": "Shilo Village reward scroll.png",
    "qp": "2",
    "rewards": "* Crafting experience\n*Access to Shilo Village\n*Ability to quick travel to Shilo Village using the cart near the Brimhaven docks\n*After completing the quest, you can sell every item you obtained during the quest to Yanni Salika in Shilo Village for — 100 each for the stone-plaque, tattered scroll, crumpled scroll, Bervirius notes and the bone key, 500 for the locating crystal, and 1000 for the beads of the dead.\n*Ability to mine the gem rocks in Shilo Village mine.\n\nUnlocks:\n* Nazastarool accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Sins of the Father",
    "image": "Sins of the Father reward scroll.png",
    "qp": "2",
    "rewards": "*Access to Darkmeyer\n**Access to the Daeyalt Essence Mine\n**Access to the Hallowed Sepulchre\n**Ability to shop at stores in Darkmeyer while wearing Vyre noble clothing\n**Ability to use the wall shortcut on the eastern side of Darkmeyer with 63 Agility, after purchasing two long ropes from the Darkmeyer General Store and using them on it.\n*A tome of experience, granting 15,000 experience to any skill. (level 60 or higher). This reward can be utilised six times and may be used for the same skill.\n*The Blisterwood flail\n*Darkmeyer teleport via Drakan's medallion\n*Boat travel between Burgh de Rott, Slepe and the Icyene Graveyard\n*Access to the True Blood Altar (with a Blood talisman)\n**Access to the Guardian of Blood in the Guardians of the Rift minigame",
    "template": "quest rewards"
  },
  {
    "name": "Sleeping Giants",
    "qp": "1",
    "rewards": "* Smithing experience\n* Access to the Giants' Foundry",
    "template": "quest rewards"
  },
  {
    "name": "Song of the Elves",
    "image": "Song of the Elves reward scroll.png",
    "qp": "4",
    "rewards": "* experience\n* experience\n* experience\n* experience\n* experience\n* experience\n* experience\n* experience\n*Access to Prifddinas\n**Ability to fight Zalcano\n**Access to The Gauntlet\n**Access to Trahaearn Mine\n**Access to Iorwerth Dungeon\n**Ability to change respawn point to Prifddinas\n**Ability to move Player-owned house to Prifddinas\n**Ability to teleport to Prifddinas with a teleport crystal\n**Ability to make divine potions\n**Ability to make crystal tools, armour and weaponry\nUnlocks:\n* Arianwyn (as Elven Traitor) and Essyllt accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Spirits of the Elid",
    "image": "Spirits of the Elid reward scroll.png",
    "qp": "2",
    "rewards": "* Prayer experience\n* Thieving experience\n* Magic experience\n*Access to Nardah's fountain for water and the shrine: Praying at the statuette will fill Hitpoints, temporarily boost it, cure poison and venom, restore prayer points, run energy, and special attack energy.\n*Robe of elidinis",
    "template": "quest rewards"
  },
  {
    "name": "Swan Song",
    "image": "Swan Song reward scroll.png",
    "qp": "2",
    "rewards": "* Magic experience\n* Prayer experience\n* Fishing experience\n*25,000 coins\n*Access to the Piscatoris Fishing Colony\n**The ability to fish monkfish\n**The ability to use Skeleton Mages for training\n**Use Kathy Corkat's boat for free\n*Access to the following items from Malignius Mortifer upon request:\n**A brown apron\n**Bone seeds (requires an airtight pot)",
    "template": "quest rewards"
  },
  {
    "image": "Tai Bwo Wannai Trio reward scroll.png",
    "qp": "2",
    "rewards": "*2,000 Coins (awarded by Timfraku immediately upon quest completion)\n* Cooking experience (claimed upon speaking to Tinsay)\n* Fishing experience (claimed upon speaking to Tiadeche)\n* Attack experience, Strength experience, and a karambwan-poisoned rune spear (claimed upon speaking to Tamayu)\n*Access to Tamayu's Spear Stall (sells cleaning cloths)\n*Access to Tiadeche's Karambwan Stall (sells raw karambwans and karambwan vessels)\n*The ability to pray at the newly repaired tribal statue (works like an altar) by talking to Tinsay and Tiadeche in the village after the quest\n*The ability to catch and cook karambwans by talking to Tinsay in the village after the quest\n*The ability to fight the Shaikahan (level 83 - you need a kp spear to hit it)\n*The ability to use Tai bwo wannai teleport scrolls\n*The ability to take part in the Smithing section of the Barbarian Training miniquest.",
    "template": "quest rewards"
  },
  {
    "name": "Tale of the Righteous",
    "image": "Tale of the Righteous reward scroll.png",
    "qp": "1",
    "rewards": "*8,000 coins\n*A page for Kharedst's memoirs, 'History and hearsay.' It teleports players to the Graveyard of Heroes south-west of the Shayzien bank.\n*Ability to recolour the graceful outfit to the colours of Shayzien.\n*Ability to fight the Corrupt Lizardman within the Nightmare Zone.\n*3 Xerician fabric (dropped by Corrupt Lizardman)",
    "template": "quest rewards"
  },
  {
    "name": "Tears of Guthix",
    "image": "Tears of Guthix reward scroll.png",
    "qp": "1",
    "rewards": "* Crafting experience\n*Ability to play the Tears of Guthix (minigame) once a week",
    "template": "quest rewards"
  },
  {
    "name": "Temple of Ikov",
    "image": "Temple of Ikov reward scroll.png",
    "qp": "1",
    "rewards": "* Ranged experience\n* Fletching experience\n*Armadyl pendant (if you sided with Lucien, you must kill Guardians of Armadyl to obtain it)\n*Pendant of Lucien, which grants access to a door in the Temple of Ikov\n*Optional; Boots of lightness\n*Optional; Shiny key, for a shortcut between the Temple of Ikov and McGrubor's Wood\n*Completing this quest awards the player with 5 kudos which can be claimed by talking to Historian Minas in the Varrock Museum",
    "template": "quest rewards"
  },
  {
    "name": "Temple of the Eye",
    "qp": "1",
    "rewards": "* Runecraft experience\n**An additional 4,210 Runecraft XP is gained during the quest, for a total of 9,210 XP\n* Access to the Guardians of the Rift minigame\n* A medium pouch (if not already acquired)",
    "template": "quest rewards"
  },
  {
    "name": "The Ascent of Arceuus",
    "image": "The Ascent of Arceuus reward scroll.png",
    "qp": "1",
    "rewards": "*2,000 coins\n* experience\n* experience\n*A page for Kharedst's memoirs, 'A dark disposition.' It teleports players to the centre of Arceuus.\n*Ability to recolour the graceful outfit to the colours of Arceuus.\n*Ability to receive Arceuus signets from Tyss.\n*Ability to fight the Trapped Soul within the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "The Corsair Curse",
    "image": "The Corsair Curse reward scroll.png",
    "qp": "2",
    "rewards": "*Access to Yusuf's bank in the Corsair Cove.\n\nUnlocks:\n* Corsair Traitor accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "The Depths of Despair",
    "image": "The Depths of Despair reward scroll.png",
    "qp": "1",
    "rewards": "* Agility experience\n*4,000 coins\n*A page for Kharedst's memoirs, 'Lunch by the lancalliums'. It teleports players to just east of the Hosidius Kitchen.\n*Ability to recolour the graceful outfit to the colours of Hosidius.\n*Ability to fight the Sand Snake within the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "The Dig Site",
    "image": "The Dig Site reward scroll.png",
    "qp": "2",
    "rewards": "* Mining exp\n* Herblore exp\n*2 gold bars\n*Show the museum curator the Level 3 certificate to choose between something to drink (Fruit blast) or something to eat (chocolate cake). Get the cake for Desert Treasure I / A Tail of Two Cats or the fruit blast for Recipe for Disaster. Make sure that you go through the dialogue for each one that you give it or he will not give you a chance to pick which reward you want and you will receive nothing.\n*The ability to do Varrock Museum specimen cleaning to obtain a Digsite pendant.\n*The Ancient talisman can be viewed in the Digsite Exhibit at the museum on the.",
    "template": "quest rewards"
  },
  {
    "name": "The Eyes of Glouphrie",
    "image": "The Eyes of Glouphrie reward scroll.png",
    "qp": "2",
    "rewards": "* Magic experience\n* Woodcutting experience\n* Runecraft experience\n* Construction experience\n*A crystal saw seed — Either take it to Ilfeen in Tirannwn or use it on the singing bowl by Brimstail to get an enchanted crystal saw. It allows items (that require a saw) to be made three levels above your Construction. It has a limited number of charges (28), but the recharge is free - use the bowl again.",
    "template": "quest rewards"
  },
  {
    "name": "The Feud",
    "image": "The Feud reward scroll.png",
    "qp": "1",
    "rewards": "* Thieving experience\n*500 coins\n*An oak blackjack\n*The desert disguise\n*A willow blackjack (as a drop from the tough guy)\n*An adamant scimitar (as a drop from the bandit champion)\n*Access to the Rogue Trader minigame – Completing this will allow Ali Morrisane to sell blackjacks, various runes, and different clothing from around the Kharidian Desert\n*Can now steal from villagers, bandits and Menaphite Thugs",
    "template": "quest rewards"
  },
  {
    "name": "The Forsaken Tower",
    "image": "The Forsaken Tower reward scroll.png",
    "qp": "1",
    "rewards": "* Mining experience\n* Smithing experience\n*6,000 coins\n*Free use of the Lovakengj Minecart Network\n*A page for Kharedst's memoirs, 'Jewellery of jubilation.' It teleports players north-east of the bank in Lovakengj.\n*Ability to recolour the graceful outfit to the colours of Lovakengj.",
    "template": "quest rewards"
  },
  {
    "name": "The Fremennik Exiles",
    "image": "The Fremennik Exiles reward scroll.png",
    "qp": "2",
    "rewards": "*V's shield\n*Access to the Island of Stone\n* Ability to kill a Basilisk Knight as a Slayer Task\n*A Fremennik honorific, Dräpare, added to the player's Fremennik name\n*Ability to create and equip the Neitiznot faceguard\n* Slayer experience\n* Crafting experience\n* Runecraft experience",
    "template": "quest rewards"
  },
  {
    "name": "The Fremennik Isles",
    "image": "The Fremennik Isles reward scroll.png",
    "qp": "1",
    "rewards": "* Construction experience\n* Crafting experience\n* Woodcutting experience\n*Two lots of Combat experience (choose between  Strength,  Attack,  Defence or  Hitpoints).\n*A Fremennik royal helm known as the helm of Neitiznot, which is the equivalent of a berserker helm with a +3 Prayer bonus, slightly better Magic and crush Defence, and no negative bonuses. If a player loses the helm, they can talk to Mawnis Burowgar to buy another one for 50,000 coins.\n*Access to arctic pine trees.\n*Access to an island with a runite rock north-east of Neitiznot, which also has seven (7) coal rocks nearby.\n*Access to the Jatizso mine, which contains up to adamantite rocks.\n*Around 20,000 coins in assorted rewards during quest.\n*The banks in Neitiznot and Jatizso are close to water, range, furnace, fishing spots, mining ores; a spinning wheel is also nearby.\n*If the jester outfit is lost, a player can retrieve another one from the chest behind King Gjuki Sorvott IV's throne.\n*Learn the ability to create yak-hide armour and Neitiznot shields.\n*The Contraband Yak Produce shop is available on Jatizso if a player refunds the 5,000 coin tax to Vanligga Gastfrihet, who is north of the king.\n\nUnlocks:\n* Ice Troll King accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "The Fremennik Trials",
    "image": "The Fremennik Trials reward scroll.png",
    "qp": "3",
    "rewards": "* Agility experience\n* Attack experience\n* Crafting experience\n* Defence experience\n* Fishing experience\n* Fletching experience\n* Hitpoints experience\n* Strength experience\n* Thieving experience\n* Woodcutting experience\n*Access to the islands of Miscellania, Etceteria, Neitiznot, and Jatizso along with access to the facilities in Rellekka.\n*Ability to wear the Fremennik warrior, berserker, archer, and farseer helms\n*Ability to have Fossegrimen create the enchanted lyre(i)\n*A herring",
    "template": "quest rewards"
  },
  {
    "name": "The Garden of Death",
    "image": "The Garden of Death reward scroll.png",
    "qp": "1",
    "rewards": "* experience",
    "template": "quest rewards"
  },
  {
    "name": "The Giant Dwarf",
    "image": "The Giant Dwarf reward scroll.png",
    "qp": "2",
    "rewards": "* Mining experience\n* Smithing experience\n* Crafting experience\n* Magic experience\n* Thieving experience\n* Firemaking experience",
    "template": "quest rewards"
  },
  {
    "name": "The Golem",
    "image": "The Golem reward scroll.png",
    "qp": "1",
    "rewards": "* Thieving experience\n* Crafting experience\n*2 cut rubies, emeralds, and sapphires (collect these by using a chisel and hammer on the throne)\n*Unlock the carpet ride from Shantay Pass to Uzer",
    "template": "quest rewards"
  },
  {
    "name": "The Grand Tree",
    "image": "The Grand Tree reward scroll.png",
    "qp": "5",
    "rewards": "* Attack experience\n* Agility experience\n* Magic experience\n*Access to the mine under the Grand Tree.\n*Access to the Gnome glider transportation system.\n*Ability to use the Agility shortcut from the Grand Tree to the Barbarian Outpost (with 37 Agility).\n*Ability to use the Spirit Tree in the Stronghold after the completion of Tree Gnome Village.\n*Completing this quest awards the player with 5 Kudos which can be claimed by talking to Historian Minas in the Varrock Museum.\n\nUnlocks:\n* Black demon accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "The Great Brain Robbery",
    "image": "The Great Brain Robbery reward scroll.png",
    "qp": "2",
    "rewards": "* Prayer experience\n* Crafting experience\n* Construction experience\n*Blessed lamp ( experience in a chosen skill above level 30 and can be placed in your bank)\n*Barrelchest anchor (To repair your barrelchest anchor, return to Mos Le'Harmless and make sure you have a book o' piracy in your inventory; then, go to the docks south of the bank and talk to \"Smith.\" He can fix your anchor for 230,000 coins.)\n*Prayer book\n*Ability to cast Harmony Island Teleport on the Arceuus spellbook\n*Ability to fight the Barrelchest within the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "The Hand in the Sand",
    "image": "The Hand in the Sand reward scroll.png",
    "qp": "1",
    "rewards": "* Thieving experience\n* Crafting experience\n*Ability to buy pink dye from Betty\n*A secret reward from Bert - He simply loves sand, and wasn't in the job for the money. He will ship 84 buckets of sand to your bank if you talk to him after the quest. This can be done once per day (UTC). Asking Bert to take sand to your bank is also an Ardougne Medium task.\n*Access to the Wizards' Guild rune store",
    "template": "quest rewards"
  },
  {
    "name": "The Knight's Sword",
    "image": "The Knight's Sword reward scroll.png",
    "qp": "1",
    "rewards": "* Smithing experience\n*A blurite sword (if you got Thurgo to make you an extra one)\n*The ability to smelt blurite ore into blurite bars (members only)",
    "template": "quest rewards"
  },
  {
    "name": "The Lost Tribe",
    "image": "The Lost Tribe reward scroll.png",
    "qp": "1",
    "rewards": "* Mining experience\n*The ability to use the Goblin Bow and Goblin Salute emotes\n*Access to the Dorgesh-Kaan mine\n*A ring of life\n*Access to Nardok's Bone Weapon's store where players can purchase the Dorgeshuun crossbow, bone bolts and other bone weapons.",
    "template": "quest rewards"
  },
  {
    "name": "The Path of Glouphrie",
    "qp": "2",
    "rewards": "* Four magic lamps offering a total of Slayer XP,   Thieving XP,   Strength XP, and   Magic XP\n* Access to the Poison Waste Dungeon\n* Ability to unlock warped creatures as a Slayer task which drop the warped sceptre\n* Access to a new spirit tree destination in the Poison Waste",
    "template": "quest rewards"
  },
  {
    "name": "The Queen of Thieves",
    "image": "The Queen of Thieves reward scroll.png",
    "qp": "1",
    "rewards": "* Thieving experience\n*2,000 coins\n*A page for Kharedst's memoirs, 'The fisher's flute.' It teleports players to the centre of Port Piscarilius.\n*Ability to recolour the graceful outfit to the colours of Port Piscarilius.",
    "template": "quest rewards"
  },
  {
    "name": "The Restless Ghost",
    "image": "The Restless Ghost reward scroll.png",
    "qp": "1",
    "rewards": "* Prayer experience\n*Ghostspeak amulet (keep for several quests and content in the future)",
    "template": "quest rewards"
  },
  {
    "name": "The Ribbiting Tale of a Lily Pad Labour Dispute",
    "image": "The Ribbiting Tale of a Lily Pad Labour Dispute reward scroll.png",
    "qp": "1",
    "rewards": "* experience\n* Access to a new Hardwood Farming patch",
    "template": "quest rewards"
  },
  {
    "name": "The Slug Menace",
    "image": "The Slug Menace reward scroll.png",
    "qp": "1",
    "rewards": "* Crafting experience\n* Runecraft experience\n* Thieving experience\n*Promotion to Proselyte among the Temple Knights. This means you can buy and wear Proselyte armour with a greater Prayer bonus than Initiate. You can buy each piece individually, or buy the armour pack which, when opened, gives you the plate, helm, and legs/tassets all at once. The pack costs 25,000 coins\n**Buying the upgraded armour in separate pieces costs more: the helm costs 8,000 coins, the platelegs and plateskirt cost 10,000 coins, and the platebody costs 12,000 coins for a total of 30,000 coins\n**Required for the hard Falador Diary",
    "template": "quest rewards"
  },
  {
    "name": "The Tourist Trap",
    "image": "The Tourist Trap reward scroll.png",
    "qp": "2",
    "rewards": "*4,650 Experience in your choice of two skills (you may pick same skill twice): Agility,  Fletching,  Smithing, or  Thieving.\n*The ability to smith darts.\n*The wrought iron key - allows access to a special door inside the Desert Mining Camp, which has several higher tier ores inside, including mithril ore and adamantite ore.\n*Full slave robes\n*6 bronze darts",
    "template": "quest rewards"
  },
  {
    "name": "Throne of Miscellania",
    "image": "Throne of Miscellania reward scroll.png",
    "qp": "1",
    "rewards": "*Management of Miscellania\n* 10,000 coins (inside the Miscellania coffers)\n* The ability to teleport to Miscellania using a ring of wealth",
    "template": "quest rewards"
  },
  {
    "name": "Tower of Life",
    "image": "Tower of Life reward scroll.png",
    "qp": "2",
    "rewards": "* Construction experience\n* Crafting experience\n* Thieving experience\n*Access to Creature Creation\n*Builder's costume",
    "template": "quest rewards"
  },
  {
    "name": "Tree Gnome Village",
    "image": "Tree Gnome Village reward scroll.png",
    "qp": "2",
    "rewards": "* Attack experience\n*Use of spirit trees for transportation\n*The Gnome amulet\n\nUnlocks:\n* Khazard warlord accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Tribal Totem",
    "image": "Tribal Totem reward scroll.png",
    "qp": "1",
    "rewards": "* Thieving experience\n*5 Swordfish",
    "template": "quest rewards"
  },
  {
    "name": "Troll Romance",
    "image": "Troll Romance reward scroll.png",
    "qp": "2",
    "rewards": "* Agility experience\n* Strength experience\n*1 uncut diamond, 2 uncut rubies and 4 uncut emeralds \n*A sled (required to complete a hard and an elite clue scroll step)\n*Sledding route from Trollweiss Mountain\n\nUnlocks:\n* Arrg accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Troll Stronghold",
    "image": "Troll Stronghold reward scroll.png",
    "qp": "1",
    "rewards": "*Law talisman (if you lose it, you can get another from Dunstan for 1,000 coins)\n* Law talismans can be obtained via Guardians of the Rift\n*Ability to make law runes\n*Access to Trollheim and the Troll Stronghold\n*Ability to access the God Wars Dungeon\n\nUnlocks:\n* Dad accessible in the Nightmare Zone",
    "template": "quest rewards"
  },
  {
    "name": "Twilight's Promise",
    "image": "Twilight's Promise reward scroll.png",
    "qp": "1",
    "rewards": "* Ability to use the Civitas illa Fortis Teleport spell\n* Ability to use the Quetzal Transport System\n* experience",
    "template": "quest rewards"
  },
  {
    "name": "Underground Pass",
    "image": "Underground Pass reward scroll.png",
    "qp": "5",
    "rewards": "* Agility experience\n* Attack experience\n*Iban's staff and use of the Iban Blast spell.\n*Klank's gauntlets",
    "template": "quest rewards"
  },
  {
    "name": "Vampyre Slayer",
    "image": "Vampyre Slayer reward scroll.png",
    "qp": "3",
    "rewards": "* Attack experience\n\nUnlocks:\n* Count Draynor accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Wanted!",
    "image": "Wanted! reward scroll.png",
    "qp": "1",
    "rewards": "* Slayer experience\n*Access to the armoury of the White Knights (White equipment)",
    "template": "quest rewards"
  },
  {
    "name": "Watchtower",
    "image": "Watchtower reward scroll.png",
    "qp": "4",
    "rewards": "* Magic experience\n*5,000 Coins\n*A scroll, the reading of which gives you the ability to use Watchtower Teleport\n*Access to the ogre city (and Ogre Enclave where you can fight blue dragons. You will not need an extra nightshade to enter after the quest is complete.)",
    "template": "quest rewards"
  },
  {
    "name": "Waterfall Quest",
    "image": "Waterfall Quest reward scroll.png",
    "qp": "1",
    "rewards": "* Strength experience\n* Attack experience\n*2 Diamonds\n*2 Gold bars\n*40 Mithril seeds",
    "template": "quest rewards"
  },
  {
    "name": "What Lies Below",
    "image": "What Lies Below reward scroll.png",
    "qp": "1",
    "rewards": "* Runecraft experience\n* Defence experience\n*The Beacon ring\n*Access to a shortcut to the Chaos Altar\n*Completing this quest awards the player with 5 Kudos which can be claimed by talking to Historian Minas in the Varrock Museum, while holding the Dagon'hai history book.\n*5 Battlestaves in stock of Zaff's Superior Staffs! store (after defeating King Roald - the quest doesn't need to be completed)\n\nUnlocks:\n* King Roald accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "While Guthix Sleeps",
    "qp": "5",
    "rewards": "* experience\n*  experience\n*  experience\n*  experience\n* Access to the Ancient Guthixian Temple and tormented demons\n* Ability to craft the firelight, scorching bow, and ignited staff",
    "template": "quest rewards"
  },
  {
    "name": "Witch's House",
    "image": "Witch's House reward scroll.png",
    "qp": "4",
    "rewards": "* Hitpoints experience\n\nUnlocks:\n* Witch's experiment (multiple forms) accessible in the Nightmare Zone.",
    "template": "quest rewards"
  },
  {
    "name": "Witch's Potion",
    "image": "Witch's Potion reward scroll.png",
    "qp": "1",
    "rewards": "* Magic experience",
    "template": "quest rewards"
  },
  {
    "name": "X Marks the Spot",
    "image": "X Marks the Spot reward scroll.png",
    "qp": "1",
    "rewards": "*200 coins\n*Antique lamp providing 300 experience in a skill of the player's choosing (can be reclaimed if lost or destroyed)\n*A beginner clue scroll (only if the player does not have one already in their possession; can be claimed later if players had one in their possession already)",
    "template": "quest rewards"
  },
  {
    "name": "Zogre Flesh Eaters",
    "image": "Zogre Flesh Eaters reward scroll.png",
    "qp": "1",
    "rewards": "*3 ourg bones\n*2 zogre bones\n* experience\n* experience\n* experience\n*Ability to make Relicym's balm\n*Ability to fletch comp ogre bows and brutal arrows\n*Ability to wear inoculation bracelets\n*Give a 2-, 3-, or 4-dose Relicym's balm to Uglug to gain access to ~ Uglug's stuffsies ~",
    "template": "quest rewards"
  }
]