[
  {
    "text": "\"only together as the eight clans can we hope to survive in this hostile new world\"",
    "author": "Lord Baxtorian Cadarn",
    "list": [
      "The great divide"
    ],
    "template": "quote"
  },
  {
    "text": "Good work! I have new information to share with you. Listen carefully, now!\n\nA place 65 steps forward and 17 to the right needs an inspection.\n\nThe weather vane up high will guide you in the right direction.\n\nUnder the ground lies the next clue you seek.\n\nGetting it out requires a little technique.",
    "template": "quote"
  },
  {
    "text": "South of the forest lies a dark hole of great danger.\n\nTo the northeast, a man in a red shirt - no stranger!\n\nIf you find him, he may be able to give you a clue.\n\nBut the man himself will not know how to help you.",
    "template": "quote"
  },
  {
    "text": "An offering which the king gives to Anubis, foremost of the divine booth, [that] he may grant that my corpse is entombed in\n\nthe necropolis, [and] can enter and leave Resi-tjaou, that my ba will not be obstructed in what it desires,\n\nfor the ka of the scribe of the treasury of the lord of the two lands, Nebsen, true of voice, and his beloved wife, the lady of the house Nebet-Ta, true of voice.\n\npower, [and] emerge as a living ba sated by daily provisions,\n\nAn offering which the king gives to Sobek-Re, lord of Sumenu, [that] he may give me glory and",
    "template": "quote"
  },
  {
    "text": "This hunger for more went far past the realm of mere mortals, into the shadowy places of darkness and evil. Iban's ambition was almost godlike in its insatiability, but therein lay the essence of his darkness: as its most base Iban's fundamental desire was to control the hearts and minds of his fellow men, to take them beyond the pale of mere allegiance, and corrupt them into a force of evil. A whole legion of these Soul-less beings, their minds demented from the sheer power of darkness that channeled through them... Zombies, void of emotions, without feelings or cares, servants to their wicked master even unto death...",
    "author": "The Tale of Iban",
    "list": [
      "Transcript:History of iban#Iban"
    ],
    "template": "quote"
  },
  {
    "text": "In which our hero/heroine finds himself/herself contending with life as a monkey.",
    "template": "quote"
  },
  {
    "text": "\"The Final Battle\"",
    "template": "quote"
  },
  {
    "text": "Change a letter from the word Dane to get my first name.\nThe first part of my surname rhymes with wood,\nthe third part rhymes with spade\nand the second rhymes with magic.",
    "template": "quote"
  },
  {
    "text": "I have oft heard rumours that spirits from other dimensions do stake a claim upon this one, for reasons of their own. Having no form of their own, they take control of citizens from this world and control them for their own amusement, even going so far as to force them into slaughtering innocent men and women for the greed of what ever possessions they may drop upon their death, or even just for the sheer fun of it. It doth sound like thou hath mayhaps been possessed by one of these strange and often malicious spirits, and that it hath left after images of its own life from its own dimension upon you... I suggest thee dwell not on whatever malignant thoughts thou might hath been left with, for the dimensions that such spirits come from are often places of great hardship, far removed from the tranquil land of Gielinor.",
    "author": "Guthix",
    "list": [
      "God Letters"
    ],
    "template": "quote"
  },
  {
    "text": "Tumeken is the god of light and husband to Elidinis. He is the leading god of the Menaphite Pantheon. [...] A common saying about Tumeken is that you see him wherever you look, but never actually notice him. ... You humans sometimes say that 'you have to be cruel to be kind'. That seems a fitting way to describe Tumeken.",
    "template": "quote"
  },
  {
    "text": "A very detailed wallpaper featuring the RuneScape Warrior and Skeleton.",
    "template": "quote"
  },
  {
    "text": "A wallpaper depicting a warrior wandering in the fields of RuneScape.",
    "template": "quote"
  },
  {
    "text": "This recently unearthed drawing of the Grand Tree should make an exquisite backdrop for your computer.",
    "template": "quote"
  },
  {
    "text": "An excellent drawing of the RuneScape world. Something every traveller should have in their backpack.",
    "template": "quote"
  },
  {
    "text": "Unfortunately we can't offer you a real dragon to keep in your garden, but we can offer you this flaming good picture of one!",
    "template": "quote"
  },
  {
    "text": "Bob the Jagex cat faces off against the Kalphites - luckily everyone knows cats have 9 lives, so he's sure to be ok.",
    "template": "quote"
  },
  {
    "text": "Deep in the Underground Pass you can find a temple devoted to the once dead evil warrior: Iban.",
    "template": "quote"
  },
  {
    "text": "An excellent drawing of the RuneScape world. Something every traveller should have in their backpack.",
    "template": "quote"
  },
  {
    "text": "The rats of RuneScape are making quite a splash in the sewers with their fearsome new look!",
    "template": "quote"
  },
  {
    "text": "No one would be likely to make a cuddly toy out of this particular bear, and few would choose to get close enough to try!",
    "template": "quote"
  },
  {
    "text": "2006 saw a bold new look for the elementals of RuneScape. Still going with rocky themes, but jazzed up with rich seams of colour, and a little plant life for that natural look. It was an exciting year for elemental fashion!",
    "template": "quote"
  },
  {
    "text": "The gnome restaurant is an acquired taste, offering peculiar dishes and 'original' flavours.",
    "template": "quote"
  },
  {
    "text": "Landlubbers beware: thar be Trouble Brewing on the horizon!",
    "template": "quote"
  },
  {
    "text": "The healers always keep an eye out for wandering barbarians and unprepared adventurers.",
    "template": "quote"
  },
  {
    "text": "Every world needs a balance. With so many fearsome creatures inhabiting the landscape, where would an adventurer be without the humble sheep to provide some much needed calm?",
    "template": "quote"
  },
  {
    "text": "Arachnophobia is defined as an irrational fear of spiders. Having seen the new-look spiders in RuneScape, we say there's nothing irrational about a little fear!",
    "template": "quote"
  },
  {
    "text": "What yer lookin' at, eh? So what if we imps 'ave gone an' got ourselves a bran' spankin' look? Ya got a problem? Nah, din't fink so...",
    "template": "quote"
  },
  {
    "text": "We've heard of those who like their bathwater hot, but the lava dwarves take it to a ridiculous level. The words 'cold tap' are not in their vocabulary!",
    "template": "quote"
  },
  {
    "text": "Mummy mia! They may be deceased and wrapped in bandages from head to toe, but that doesn't mean they can't look great!",
    "template": "quote"
  },
  {
    "text": "Brains..... BRAAAAINS!",
    "template": "quote"
  },
  {
    "text": "Angry tree spirits and icy apparitions - enough to send a chill down anyone's spine!",
    "template": "quote"
  },
  {
    "text": "The wise old man is deep in thought, pondering his latest and greatest adventure... or perhaps just deciding what to have for dinner tonight!",
    "template": "quote"
  },
  {
    "text": "Wait a second... if these guys are off enjoying their summer vacation, who on RuneScape is holding the detail select buttons?",
    "template": "quote"
  },
  {
    "text": "Robin manages to remain dapper while facing off against a band of not-so-merry imps!",
    "template": "quote"
  },
  {
    "text": "House prices on Crandor suddenly and inexplicably plummet!",
    "template": "quote"
  },
  {
    "text": "This mighty warrior has seen his fair share of battle, but until the war is won his resolve will not falter.",
    "template": "quote"
  },
  {
    "text": "You can't keep a good necromancer down...or his legion of undead warriors. It looks like Varrock may be about to have a very bad day!",
    "template": "quote"
  },
  {
    "text": "There's nothing quite like the family portrait, even if your family are a bunch of blood sucking vampires!",
    "template": "quote"
  },
  {
    "text": "The skies are aflame with the northern lights; a storm is coming...",
    "template": "quote"
  }
]